[{"chapter": "Las Vegas", "repo": "www-chapter-las-vegas", "name": "OWASP: CMD + CTRL Event! ", "date": "2020-08-26", "time": "18:00", "link": "https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/272172954/", "timezone": "US/Pacific", "description": "<p>CMD+CTRL Cyber Range was a hit from our last year's event (<a href=\"https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/263621436/\" class=\"linkified\">https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/263621436/</a>) so we are doing this again!</p> <p>OWASP Las Vegas and Security Innovation invite members to compete in the CMD+CTRL Cyber Range - intentionally vulnerable applications and websites that teach how to think like an attacker. Players have fun exploiting their way through hundreds of vulnerabilities while scoring points and moving up the leaderboard. Score at least 1,000 points, and you qualify for the gift raffle!</p> <p>Want to start early? Prepare with courses, resources, success stories and a different<br/>cyber range on Security Innovation’s Community Site.<br/>Newbies - Join us to see how many vulnerabilities you can identify<br/>Veterans - Come back to Shadow Bank and see what you missed</p> <p>Register early to reserve your spot and get a sneak peek at our cheat sheets and FAQs! <a href=\"https://web.securityinnovation.com/owasp-las-vegas\" class=\"linkified\">https://web.securityinnovation.com/owasp-las-vegas</a></p> "}, {"chapter": "Uruguay", "repo": "www-chapter-uruguay", "name": "Workshop ZAP y Defect Dojo", "date": "2020-09-03", "time": "19:00", "link": "https://www.meetup.com/OWASP-Uruguay-Chapter/events/272569351/", "timezone": "America/Montevideo", "description": "<p>En esta Meetup virtual haremos un workshop donde les enseñaremos a utilizar las siguientes herramientas de OWASP:</p> <p>ZAP (Zed Attack Proxy): les mostraremos que es, dónde se puede obtener, cómo se puede ejecutar, cómo se usa y algunas de sus principales funcionalidades. También, les mostraremos para que nos sirve si somos desarrolladores y les contaremos como lo podemos integrar en un ambiente de CI/CD.</p> <p>Defect Dojo: les contaremos cómo usarlo para buscar y administrar las vulnerabilidades encontradas en un producto, tecnología o servidor.</p> <p>Para poder ir probando lo que mostramos en las presentaciones y demostraciones de ambas herramientas se recomienda tener instalado Docker de antemano y descargar las siguientes imágenes de antemano:<br/>- OWASP ZAP: owasp/zap2docker-stable<br/>- OWASP DefectDojo: defectdojo/defectdojo-django<br/>- OWASP Juice Shop: bkimminich/juice-shop<br/>(puede que agreguemos otras imágenes a esta lista mientras avancemos en la preparación del workshop, por lo que se recomienda revisarla al acercarse la fecha del evento)</p> "}, {"chapter": "Uruguay", "repo": "www-chapter-uruguay", "name": "AppSec Days - Summer of Security", "date": "2020-08-25", "time": "13:00", "link": "https://www.meetup.com/OWASP-Uruguay-Chapter/events/271426480/", "timezone": "America/Montevideo", "description": "<p>OWASP Foundation estará realizando una nueva serie de eventos internacionales virtuales en el que los participantes podrán anotarse y realizar un nuevo training. Tener en cuenta que estos training son pagos, se realizarán todos a la misma vez (solo se podrá realizar uno de ellos en cada evento) y se dictan en Inglés.</p> <p>Los links a la página de cada evento son:<br/>- Junio (23-24): <a href=\"https://june.appsecdays.org/\" class=\"linkified\">https://june.appsecdays.org/</a><br/>- Julio (28-29): <a href=\"https://july.appsecdays.org/\" class=\"linkified\">https://july.appsecdays.org/</a><br/>- Agosto (25-26): <a href=\"https://august.appsecdays.org/\" class=\"linkified\">https://august.appsecdays.org/</a></p> "}, {"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "DevSecBots: Bot the Gap", "date": "2020-08-26", "time": "20:00", "link": "https://www.meetup.com/SGSecurityMG/events/272160770/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Indore", "repo": "www-chapter-indore", "name": "OWASP INDORE & DC91731 VIRTUAL MEETUP", "date": "2020-08-23", "time": "11:00", "link": "https://www.meetup.com/OWASP-Indore-Chapter/events/272609189/", "timezone": "Asia/Calcutta", "description": "<p>OWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.</p> <p>Date: Sunday 23 August 2020</p> <p>Session Details/Agenda:</p> <p>11:00 AM - 11:10 AM : Introduction of speaker.</p> <p>11:10 AM - 11:50 AM : Blind SQL Injection [ Ansh Bhawnani ]</p> <p>11:50 AM - 12:10 PM : Discussion and Q/A.</p> <p>12:10 PM - 12:50 PM : Unrestricted File Upload [ Raju Kumar ]</p> <p>12:50 PM - 01:10 PM : Discussion and Q/A.</p> <p>Introducing Speakers &amp; their Topics :-</p> <p>Blind SQL Injection :- Blind SQL injection is a type of SQL Injection attack that asks the database true or false questions and determines the answer based on the applications response. This attack is often used when the web application is configured to show generic error messages, but has not mitigated the code that is vulnerable to SQL injection.</p> <p>Intro of Speaker :- Ansh Bhawnani is a hackfluencer and a security researcher. He is a cyber security trainer and has been teaching cyber security since past 4 years. He has a YouTube channel with over 108K subscribers.</p> <p>Unrestricted File Upload :- Uploaded files represent a significant risk to applications. The first step in many attacks is to get some code to the system to be attacked. Then the attack only needs to find a way to get the code executed. Using a file upload helps the attacker accomplish the first step.</p> <p>Intro of Speaker :-</p> <p>Raju Kumar is currently Synack Red Team member. He has participated in many bug bounties program &amp; Recognised by many Companies likeDell, Mastercard, Netgear, DigitalOcean , Western Union, Genymotion and many more for finding a critical vulnerability in their website.</p> <p>RSVP Link :- <a href=\"https://forms.gle/nAWyTSb5LgUmS2N3A\" class=\"linkified\">https://forms.gle/nAWyTSb5LgUmS2N3A</a></p> "}, {"chapter": "Northern Virginia", "repo": "www-chapter-northern-virginia", "name": "AppSec, DevSecOps, and IoT - Oh My!", "date": "2020-08-20", "time": "18:30", "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/272348331/", "timezone": "US/Eastern", "description": "<p>Abstract: It doesn't take much to realize that the world of IoT has exploded. How many now have a Ring doorbell and are using Alexa to control their homes? Sensors, indicators and trackers are everywhere and many times we are not even aware of it. But in a world where there is an ever-increasing threat landscape and more attacks then ever, where does security fit in? How do we balance convenience, speed and data integrity? And when we realize that behind every device is an application that will process that data and then communicate to another application, how do we ensure that those applications are secure? This is why Application Security and DevSecOps are so important in this space and make all the difference between success and failure.</p> <p>Bio: Rob is currently a Global Application Security Sales Evangelist for HCL providing thought leadership for the application security space, particularly as it relates to DevOps and DevSecOps initiatives. Prior to this role, Rob was with IBM for 14 years with roles in Application Security Evangelism, Worldwide Sales Enablement, Tiger Teams and Field Services for the Management and Platform Segment offerings in IBM Cloud. Rob has worked with clients all over the world to help address their challenges in ways that bring a positive impact to the business bottom line. Rob has spoken at numerous events and conferences, including Evanta CISO Summits, THINK, InterConnect, DevloperConnect, IBM Top Guns and many customer events. Prior to IBM, Rob spent 13 years with 5 different companies working as a configuration management specialist with an emphasis on Rational tooling. Rob graduated from the University of Southern California with a degree in Aerospace Engineering and is an avid fan of college football. When not at work, Rob enjoys spending time with his family, serving with his church, running and cycling. You can connect with Rob via LinkedIn, Facebook and Instagram but the best way is by joining the “Robservatory” on twitter using the handle @Robservatory.</p> "}, {"chapter": "Oklahoma City", "repo": "www-chapter-oklahoma-city", "name": "Test your skills on the CMD+CTRL Cyber Range", "date": "2020-08-27", "time": "16:00", "link": "https://www.meetup.com/Oklahoma-City-Chapter-Meetup/events/272195625/", "timezone": "US/Central", "description": "<p>Join your friends in the OWASP Oklahoma City chapter for a unique and challenging event featuring the CMD+CTRL Cyber Range on Thursday, August 27th starting at 4:00pm CT.</p> <p>What is a Cyber Range?<br/>CMD+CTRL Cyber Ranges are intentionally vulnerable applications and websites that tempt players to steal money, view their boss’s salary, buy expensive items for free, and conduct other nefarious acts. Hundreds of vulnerabilities, common to most business applications, lay waiting.</p> <p>For each vulnerability you find, you’ll get points added to your score and climb the live leaderboard. Top scorers get prizes, but all players have fun!</p> <p>Worried you won’t know what to do?<br/>Don’t worry. We’ll provide cheatsheets and tips to get you quickly ramped up.</p> <p>Register online at: <a href=\"https://web.securityinnovation.com/owasp-okc\" class=\"linkified\">https://web.securityinnovation.com/owasp-okc</a></p> "}, {"chapter": "Bay Area", "repo": "www-chapter-bay-area", "name": "WoSEC x Bay Area OWASP Event: OWASP Top 10 with Tanya Janca", "date": "2020-09-02", "time": "17:30", "link": "https://www.meetup.com/Bay-Area-OWASP/events/272583414/", "timezone": "US/Pacific", "description": "<p>Please join us for a crossover event, co-hosted with WoSEC-San Francisco. We feature Tanya Janca speaking followed by overviews of the WoSEC and OWASP organizational missions.</p> <p>Title: Summary of the OWASP Top Ten (2017)<br/>Have you always wondered what The OWASP Top Ten was all about? Join us for a presentation and discussion that will overview what the Top Ten really is, and what each of them mean. There will be no demonstrations, but there will be open discussion and audience participation.</p> <p>Bio:<br/>Tanya Janca, also known as SheHacksPurple, is the author of ‘Alice and Bob Learn Application Security’. She is also the founder of We Hack Purple, an online learning academy, community and weekly podcast that revolves around teaching everyone to create secure software. Tanya has been coding and working in IT for over twenty years, won numerous awards, and has been everywhere from startups to public service to tech giants (Microsoft, Adobe, &amp; Nokia). She has worn many hats; startup founder, pentester, CISO, AppSec Engineer, and software developer. She is an award-winning public speaker, active blogger &amp; streamer and has delivered hundreds of talks and trainings on 6 continents. She values diversity, inclusion and kindness, which shines through in her countless initiatives.</p> <p>Founder: We Hack Purple (Academy, Community and Podcast), WoSEC International (Women of Security), OWASP DevSlop, OWASP Victoria, #CyberMentoringMonday</p> "}, {"chapter": "Bay Area", "repo": "www-chapter-bay-area", "name": "Hacker Days: Kubernetes Security: From Control Plane to Layer 7", "date": "2020-08-20", "time": "11:00", "link": "https://www.meetup.com/Bay-Area-OWASP/events/272516000/", "timezone": "US/Pacific", "description": "<p>Kubernetes infrastructure dominates the container orchestration market. Despite its popularity, 43% of engineers say security challenges block Kubernetes adoption. Engineers embrace Kubernetes for its agility and scalability, but with speed comes inherent security risks. It’s critical to secure each layer of infrastructure, from the control plane to layer 7, in order to isolate threats and prevent further damage. Join our next discussion with Jimmy Mesta of Signal Sciences to learn a defense-in-depth approach when securing containerized apps. DevOps professionals will learn to mitigate security pitfalls like permissions mistakes, misconfigurations, or infrastructure blindspots.</p> <p>Speaker details:- Jimmy Mesta is a veteran DevOps leader with 15+ years of experience. He is the Head of Security Research at Signal Sciences, a web application security company based in Los Angeles. Jimmy has spent time on both the offensive and defensive side of the industry, working to build modern, developer-friendly security solutions. He previously ran the local Santa Barbara OWASP chapter and taught Kubernetes, Docker, DevOps, mobile security, and pentesting courses for Manicode.</p> "}, {"chapter": "Orange County", "repo": "www-chapter-orange-county", "name": "Virtual (Mini-Summer Bash) Meeting: SAST & SCA Workflows", "date": "2020-08-25", "time": "17:30", "link": "https://www.meetup.com/OWASP-OC/events/272536189/", "timezone": "US/Pacific", "description": "<p>Speaker: Rich Newman, Sales Engineer at Synopsys</p> <p>Topic: SAST &amp; SCA Workflows</p> <p>Abstract:<br/>Static Application Security Testing (SAST) and Software Composition Analysis (SCA) tools can detect many different types of issues. Their ideal operation may be confused since they are both regarded as static analysis tools. In addition, each technology detects several types of issues which are best identified and resolved using specific workflows.</p> <p>In this session we will go over the various types of issues SAST and SCA tools can detect and suggestions on effective workflows to resolve those issues.</p> <p>Join us for a discussion on workflows for the detection and remediation of:</p> <p>* Known vulnerabilities and exploits<br/>* Reciprocal licenses<br/>* Weak or unexportable cryptography<br/>* Unknown vulnerabilities<br/>* Software defects<br/>* Compliance issues</p> <p>Schedule:<br/>5:30pm: Presentation &amp; Q&amp;A<br/>6:30pm: Raffle (gift certificates sponsored by Synopsys)</p> <p>Unlike our usual Summer Bash events, this event is BYOB. Our meeting sponsor, Synopsys, will provide Uber Eats or Grubhub credit in the form of gift cards for people in the Orange County and immediate surrounding areas sometime during the meeting.</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2020-08-27", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqybclbkc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP Meetup - IAST & OSA", "date": "2020-08-27", "time": "19:00", "link": "https://www.meetup.com/OWASP-STL/events/268671057/", "timezone": "US/Central", "description": ""}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "August Virtual Chapter Meeting", "date": "2020-08-27", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/272254724/", "timezone": "US/Mountain", "description": "<p>This month's meetup will be VIRTUAL, given current state of social distancing. Please join Wasatch AppSec Slack and suggest any additional topics.</p> <p>Thanks to Hirevue (and Jake Schroeder) for providing the Zoom session.</p> <p>Agenda:<br/>12-12:45pm<br/>- QA Security Test Cases:<br/>*Building Security Test Templates<br/>*What is the scope?<br/>*Functional/Integration Testing</p> <p>- AppSec Controls Priority</p> <p>12:45-1pm<br/>Open Forum, Admin Items, Choose next Guest Speaker</p> <p>-----<br/>Jake Schroeder is inviting you to a scheduled Zoom meeting.<br/>Topic: Wasatch AppSec Meetup<br/>Time: Aug 27, 2020 12:00 PM Mountain Time (US and Canada)<br/>Join Zoom Meeting<br/><a href=\"https://hirevue.zoom.us/j/97102626886?pwd=U1RVd25rUlBWVVptTVRPNTRLUnVKUT09\" class=\"linkified\">https://hirevue.zoom.us/j/97102626886?pwd=U1RVd25rUlBWVVptTVRPNTRLUnVKUT09</a><br/>Meeting ID: 971 0262 6886<br/>Passcode: 808939<br/>One tap mobile<br/>+16699006833,,97102626886#,,,,,,0#,,808939# US (San Jose)<br/>+12532158782,,97102626886#,,,,,,0#,,808939# US (Tacoma)<br/>Dial by your location<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 646 876 9923 US (New York)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>Meeting ID: 971 0262 6886<br/>Passcode: 808939<br/>Find your local number: <a href=\"https://hirevue.zoom.us/u/agbmrQNRl\" class=\"linkified\">https://hirevue.zoom.us/u/agbmrQNRl</a><br/>Join by SIP<br/>97102626886@zoomcrc.com<br/>Join by H.323<br/>162.255.37.11 (US West)<br/>162.255.36.11 (US East)<br/>115.114.131.7 (India Mumbai)<br/>115.114.115.7 (India Hyderabad)<br/>213.19.144.110 (EMEA)<br/>103.122.166.55 (Australia)<br/>64.211.144.160 (Brazil)<br/>69.174.57.160 (Canada)<br/>207.226.132.110 (Japan)<br/>Meeting ID: 971 0262 6886<br/>Passcode: 808939</p> "}, {"chapter": "Bangalore", "repo": "www-chapter-bangalore", "name": "OWASP Bangalore Monthly Meet 29 August 2020", "date": "2020-08-29", "time": "10:00", "link": "https://www.meetup.com/OWASP-Bangalore-Chapter/events/272556608/", "timezone": "Asia/Calcutta", "description": "<p>Hi Everyone</p> <p>#security stay safe</p> <p>OWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.</p> <p>Sessions:<br/>Date: Saturday 29 August 2020</p> <p>Sessions:<br/>To Be Decided</p> "}, {"chapter": "Bristol Uk", "repo": "www-chapter-bristol-uk", "name": "TBC", "date": "2020-09-17", "time": "18:00", "link": "https://www.meetup.com/OWASP-Bristol/events/268319035/", "timezone": "Europe/London", "description": "<p>TBC</p> "}, {"chapter": "Iiit Sricity", "repo": "www-chapter-iiit-sricity", "name": "OWASP IIIT Sri City Meetup - 20th August 2020", "date": "2020-08-20", "time": "15:00", "link": "https://www.meetup.com/OWASP-IIIT-SRICITY/events/272547282/", "timezone": "Asia/Calcutta", "description": "<p>The motto of the OWASP community is to share the knowledge about cybersecurity, free of cost.</p> <p>Session Details:</p> <p>Introduction to OWASP IIIT Sri City Chapter.</p> <p>Cryptography by Tanay Rathore:</p> <p>Topics to be covered:</p> <p>* Calculating MD5, SHA, RIPMED, CRC using various tools<br/>* File and text encryption<br/>* Advanced Encryption Package<br/>* Self Signed Certificates<br/>* Disk encryption - Veracrypt and Rohos<br/>Theory<br/>* Intro<br/>* Algorithms<br/>* Tools<br/>* PKI<br/>* Email and Disk encryption<br/>* Cryptography attacks<br/>* Cryptanalysis tools</p> <p>QnA, General Discussion and Feedback.</p> <p>Follow us on Twitter: @OWASP_IIITS<br/>Discord: <a href=\"https://discord.gg/7fjr9B3\" class=\"linkified\">https://discord.gg/7fjr9B3</a></p> <p>Prerequisites:<br/>1) Laptop.<br/>2) Working internet connection.<br/>3) An open mind with a willingness to learn.</p> "}]