[{"chapter": "Las Vegas", "events": [{"name": " Operationalizing OWASP SAMM for a Cloud Security Program", "date": "2020-07-30", "time": "17:00", "link": "https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/271846546/", "timezone": "US/Pacific", "description": "<p>The security team at Snowflake used OWASP SAMM to improve both application and infrastructure security posture. A lot of effort and creativity went into applying the framework in a fast-growing operational environment. Securing Snowflake's cloud-native service also required us to cover cloud infrastructure elements that weren't obvious in the framework definition. In this talk, I will share from our experience, what worked and what didn't, and how analytics played a key role in measuring maturity with live data.</p> "}]}, {"chapter": "Bhopal", "events": [{"name": "OWASP BHOPAL MEETUP - YARA RULES 101", "date": "2020-08-02", "time": "14:00", "link": "https://www.meetup.com/OWASP-Bhopal-Chapter/events/272148565/", "timezone": "Asia/Calcutta", "description": "<p>As Owasp Bhopal Community we have come up with Jan-2020 Monthly meet for the Community.</p> <p>There will be a one-hour session on the topic \"YARA RULES 101\" by Lakshya Dubey.</p> <p>It will be a fully virtual meetup and the details Regarding The virtual platform will be communicated shortly.</p> "}]}, {"chapter": "Salt Lake City", "events": [{"name": "July Virtual Chapter Meeting", "date": "2020-07-30", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/272185117/", "timezone": "US/Mountain", "description": "<p>This month's meetup will be VIRTUAL, given current state of social distancing. Please join Wasatch AppSec Slack and suggest any additional topics.</p> <p>Thanks to Hirevue (and Jake Schroeder) for providing the Zoom session.</p> <p>Agenda:<br/>12-12:45pm<br/>Paved Paths (Jason White? Or Open Discussion)<br/>QA Test Cases (What should be in scope?)<br/>Threat Modeling tools and work flows<br/>12:45-1pm<br/>Open Forum, Admin Items</p> <p>-----<br/>Jake Schroeder is inviting you to a scheduled Zoom meeting.<br/>Topic: Utah App Sec<br/>Time: Jul 30, 2020 12:00 PM Mountain Time (US and Canada)<br/>Join Zoom Meeting<br/><a href=\"https://hirevue.zoom.us/j/93463351692?pwd=N1ZOQmVXMTV3dS84Nm9jMVZNUCtxdz09\" class=\"linkified\">https://hirevue.zoom.us/j/93463351692?pwd=N1ZOQmVXMTV3dS84Nm9jMVZNUCtxdz09</a><br/>Meeting ID: 934 6335 1692<br/>Passcode: 986060<br/>One tap mobile<br/>+12532158782,,93463351692#,,,,,,0#,,986060# US (Tacoma)<br/>+13462487799,,93463351692#,,,,,,0#,,986060# US (Houston)<br/>Dial by your location<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>+1 646 876 9923 US (New York)<br/>Meeting ID: 934 6335 1692<br/>Passcode: 986060<br/>Find your local number: <a href=\"https://hirevue.zoom.us/u/alE3y0hnu\" class=\"linkified\">https://hirevue.zoom.us/u/alE3y0hnu</a><br/>Join by SIP<br/>93463351692@zoomcrc.com<br/>Join by H.323<br/>162.255.37.11 (US West)<br/>162.255.36.11 (US East)<br/>115.114.131.7 (India Mumbai)<br/>115.114.115.7 (India Hyderabad)<br/>213.19.144.110 (EMEA)<br/>103.122.166.55 (Australia)<br/>64.211.144.160 (Brazil)<br/>69.174.57.160 (Canada)<br/>207.226.132.110 (Japan)<br/>Meeting ID: 934 6335 1692<br/>Passcode: 986060</p> "}]}, {"chapter": "Cambridge", "events": [{"name": "ARU CSNRG, OWASP Cambs & BCS  \"2020 Verizon Data Breach Investigations\" Webinar", "date": "2020-07-30", "time": "18:45", "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/271922180/", "timezone": "Europe/London", "description": "<p>Thursday 30th July 2020 18:45 – 20:45 - Online</p> <p>Hosted by the Cyber Security &amp; Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter &amp; BCS Cybercrime Forensics SG.</p> <p>Background</p> <p>OWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.</p> <p>The Cyber Security and Networking (CSN) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP &amp; the UK Cyber Security Forum amongst others.</p> <p>The BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.</p> <p>Speaker Biographies &amp; Abstracts</p> <p>Deepinder Chhabra, Head of Security Assurance (UK&amp;I) with Verizon Business Group, \"2020 Verizon Data Breach Investigations, Digital Shadows\" .</p> <p>Bio: Deepinder (Deep) is Head of Security Assurance (UK&amp;I) with Verizon Business Group in the Security Consulting and Advisory Services.<br/>He challenges, educates and engages senior stakeholders on many critical issues related to cybersecurity and the adoption of new disruptive technologies. He encourages innovative thinking to generate actionable strategies that help business thrive in a volatile, uncertain, complex and ambiguous (VUCA) world while managing their risks.<br/>In a career spanning thirty years, Deep has worked with many of the FTSE 500 companies organisations.</p> <p>Deep is an avid speaker and has addressed several conferences and events with wide-ranging topics on Cybersecurity, Cloud Security, DBIR, GDPR, Big Data Analytics and Artificial Intelligence.</p> <p>Deep holds a Post Graduate Diploma in Business Management. He has received Executive Education at Harvard Business School Executive and Cranfield University. He holds various industry qualifications including CCISO, CISA, CISM, CRISC, CGEIT, CISSP, ISO/IEC 27001 Lead Auditor.</p> <p>He is currently pursuing Professional Doctorate in Data Science.<br/>Deep's voluntary roles include the President/Chair of the ISACA London Chapter.</p> <p>Abstract :</p> <p>Latest 2020 Verizon Data Breach Investigations Report (DBIR) was published a few days back. This comprehensive and free informative report - now in its 13th year - provides invaluable insight about cybercrime trends worldwide in a wide range of industries. One of the most respected publications in cybersecurity DBIR 2020, analyses over 150,000 incidents and provides a comprehensive report covering the incidents and breaches that met Verizon’s quality standards.<br/>Many security leaders use the DBIR to sharpen the focus of their security efforts and to educate stakeholders who need to better understand real cyber risks.</p> <p>In this session, Deepinder Chhabra (Deep) will present the key findings and highlights of the DBIR.</p> <p>Provisional Agenda</p> <p>18:45 - Webinar waiting lobby opens<br/>19:00 - Presentation followed by Questions and Answers<br/>20:00 - Closing, with virtual networking</p> <p>Registration</p> <p>To register for this free event, please register online:</p> <p><a href=\"https://attendee.gotowebinar.com/register/1574728658042752271\" class=\"linkified\">https://attendee.gotowebinar.com/register/1574728658042752271</a></p> "}]}, {"chapter": "Zhytomyr", "events": [{"name": "OWASP Zhytomyr meetup (Zoom)", "date": "2020-07-31", "time": "18:30", "link": "https://www.meetup.com/OWASP-Zhytomyr-Chapter/events/271985702/", "timezone": "Europe/Kiev", "description": "<p>Всем привет! Рады сообщить, что дата ивента уже есть! 31 Июля в 18:30 (Zoom) пройдет первый веб ивент OWASP Zhytomyr chapter!<br/>К Вашему вниманию:<br/>1. Богдан Никитенко: “OWASP top 10 Mobile with the real life examples”<br/>2. Meferytskyi Oleksandr: “Fake-to-fake communication”<br/>Всех желающих просим записаться на ивент в meetup, чтоб получить ссылочку на Zoom</p> "}]}, {"chapter": "Nashua", "events": [{"name": "Getting back into the Groove", "date": "2020-08-03", "time": "18:00", "link": "https://www.meetup.com/OWASP-Nashua-Chapter/events/272054629/", "timezone": "US/Eastern", "description": "<p>We've been on pause during the pandemic, but I thought I'd try running a virtual meetup and see how it goes. For this first one, it'll just be a meet and greet event, let us catch up from the last six months and see if there's interest in having virtual meetings. If so, we'll get something more substantial planned for September.</p> "}]}, {"chapter": "Porto Alegre", "events": [{"name": "OWASP Chapter POA - Encontro 003 [ONLINE]", "date": "2020-07-30", "time": "19:30", "link": "https://www.meetup.com/OWASP-Porto-Alegre-Chapter/events/272072547/", "timezone": "America/Sao_Paulo", "description": "<p>Buenas pessoal,</p> <p>No próximo dia 30 vamos ter o nosso terceiro encontro do capítulo OWASP de Porto Alegre. Vai ser às 19:30. A inscrição deve ser feita aqui pelo Meetup.</p> <p>Desta vez o assunto é Bug Bounty e vamos receber o Manoel Netto que é Mestre em Engenharia de Software pela PUC-Rio, Bug Hunter e Pentester no Hackerone.</p> <p>Nos vemos lá...</p> "}]}]