[{"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "Big Data – Advanced Security Analytics", "date": "2020-09-29", "time": "19:30", "link": "https://www.meetup.com/SGSecurityMG/events/273202418/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Jakarta", "repo": "www-chapter-jakarta", "name": "Operationalizing Threat Intelligence with Automation and Collaboration", "date": "2020-09-26", "time": "10:30", "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/272946597/", "timezone": "Asia/Jakarta", "description": "<p>Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…<br/>• Tool dan standar keamanan aplikasi<br/>• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan<br/>• Kendali keamanan dan pustaka standar<br/>• Cabang lokal di seluruh dunia<br/>• Riset terkini<br/>• Konferensi lengkap di seluruh dunia<br/>• Mailing list<br/>• Dan banyak lagi … di www.owasp.org</p> <p>Kali ini OWASP akan membahas :</p> <p>1. \"Operationalizing Threat Intelligence with Automation and Collaboration</p> <p>Abstrack:<br/>For defenders in the current situation, Threat Intel is all about IOCs which are more technical in nature and covers aspects that have a very short lifespan. By the time controls are put in place to thwart the technical IOCs, attackers change it and counter with new attacks. So, it becomes essential for defenders to continuously automate the Threat Intelligence actioning and harness the tactical information as well used by attackers and have countermeasures in place.</p> <p>By automating Threat Intel collection, analysis, and dissemination, we can deduce predictive intelligence providing greater visibility to the organizations while allowing them to anticipate and counter threats even before they attack. We will discuss how end-to-end threat intelligence automation in a closed trusted sharing environment could be used to operationalize actionable and relevant predictive intelligence by correlating, enriching, and analyzing threat data collected in real-time from a wide range of external and internal sources over a hub and spoke sharing model. We will also cover advanced automation strategies for the full threat intelligence lifecycle while detailing how mutual threat sightings could be used to identify and prioritize threats with precision confidence.</p> <p>High Level Agenda for Presentation</p> <p>Collective Defense Vs Passive Defense Vs Active Defense</p> <p>Threat Intelligence and Its types</p> <p>Threat Intelligence Operationalisation</p> <p>Threat Intelligence Automation / Orchestration</p> <p>Threat Intelligence Collaboration</p> <p>Collective Defense</p> <p>Takeaways</p> <p>---<br/>Short bio :<br/>Avkash K<br/>VP - Research and Innovation at Cyware Labs</p> <p>Information Security professional with overall 12+ years of experience in Information Security domain. Currently heading Research and Innovation in Cyber Fusion and Threat Intelligence domain within security product company Cyware Labs. Also Null Mumbai(Open security community) Chapter Leader.</p> <p>Experienced in SOC/CSIRT Management,Cyber Fusion, Cyber Resiliency, Threat Hunting, Threat Intelligence and research, Enterprise Security Architecture, Network Security management.</p> <p>Waktu dan Tempat :<br/>26th September 10:30 - 11:30 WIB</p> <p>Catatan :<br/>- Peserta online menggunakan aplikasi Zoom di komputer / laptop / tablet / smartphone<br/>- Acara ini free for everyone<br/>- Password untuk join meeting akan dikirim kan kepeserta setelah register</p> <p>Venue :<br/>Online by zoom</p> <p>Support our Conference<br/>OWASP AppSec Indonesia 2020</p> "}, {"chapter": "Northern Virginia", "repo": "www-chapter-northern-virginia", "name": "OWASP SAMMv2 and how it is helping protect future elections", "date": "2020-09-24", "time": "18:30", "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/273167347/", "timezone": "US/Eastern", "description": "<p>The OWASP Software Assurance Maturity Model (SAMM) gives you a structural and measurable framework. It enables you to formulate and implement a strategy for software security that is tailored to the risk profile of your organization. In this talk, we give an overview of the new release of the SAMM v2 model. After 10 years since its first conception, it was important to align it with today’s development practices. We will cover the core structure of the model, which was redesigned and extended to align with modern development practices, and the new security practice streams where the SAMM activities are grouped in maturity levels. We will also talk about how SAMM is currently being incorporated into the RABET-V project from the Center for Internet Security (CIS) in collaboration with the US Election Assistance Commission (EAC) to provide a verification standard for non-voting software. RABET-V is a flexible, risk-based, and cost-effective election system verification process that will expedite verification of non-voting election systems while providing assurances of security, reliability, and usability.</p> <p>Bio:<br/>Brian Glas has worked in IT for 20 years and Information/Application Security for the 15 years. He started as an enterprise Java developer, then transitioned to helping build an application security program as both tech lead and manager. He later played the role of enterprise architect and did a little incident response and reverse engineering malware for fun. Glas then spent several years as a consultant helping clients build AppSec programs, create/update SDLCs, and other related initiatives. He has worked on the Trustworthy Computing team at Microsoft and is now an Assistant Professor of Computer Science at Union University authoring a Cybersecurity program. He also has been a co-lead for SAMM v1.1-2.0 and the OWASP Top 10 for several years.</p> "}, {"chapter": "Bay Area", "repo": "www-chapter-bay-area", "name": "The double-ratchet algorithm: its security and privacy", "date": "2020-09-23", "time": "14:00", "link": "https://www.meetup.com/Bay-Area-OWASP/events/273300627/", "timezone": "US/Pacific", "description": "<p>Over the last years, we have seen the rise of one algorithm: the<br/>double-ratchet algorithm, as the defacto algorithm to be used on secure<br/>messaging applications. But, what does it make it so compelling? Why is<br/>it very much used? On this talk, we will give an overview of the<br/>double-ratchet algorithm, we will describe which privacy and security<br/>properties it gives, and we will discuss the reasons of why it is so used.</p> <p>---<br/>Presenter: Sofía Celi (<a href=\"https://twitter.com/claucece\" class=\"linkified\">https://twitter.com/claucece</a>)</p> <p>Sofía Celi is a cryptography researcher and implementer at Cloudflare.<br/>She also leads the design and implementation of the version 4 of the<br/>Off-the-Record messaging protocol. She is very much interested in the<br/>intersection of cryptography with real-world issues.<br/><a href=\"https://claucece.github.io\" class=\"linkified\">https://claucece.github.io</a></p> <p>---<br/>Bay Area OWASP (<a href=\"https://meetup.com/Bay-Area-OWASP\" class=\"linkified\">https://meetup.com/Bay-Area-OWASP</a>)</p> <p>This meetup is a joint meetup with the Bay Area chapter of the Open Web Application Security Project (OWASP) group which is dedicated to bringing together Bay Area web application security talent and interest in the form of presentations, talks, conferences.</p> <p>---<br/>Cryptography Meetup (<a href=\"https://www.meetup.com/Cryptography-Meetup\" class=\"linkified\">https://www.meetup.com/Cryptography-Meetup</a>)</p> <p>The goal of the Cryptography Meetup is to make cryptography more approachable for programmers.</p> <p>If you’re a programmer looking to explore, understand and build systems that use cryptographic algorithms, come learn with us. If you’re a cryptographer come share your knowledge with implementers.</p> <p>We start all our discussions &amp; presentations from the basics, without assuming any prior knowledge of complex mathematics or cryptographic primitives.</p> "}, {"chapter": "Columbus", "repo": "www-chapter-columbus", "name": "Risk Measurement and Management Using Open Source Tooling with Joe Kuemerle", "date": "2020-09-24", "time": "12:00", "link": "https://www.meetup.com/Columbus-OWASP/events/272802528/", "timezone": "US/Eastern", "description": "<p>Clearly this is a mess, but we are making the best of it. We are meeting virtually on Google Meet.</p> <p>Developers continue to build more and more software, and even with tooling and automation there is always more security work to do than can be done. Being able to prioritize work is a strategic advantage but how do you fairly and consistently judge what is important?<br/>Having a consistent and repeatable process to estimate, track and rank the risk level of systems is critical to successfully managing your workload.</p> <p>In this session you will build a self contained risk measurement application based on open risk assessment standards and using only browser based, open source resources.</p> <p>About Joe:</p> <p>Joe Kuemerle is an application security engineer, developer and speaker in the greater New York City area specializing in application security, development, database and application lifecycle topics. He is active in the technical community as well as a speaker at local, regional and national events. Kuemerle blogs at www.kuemerle.com and is on Twitter as @jkuemerle.</p> "}, {"chapter": "Orange County", "repo": "www-chapter-orange-county", "name": "Virtual Meeting: Introducing OWASP IoTGoat; a deliberately insecure firmware", "date": "2020-09-24", "time": "17:45", "link": "https://www.meetup.com/OWASP-OC/events/273263847/", "timezone": "US/Pacific", "description": "<p>Speaker: Aaron Guzman: Author; Tech Editor; OWASP Project Leader; CSA IoT WG Co-Chair; ProdSec @ Cisco Meraki</p> <p>Topic: Introducing OWASP IoTGoat; a deliberately insecure firmware</p> <p>Abstract:<br/>The OWASP IoTGoat Project is a deliberately insecure firmware based on OpenWrt and maintained by OWASP as a platform to educate software developers as well as security professionals with testing commonly found vulnerabilities in IoT devices. Vulnerability challenges are based on the 2018 OWASP IoT Top 10 , as well as \"easter eggs\" from project contributors. This presentation will provide an overview of the project and exciting items on the roadmap for future versions.</p> <p>Speaker Bio:<br/>Aaron Guzman is a passionate Information Security professional specializing in IoT security. Aaron has extensive public speaking experience delivering conference presentations, trainings, and workshops globally. Mr. Guzman co-authored of “IoT Penetration Testing Cookbook” as well as a Technical Editor for IoT Security related books with Packt Publishing and No Starch Press. Over the years, he has contributed to several IoT security guidance publications and helps lead both OWASP’s Embedded Application Security and Internet of Things projects.</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "All you can eat Top Ten Lists", "date": "2020-09-24", "time": "15:00", "link": "https://www.meetup.com/owasptriangle/events/lckdnqybcmbgc/", "timezone": "US/Eastern", "description": "<p>The OWASP Top 10 gets all the attention, but did you know that there are at least eight other \"top ten\" lists in the OWASP universe? In this session, we'll explore the Mobile, API Security, Privacy Risks, IoT, Docker, and Serverless Top 10 lists, highlighting where they align and where they differ. We'll expand your thinking about classes of application security risks, and how they apply to the various types of technologies in our industry today. As security folks, we want to have a vibrant and extensive understanding of new technologies, and more importantly, the application security issues we must watch for with each type of tech.</p> <p>Featuring the:<br/>• OWASP Top Ten 2017<br/>• OWASP Mobile Top 10<br/>• OWASP API Security Top 10 2019<br/>• OWASP Proactive Controls<br/>• OWASP Top 10 Privacy Risks<br/>• OWASP Internet of Things (IoT) Top 10 2018<br/>• OWASP Docker Top 10<br/>• OWASP Serverless Top 10</p> <p>Bio: Chris Romeo is CEO and co-founder of Security Journey, building security culture influencing education. His passion is to bring security culture change to all organizations, large and small, by creating and designing gamified security programs. Chris is a highly rated industry speaker and trainer, featured at RSA Conference, OWASP Global AppSec, and ISC2 Security Congress. Chris was the Chief Security Advocate at Cisco for five years, empowering engineers to shift security left in all products at Cisco and led Cisco’s security belt program (Cisco Security Ninja). Chris has twenty-three years of security experience, holding positions across the gamut, including application security, security engineering, and incident response. Chris holds the CISSP and CSSLP certifications. For more information, see <a href=\"https://www.linkedin.com/in/securityjourney/\" class=\"linkified\">https://www.linkedin.com/in/securityjourney/</a></p> "}, {"chapter": "Sacramento", "repo": "www-chapter-sacramento", "name": "OWASP Sacramento - September (Remote Only - Google Hangouts)", "date": "2020-09-25", "time": "19:00", "link": "https://www.meetup.com/OWASP-Sacramento-Chapter/events/273309721/", "timezone": "US/Pacific", "description": "<p>Please note that this meetup is remote only!!</p> <p>Happy September, Chapter!</p> <p>Hope everyone is safe!</p> <p>This month, out of abundance of caution, we are going to hold our meetup remotely on Google Hangouts. Please try to join from a computer.</p> <p><a href=\"https://meet.google.com/xzu-iiiq-mmx\" class=\"linkified\">https://meet.google.com/xzu-iiiq-mmx</a></p> <p>Here is what we are going to cover this month.</p> <p>Agenda:<br/>- Community Topics<br/>- Main Topic: TBD<br/>- Q&amp;A</p> <p>For more information about OWASP, please visit our Wiki at <a href=\"https://owasp.org/www-chapter-sacramento/\" class=\"linkified\">https://owasp.org/www-chapter-sacramento/</a></p> "}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP Meetup - CTF", "date": "2020-10-08", "time": "19:00", "link": "https://www.meetup.com/OWASP-STL/events/268671065/", "timezone": "US/Central", "description": ""}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP GlobalAppSec (Virtual) Oct 1st-31st", "date": "2020-10-01", "time": "00:00", "link": "https://www.meetup.com/OWASP-STL/events/268671120/", "timezone": "US/Central", "description": "<p><a href=\"https://virtual.globalappsec.org/\" class=\"linkified\">https://virtual.globalappsec.org/</a></p> "}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "September Virtual Chapter Meeting", "date": "2020-09-24", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/272851924/", "timezone": "US/Mountain", "description": "<p>This month's meetup will be VIRTUAL. Please join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA</a>) to suggest any additional topics.</p> <p>Agenda:<br/>12 - 12:45pm</p> <p>Threat Modeling Discussion:<br/>--- What artifact is provided to the technical team(s)?<br/>--- How is the output utilized? (e.g. JIRA ticket, conduct a pentest?)<br/>--- Good threat model should lead to good tests</p> <p>Other Reference:<br/>- <a href=\"https://github.blog/2020-09-02-how-we-threat-model/\" class=\"linkified\">https://github.blog/2020-09-02-how-we-threat-model/</a></p> <p>12:45 - 1pm<br/>Open Forum, Admin Items, Choose next Guest Speaker</p> <p>-----<br/>Leaders Zoom Account Four is inviting you to a scheduled Zoom meeting.</p> <p>Topic: September OWASP SLC/Wasatch AppSec Chapter Meeting<br/>Time: Sep 24, 2020 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/97062000316?pwd=b0FMZkJzYjVEcGV4alN1RUJiaGRqUT09\" class=\"linkified\">https://zoom.us/j/97062000316?pwd=b0FMZkJzYjVEcGV4alN1RUJiaGRqUT09</a></p> <p>Meeting ID: 970 6200 0316<br/>Passcode: 382862<br/>One tap mobile<br/>+16699006833,,97062000316# US (San Jose)<br/>+12532158782,,97062000316# US (Tacoma)</p> <p>Dial by your location<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 929 436 2866 US (New York)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>Meeting ID: 970 6200 0316<br/>Find your local number: <a href=\"https://zoom.us/u/aDZigTO3Q\" class=\"linkified\">https://zoom.us/u/aDZigTO3Q</a></p> "}, {"chapter": "Bangalore", "repo": "www-chapter-bangalore", "name": "OWASP Bangalore Monthly Meet 26 September 2020", "date": "2020-09-26", "time": "10:00", "link": "https://www.meetup.com/OWASP-Bangalore-Chapter/events/272887757/", "timezone": "Asia/Calcutta", "description": "<p>Hi Everyone</p> <p>#security stay safe</p> <p>OWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.</p> <p>Sessions:<br/>Date: Saturday 26 September 2020</p> <p>Sessions:<br/>Kindly fill out the speaker registration form<br/><a href=\"https://docs.google.com/forms/d/1xdNhcHjMvdcI-w-fvkq_9VD8j-QzEtJkiRh-dzCSsBQ/edit\" class=\"linkified\">https://docs.google.com/forms/d/1xdNhcHjMvdcI-w-fvkq_9VD8j-QzEtJkiRh-dzCSsBQ/edit</a></p> "}, {"chapter": "Switzerland", "repo": "www-chapter-switzerland", "name": "OWASP API Security Top 10", "date": "2020-10-07", "time": "18:00", "link": "https://www.meetup.com/OWASPSwitzerland/events/273088624/", "timezone": "Europe/Zurich", "description": "<p>In December 2019, OWASP published its first top 10 risk list for API security. With this step, OWASP confirms the increasing importance of API security for companies. The talk looks at the new risks and contrasts them with the top 10 risks for web applications. While security products can help to mitigate certain risks as an additional defense line, API developers have the ultimate responsibility for their code and must know the risks to avoid them.</p> <p>This will be an online live event (link will be added before the event).</p> <p>Speaker bio of Dr. Martin Burkhart:<br/>Martin Burkhart is head of product management for Airlock at Ergon Informatik AG. Prior to that, he has been working as a software engineer and as a security researcher, concerned with data anonymization and applied cryptography. He owns an MSc and a PhD in computer science from ETH Zurich.</p> "}, {"chapter": "Timisoara", "repo": "www-chapter-timisoara", "name": "OWASP Timisoara #16 - Bug Bounty, RD and Cyber Threat Intelligence (Online)", "date": "2020-09-24", "time": "18:00", "link": "https://www.meetup.com/OWASP-Timisoara-Chapter/events/268973427/", "timezone": "Europe/Bucharest", "description": "<p>&gt; NOTE: Due to the recent developments relating to #COVID19 in #Romania, we have to make the announcement that the #16 OWASP Timisoara Chapter meetup will be ONLINE! A link with the link to online event will be submitted soon.</p> <p>This summer at the #16 OWASP Timisoara edition you will find out from experts what pushes the industry further.<br/>We will explore the latest cyber trends in Bug Bounty, Responsible Disclosure Programs presented by the OWASP Timisoara Board members (Ioana Piroska &amp; Daniel Ilies) and in Cyber threat Intelligence by Julius Nicklasson from Recorded Future.</p> <p>&gt; Summer sessions - Theme: Bug Bounty, Responsible Disclosure and Cyber Threat Intelligence</p> <p>&gt; Schedule:<br/>18:00 - 18:10 - Introduction OWASP<br/>18:10 - 18:45 - Working with Hackers (Bug Bounty and Responsible Disclosure Program) - Ioana Piroska &amp; Daniel Ilies (VISMA)<br/>18:45- 19:15 - The Automation of the Underground Economy: Magecart, Sniffers and Opportunistic Adversaries - Julius Nicklasson (Recorded Future)</p> <p>Time: 18:00 to 19:20</p> <p>&gt; What to expect:</p> <p>* Great contents with a strong focus on Bug Bounty, Responsible Disclosure and Cyber Threat Intel<br/>* Demos and best practices</p> "}, {"chapter": "Zhytomyr", "repo": "www-chapter-zhytomyr", "name": "OWASP Zhytomyr meetup №2 (Zoom)", "date": "2020-09-22", "time": "19:00", "link": "https://www.meetup.com/OWASP-Zhytomyr-Chapter/events/273139282/", "timezone": "Europe/Kiev", "description": "<p>OWASP Zhytomyr снова на связи с новыми лицами, с новыми темами. Не смотря на то, что карантин не позволяет встретиться нам вживую, мы продолжаем наши ивенты. Приглашаем вас на OWASP Zhytomyr Online Meetup vol.2! В этот раз нас ждет два отличных доклада.</p> <p>Панарина Сергей расскажет нам про основы основ: что такое SSL/TLS, как это работает, и что такое пиннинг сертификатов.</p> <p>Устименко Ирина познакомит нас с Windows Event Viewer и Windows логами. Мы рассмотрим самые важные события на которые стоит обращать внимание. Узнаем как настроить расширенное логирование и как увеличить видимость для событий, которые не логируются вообще.</p> <p>Регистрируйтесь на нашем Meetup и подключайтесь к нам 22го сентября в 19:00. Скоро увидимся!</p> <p><a href=\"https://zoom.us/j/97984578679?pwd=SnNsbkJtYUE2R0dQQTJRWE9Qbm5SZz09\" class=\"linkified\">https://zoom.us/j/97984578679?pwd=SnNsbkJtYUE2R0dQQTJRWE9Qbm5SZz09</a></p> "}]