[{"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "Finding the needle in a needle stack - NexGen Analytics in CyberSec Using ML+AI", "date": "2020-10-21", "time": "19:30", "link": "https://www.meetup.com/SGSecurityMG/events/273202440/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "Big Data – Advanced Security Analytics", "date": "2020-09-29", "time": "19:30", "link": "https://www.meetup.com/SGSecurityMG/events/273202418/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Jakarta", "repo": "www-chapter-jakarta", "name": "Operationalizing Threat Intelligence with Automation and Collaboration", "date": "2020-09-26", "time": "10:30", "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/272946597/", "timezone": "Asia/Jakarta", "description": "<p>Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…<br/>• Tool dan standar keamanan aplikasi<br/>• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan<br/>• Kendali keamanan dan pustaka standar<br/>• Cabang lokal di seluruh dunia<br/>• Riset terkini<br/>• Konferensi lengkap di seluruh dunia<br/>• Mailing list<br/>• Dan banyak lagi … di www.owasp.org</p> <p>Kali ini OWASP akan membahas :</p> <p>1. \"Operationalizing Threat Intelligence with Automation and Collaboration</p> <p>Abstrack:<br/>For defenders in the current situation, Threat Intel is all about IOCs which are more technical in nature and covers aspects that have a very short lifespan. By the time controls are put in place to thwart the technical IOCs, attackers change it and counter with new attacks. So, it becomes essential for defenders to continuously automate the Threat Intelligence actioning and harness the tactical information as well used by attackers and have countermeasures in place.</p> <p>By automating Threat Intel collection, analysis, and dissemination, we can deduce predictive intelligence providing greater visibility to the organizations while allowing them to anticipate and counter threats even before they attack. We will discuss how end-to-end threat intelligence automation in a closed trusted sharing environment could be used to operationalize actionable and relevant predictive intelligence by correlating, enriching, and analyzing threat data collected in real-time from a wide range of external and internal sources over a hub and spoke sharing model. We will also cover advanced automation strategies for the full threat intelligence lifecycle while detailing how mutual threat sightings could be used to identify and prioritize threats with precision confidence.</p> <p>High Level Agenda for Presentation</p> <p>Collective Defense Vs Passive Defense Vs Active Defense</p> <p>Threat Intelligence and Its types</p> <p>Threat Intelligence Operationalisation</p> <p>Threat Intelligence Automation / Orchestration</p> <p>Threat Intelligence Collaboration</p> <p>Collective Defense</p> <p>Takeaways</p> <p>---<br/>Short bio :<br/>Avkash K<br/>VP - Research and Innovation at Cyware Labs</p> <p>Information Security professional with overall 12+ years of experience in Information Security domain. Currently heading Research and Innovation in Cyber Fusion and Threat Intelligence domain within security product company Cyware Labs. Also Null Mumbai(Open security community) Chapter Leader.</p> <p>Experienced in SOC/CSIRT Management,Cyber Fusion, Cyber Resiliency, Threat Hunting, Threat Intelligence and research, Enterprise Security Architecture, Network Security management.</p> <p>Waktu dan Tempat :<br/>26th September 10:30 - 11:30 WIB</p> <p>Catatan :<br/>- Peserta online menggunakan aplikasi Zoom di komputer / laptop / tablet / smartphone<br/>- Acara ini free for everyone<br/>- Password untuk join meeting akan dikirim kan kepeserta setelah register</p> <p>Venue :<br/>Online by zoom</p> <p>Support our Conference<br/>OWASP AppSec Indonesia 2020</p> "}, {"chapter": "Sydney", "repo": "www-chapter-sydney", "name": "Sydney OWASP Night - How to become a security specialist", "date": "2020-10-21", "time": "18:00", "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/273424954/", "timezone": "Australia/Sydney", "description": "<p>The Sydney OWASP Chapter is BACK and revamped for 2020 with a fresh set of goals and leaders to bring you local cybersecurity events!</p> <p>We are focused on promoting equality within the workforce, education for new cybersecurity talents, and fostering a supportive community. To achieve these goals, we hold events throughout the year to bring regarded speakers, networking opportunities, and an annual CTF (with a cash prize!).</p> <p>Join us on Wednesday 21st October at 6PM for our first event featuring special guest speakers Ricki Burke and Lukasz Gogolkiewicz as they discuss some of the challenges of getting into the security job market and overcoming them to land your first role in the field.</p> <p>Ricki is heavily involved in the infosec community and is one of Australia’s leading cyber security recruiters. He is the founder of CyberSec People, where him and his team support organisations in hiring skilled infosec professionals.</p> <p>Lukasz is a highly proficient security professional who heads up Corporate Security at SEEK. He has worked with some of the world largest banks and financial organisations, has worked with federal, state and local governments, presented at and organised a number security conferences, and helps mentor the next generation of security professionals.</p> <p>Whether you're a student seeking some insight behind the scenes of working in cybersecurity or an experienced industry leader looking to meet new people, OWASP Chapter meetups are open to all and free to attend so we encourage everyone to come along!</p> <p>Read more about us on our website: <a href=\"https://owasp.org/www-chapter-sydney/\" class=\"linkified\">https://owasp.org/www-chapter-sydney/</a></p> "}, {"chapter": "Dallas", "repo": "www-chapter-dallas", "name": "OWASP Dallas October Meeting", "date": "2020-10-06", "time": "12:00", "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/273415740/", "timezone": "US/Central", "description": "<p>Title:</p> <p>Inside the Mind of a Threat Actor: Beyond Pentesting</p> <p>Description:</p> <p>Red team is a commonly misunderstood offensive security discipline. Red team has been used as a general term for all areas of offensive security just as blue team for defensive security. True red teaming goes Beyond Pentesting and into more adversarial emulation. While there are overlapping skills, there are differences that will be discussed as Phillip shares his experience of going from a pentester to a red teamer. In this talk, you will learn about the different areas that make up red team operations, common tools, and the path to becoming a red teamer. In this presentation, you will learn about resources helpful for a path into red teaming.</p> <p>Bio:</p> <p>Phillip Wylie is a Lead Curriculum Developer at Point3 Federal, Adjunct Instructor at Dallas College (formerly Richland College), and The Pwn School Project founder. Phillip has 23 years of experience with the last 8.5 years spent as a pentester. Phillip has a passion for mentoring and education. His passion motivated him to start teaching and founding The Pwn School Project. The Pwn School Project is a monthly educational meetup focusing on ethical hacking. Phillip teaches Ethical Hacking and Web Application Pentesting at Dallas College in Dallas, TX. Phillip holds the following certifications; CISSP, NSA-IAM, OSCP, GWAPT.</p> "}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP Meetup - CTF", "date": "2020-10-08", "time": "19:00", "link": "https://www.meetup.com/OWASP-STL/events/268671065/", "timezone": "US/Central", "description": ""}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP GlobalAppSec (Virtual) Oct 1st-31st", "date": "2020-10-01", "time": "00:00", "link": "https://www.meetup.com/OWASP-STL/events/268671120/", "timezone": "US/Central", "description": "<p><a href=\"https://virtual.globalappsec.org/\" class=\"linkified\">https://virtual.globalappsec.org/</a></p> "}, {"chapter": "Bangalore", "repo": "www-chapter-bangalore", "name": "OWASP Bangalore Monthly Meet 26 September 2020", "date": "2020-09-26", "time": "10:00", "link": "https://www.meetup.com/OWASP-Bangalore-Chapter/events/272887757/", "timezone": "Asia/Calcutta", "description": "<p>Hi Everyone</p> <p>#security stay safe</p> <p>OWASP meets are free for anyone to attend. There are absolutely no fees. Just come with an open mind and willingness to share and learn.</p> <p>Sessions:<br/>Date: Saturday 26 September 2020</p> <p>Sessions:<br/>Kindly fill out the speaker registration form<br/><a href=\"https://docs.google.com/forms/d/1xdNhcHjMvdcI-w-fvkq_9VD8j-QzEtJkiRh-dzCSsBQ/edit\" class=\"linkified\">https://docs.google.com/forms/d/1xdNhcHjMvdcI-w-fvkq_9VD8j-QzEtJkiRh-dzCSsBQ/edit</a></p> "}, {"chapter": "Suffolk", "repo": "www-chapter-suffolk", "name": "[ONLINE]OWASP Suffolk Chapter Meeting", "date": "2020-10-07", "time": "19:00", "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/273437250/", "timezone": "Europe/London", "description": "<p>AGENDA:<br/>* Warmly greetings by hosts</p> <p>* The Cloud Migration Playbook - Part 1: A Simple Primer To Complexity\" - Jason Sewell<br/>In this talk, we will go over an introductory overview on the common areas of AWS an organization should start to focus on as they prepare to migrate to the cloud, including both offensive techniques and defensive mitigation.</p> <p>* Short break / networking</p> <p>* What you need to know, but you are afraid to ask - Pentester panel</p> <p>Panelists:</p> <p>* Jason Sewell<br/>Jason has over 15 years of experience as a web application and systems developer, in addition to over ten years in DevOps and systems architecture related roles. Jason began his journey into information security through necessity as he built skills and knowledge through his roles in leading internal initiatives for securing application and cloud infrastructure. After years of blue team and developer/devops roles, his interests centre around offensive security and wanting to help organizations actively find problems rather than just follow best practices and hope for the best.</p> <p>* Cayce Mahon<br/>Has over nine years of experience in Information Security. Originally graduating with an AFA in fine art , she took a unique path of education in regards to her transition into information security. Through persistence and self-study, she was able to obtain a Security+ and OSCP certification on her own. While at OccamSec, she has led and has been a part of a variety of offensive engagements in the realms of cyber and physical security (security/penetration testing of applications, network/physical infrastructure and systems) as well as risk assessment (architecture/policy review, vulnerability assessment, and employee interviews). Finding crucial fault points in an organization’s infrastructure while also adapting to the ever changing demands of the clients she works with.</p> <p>* Ivano Bianco<br/>Italian, with a fake Russian accent. Started using computers at the tender age of 11, by the age of 14 he switched from the BASIC language to Assembly and started to circumvent copy protections for fun. Spent the next 20 years working in IT Operations, keeping systems secure and automating deployments before job titles like \"IT Security Engineer\" and \"DevOps Engineer\" were a thing.</p> <p>Had the opportunity to cover technical hands-on roles for a multitude of SME and multinational companies such as: - Société Générale - H3G - Ericsson - Global Payments – Puppet.</p> <p>Nowadays he prefers to focus on penetration testing, web application testing (because breaking things is always fun), threat hunting and security awareness training. He still likes to figure out why a server is down, but will not fix your computer.</p> <p>* Nicholas Donarski<br/>Has been a pioneer in the Information Security field for over 20 years. During this time, he’s worked with a diverse client list which includes multinational and global organizations, Federal, State and Local government, and enterprises of all sizes. He is recognized in the international community as a senior authority on PenTesting strategy, operations, tools and training. Over the years, he’s continued to expand his experience in security to include network security, mobile, web, and application security, compliance, high threat physical security and RedTeam Operations. Recently, he’s focused on the development of security architecture and development around machine learning and Artificial Narrow Intelligence (ANI).</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and get a ticket to be admitted to the event by building security - your name will be checked against the guest list.<br/>Register to attend this event at OWASP Suffolk Chapter - Meetup - RSVP to attend</p> "}, {"chapter": "Switzerland", "repo": "www-chapter-switzerland", "name": "OWASP API Security Top 10", "date": "2020-10-07", "time": "18:00", "link": "https://www.meetup.com/OWASPSwitzerland/events/273088624/", "timezone": "Europe/Zurich", "description": "<p>In December 2019, OWASP published its first top 10 risk list for API security. With this step, OWASP confirms the increasing importance of API security for companies. The talk looks at the new risks and contrasts them with the top 10 risks for web applications. While security products can help to mitigate certain risks as an additional defense line, API developers have the ultimate responsibility for their code and must know the risks to avoid them.</p> <p>This will be an online live event (link will be added before the event).</p> <p>Speaker bio of Dr. Martin Burkhart:<br/>Martin Burkhart is head of product management for Airlock at Ergon Informatik AG. Prior to that, he has been working as a software engineer and as a security researcher, concerned with data anonymization and applied cryptography. He owns an MSc and a PhD in computer science from ETH Zurich.</p> "}, {"chapter": "Victoria", "repo": "www-chapter-victoria", "name": "OWASP BC Day 2020", "date": "2020-10-03", "time": "10:00", "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/273000877/", "timezone": "Canada/Pacific", "description": "<p>DO NOT REGISTER HERE!!!<br/>Registration at: <a href=\"https://www.eventbrite.ca/e/owasp-bc-day-2020-tickets-119389965601\" class=\"linkified\">https://www.eventbrite.ca/e/owasp-bc-day-2020-tickets-119389965601</a></p> <p>OWASP Vancouver and Victoria chapters are pleased to present BC Day: an application security event focused on security awareness, training and new developments in the application security industry. This event will focus on highlighting security expertise in the local community and is the first of many collaborations between our community OWASP chapters.</p> <p>The event will take place on October 3rd from 10 am to 5 pm.</p> <p>This will be a mixed forum of presentations, adjacent workshops, hands on training and interactive sessions that will be held on several topics of interest.</p> <p>Please refer to our official page for full details on the event:<br/><a href=\"https://www.owaspbcday.org/\" class=\"linkified\">https://www.owaspbcday.org/</a></p> <p>Get your tickets at:<br/><a href=\"https://www.eventbrite.ca/e/owasp-bc-day-2020-tickets-119389965601\" class=\"linkified\">https://www.eventbrite.ca/e/owasp-bc-day-2020-tickets-119389965601</a></p> "}]