[{"chapter": "Tunisia", "repo": "www-chapter-tunisia", "name": "OWASP SAMM2 - Your Dynamic Software Security Journey", "date": "2021-01-29", "time": "12:00", "link": "https://www.meetup.com/OWASP-Tunis-Meetup-Group/events/275749110/", "timezone": "Africa/Tunis", "description": "<p>Take your ticket here: <a href=\"https://www.eventbrite.co.uk/e/owasp-samm2-your-dynamic-software-security-journey-tickets-136600244007\" class=\"linkified\">https://www.eventbrite.co.uk/e/owasp-samm2-your-dynamic-software-security-journey-tickets-136600244007</a></p> <p>Thanks to Our Guest: Sebastien Deleersnyder</p> <p>Sebastien Deleersnyder (<a href=\"https://twitter.com/sebadele\" class=\"linkified\">https://twitter.com/sebadele</a>) is co-founder, CEO of Toreon and a proponent of application security as a holistic endeavor. He started the Belgian OWASP chapter, was a member of the OWASP Foundation Board and performed several public presentations on Application Security. Seba also co-founded the yearly security &amp; hacker BruCON conference and trainings in Belgium. With a background in development and many years of experience in security, he has trained countless developers to create software more securely. He has led OWASP projects such as OWASP SAMM, thereby truly making the world a little bit safer. Now he is adapting application security models to the evolving field of DevOps and is also focused on bringing Threat Modeling to a wider audience.</p> <p>Desription</p> <p>OWASP Software Assurance Maturity Model (SAMM) enables you to formulate and implement a strategy for software security that is tailored to the risk profile of your organisation. In this talk, we give an overview of the new release of the SAMM model. After 10 years since its first conception, it was important to align it with today’s development practices. We will cover a number of topics in the talk:<br/>the core structure of the model, which was redesigned and extended to align with modern development practices, the measurement model which was setup to cover both coverage and quality and the new security practice streams where the SAMM activities are grouped in maturity levels. We will demonstrate the new SAMM2 toolbox to measure the maturity of an example development team and how you can create a roadmap of activities.</p> "}, {"chapter": "Ottawa", "repo": "www-chapter-ottawa", "name": "OWASP Ottawa: January 2021 Meetup", "date": "2021-01-20", "time": "19:00", "link": "https://www.meetup.com/OWASP-Ottawa/events/275540224/", "timezone": "Canada/Eastern", "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p><a href=\"https://www.youtube.com/watch?v=6tiOc1OO2PI\" class=\"embedded\">https://www.youtube.com/watch?v=6tiOc1OO2PI</a></p> <p>7:00 EDT PM: Technical Talks</p> <p>1. Announcements</p> <p>2. The Elephant Room: Presentations on Those things we all deal with but nobody talks about.</p> <p>Abstract:<br/>This meetup we are fortunate to have Dr. Gordon Josephson, a local clinical psychologist, who will respond to the questions we received in our brief online survey on Workplace Stress and Mental Health in the IT and Security Fields.</p> <p>Bio:</p> <p>Dr. Gordon Josephson is registered as a psychologist with the College of Psychologists of Ontario and has been working in private practice since 2004. Dr. Josephson obtained a doctoral degree in Clinical Psychology from the University of Ottawa in 2004. Prior to this, he worked both internationally and in the Federal Government and as such he brings to his interactions with clients his experience and knowledge from working cross-culturally and in the culture of the Federal Government.</p> <p>Dr. Josephson provides psychotherapy and assessment services to adults experiencing a variety of challenges such as: anxiety, depression, stress, anger, relationship difficulties, career concerns and adjustment to major life changes (including injury and illness).</p> <p>Dr. Josephson has a longstanding interest in Health Psychology and in the role of Psychology in not only treating but preventing physical and mental health problems; particularly through assisting people to better understand and increase their motivation for emotional and physical self-care/fitness.</p> <p>3. Measurement &amp; Reporting for Appsec &amp; Vulnerability Management</p> <p>Abstract:<br/>Intelligent metrics can help you get other people to do things they might not otherwise do, get your team to do things better (and understand what better means), show success towards objectives, and predict or plan for the future. Join Opheliar Chan as she shares her experiences building metrics to support application security and vulnerability management programs.</p> <p>Bio:<br/>Opheliar Chan spends most of her time trying to make software security more accessible, pragmatic, and FUD-free, both as Director of Advisory at Security Compass, while moonlighting as co-lead of the OWASP Toronto Chapter, or as a volunteer or advisor for other infosec groups. For over a decade, she has focused on application security, SDLC process consulting and implementations, program building, penetration testing/vulnerability assessments, and related. Prior to her career in consulting, she worked in security research, web application development, and technical writing.</p> "}, {"chapter": "Jakarta", "repo": "www-chapter-jakarta", "name": "Strategic Usage of OWASP SAMM and OWASP DSOMM", "date": "2021-01-23", "time": "15:00", "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/275425229/", "timezone": "Asia/Jakarta", "description": "<p>Strategic Usage of OWASP SAMM and OWASP DSOMM</p> <p>Description :<br/>From a startup to a multinational corporation the software development industry is currently dominated by agile frameworks and product teams and as part of it DevOps strategies.</p> <p>It has been observed that during implementation, security aspects can be missed. The OWASP Software Assurance Maturity Model and the OWASP DevSecOps Maturity Model, which are presented in the talk, show security measures which are applied when using DevOps strategies and how these can be prioritized. With the help of DevOps strategies security can also be enhanced. Under the guidance of the forward-looking DevSecOps Maturity Model, appropriate principles and measures can defend against attacks.</p> <p>In this session Timo will give an introduction and answers questions like when to use OWASP SAMM and when and how to use DSOMM.</p> <p>Bio:<br/>Timo has been in the IT industry for over twenty years. After being a system administrator and web developer in his early times, he became involved in OWASP. He now advises his clients on DevOps security, either hands on or as a trainer, with the focus on security test automation for software and infrastructure.<br/>more details :<br/><a href=\"https://pagel.pro/\" class=\"linkified\">https://pagel.pro/</a></p> "}, {"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "Panel Debate, Post Pandemic Cybersecurity", "date": "2021-01-21", "time": "20:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/275404398/", "timezone": "Europe/Copenhagen", "description": "<p>On January 21st you will have the opportunity to listen to and ask questions for not one, but three panelists about security in a post-pandemic world.</p> <p>As we move into this mid- and post-pandemic world with remote and in-office work blending, what must organizations consider, in order to sustain data and application security and privacy while still considering an efficient working- and user experience? How does remote work change the security stack mix? And what’s still missing?</p> <p>We will also be diving into how innovation in cyber became a must and how that can and will support companies and users on a daily basis.</p> <p>YOUR PANELISTS ARE</p> <p>Lone Juul Dransfeldt Christensen, Senior Security Architect at Bang &amp; Olufsen. Formely in NNIT and the Danish Police.<br/><a href=\"https://www.linkedin.com/in/ldransfeldt/\" class=\"linkified\">https://www.linkedin.com/in/ldransfeldt/</a></p> <p>Martin Clausen, Chief Security Architect, Head of Architecture, Research and Development at Saxo Bank. Former Head of Cyber Innovation Labs at Danske Bank.<br/><a href=\"https://www.linkedin.com/in/martin-clausen/\" class=\"linkified\">https://www.linkedin.com/in/martin-clausen/</a></p> <p>Luke Herbert-Andersen, PhD in Computer Science.<br/><a href=\"https://www.linkedin.com/in/lukeherbert/\" class=\"linkified\">https://www.linkedin.com/in/lukeherbert/</a></p> <p>YOU CAN ASK QUESTIONS<br/>Is there a question you want to ask the panelists? Write a comment below with your question, or go to twitter, mention OWASPCPH together with you question, and we will collect them and prepare for the panelists!<br/><a href=\"https://twitter.com/owaspcph\" class=\"linkified\">https://twitter.com/owaspcph</a></p> <p>THIS IS AN ONLINE EVENT<br/>Before January 21st, you will receive an e-mail with a link for the event.</p> <p>Photo by Isaac Quesada on Unsplash</p> "}, {"chapter": "South Florida", "repo": "www-chapter-south-florida", "name": "OWASP South Florida Chapter Meeting January 2021", "date": "2021-01-27", "time": "18:00", "link": "https://www.meetup.com/South-Florida-OWASP-Chapter/events/275753045/", "timezone": "US/Eastern", "description": "<p>IMPORTANT NOTE: Due to ongoing COVID-19 public health concerns, we will be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.</p> <p>Happy New Year! Please join us virtually for our January 2021 Meeting.</p> <p>BYOB - Bring Your Own Beverage</p> <p>Agenda<br/>============================<br/>+Chapter updates/announcements, etc.<br/>+Talk: Infrastructure-as-Code (IaC)–An Introduction to Terraform by Pradip Gupta &amp; Rose Gupta.<br/>+Virtual Networking.<br/>============================</p> <p>***Chapter Updates/Announcements***<br/>Chapter leaders' updates/announcements, etc.</p> <p>***Talk***<br/>Speakers: Pradip Gupta and Rose Gupta</p> <p>Title: Infrastructure-as-Code(IaC) – An Introduction to Terraform</p> <p>Abstract: Why Infrastructure as Code? What is Terraform and how does it work? These and related topics will be covered, including Terraform basics, associated commands, resource, file structure and data source. We will use a demo to improve understanding, and conclude with both knowledge check and address questions, comments or feedback from the audience.</p> <p>Speaker's Bio: Pradip Gupta is currently a leader at Attain LLC. Before joining Attain, he has also utilized his expertise working with various organizations, World Fuel Services, Fujitsu, and Oracle. He is certified in both OCI Could Architecture and Terraform Architecture. You can connect with him at www.linkedin.com/in/pradipgupta/.</p> <p>Speaker's Bio: Rose Gupta is currently a Malwarebytes SRE Intern while simultaneously pursuing her MS in Computer Science with specialization in Network Security from Florida International University. Rose is also an OCI Foundations Certified Associate who works closely with DevSecOps team on daily basis in the AWS platform. You can connect with her at www.linkedin.com/in/rose-gupta/.</p> <p>***Virtual Networking Session***<br/>Open to attendees to discuss any topical issue: jobs, remote work, etc.</p> "}, {"chapter": "Oklahoma City", "repo": "www-chapter-oklahoma-city", "name": "Web Application Vulnerability Testing", "date": "2021-01-29", "time": "15:00", "link": "https://www.meetup.com/Oklahoma-City-Chapter-Meetup/events/275799003/", "timezone": "US/Central", "description": "<p>I’m this meeting we are going to cover how to identify and test for 3 web application vulnerabilities.</p> <p>The presenters will be:</p> <p>1. Joe Sullivan<br/>2. Skyler Tuter<br/>3. TBD</p> <p>This is a virtual meeting.</p> "}, {"chapter": "Sydney", "repo": "www-chapter-sydney", "name": "OWASP Sydney Fight Club - February Meet", "date": "2021-02-17", "time": "18:00", "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/275618877/", "timezone": "Australia/Sydney", "description": "<p>Introducing OWASP Sydney Chapter's first ever Fight Club CTF! Inspired by Hack the Box's King of the Hill, every second month, we are bringing you a night of hacking, to unleash your skills on a series of vulnerable machines, then defend against your opponents! This will be a team-based event where you are free to choose your own teams (minimum of 2 members and maximum of 4). If you are unable to find a team, let us know and we will help form a team for you.</p> <p>The first rule of Fight Club is: no attacking other participants' personal computers. The second rule of Fight Club is: no attacking other participants' personal computers. Other than that, all attack vectors within the given IP range are allowed. This includes Denial of Service, Man-in-the-Middle, and any other attack methods you can think of that are usually banned from CTFs!</p> <p>Challenges will be of varying difficulties but the idea is the same -- break into a machine, plant your team's flag, then defend your machine(s) from other teams who will be trying to plant their own flag. The team whose flag is present once the time limit is up claims the points for that machine.</p> <p>At the end of the year, the top team from each Fight Club night will go head to head in our grand finale at BSides Sydney!</p> <p>To register please go to: <a href=\"https://forms.gle/Ukb1gTZZLR7SALHA6\" class=\"linkified\">https://forms.gle/Ukb1gTZZLR7SALHA6</a></p> <p>Don't miss out on this opportunity to be crowned fight club champion!</p> <p>DISCLAIMER:<br/>OWASP Sydney does not guarantee that the ENVIRONMENT or any other associated website or servers, through which the content is made available to the Users, are provided without any “virus” or harmful component. The User’s entry to the “closed network” - (“Fight Club Network”) shall be performed under their own responsibility.</p> <p>Anything provided to the Users through our ENVIRONMENT shall not be regarded in any way, directly or indirectly, as stimulation, advice or instigation to commitment of any unlawful action. All publications or services provided have a clear educational purpose, such as upgrading User’s skills in penetration/security testing. Every User acts based upon their private will and ethics being the sole responsible for their actions.</p> <p>OWASP Sydney bears no responsibility for any misuse and/or inappropriate use of the services of the ENVIRONMENT by a User. For any damages caused, to the ENVIRONMENT, to the Network, to another User or to any third party, the sole responsible is the User that carried out the above-mentioned actions.</p> <p>OWASP Sydney under no circumstances, including the case of negligence, shall be held responsible for any kind of damage, which the User of the ENVIRONMENT may suffer given that they access on their own initiative.</p> "}, {"chapter": "Boulder", "repo": "www-chapter-boulder", "name": "Join us (virtually) for Boulder/Denver OWASP's January Meeting!!!", "date": "2021-01-20", "time": "17:30", "link": "https://www.meetup.com/OWASP-Boulder/events/275731230/", "timezone": "US/Mountain", "description": "<p>Join us on zoom (link to be posted shortly)<br/>================================================================<br/>Archetypal Secure Application Design Pattern: The Next Evolution<br/>================================================================</p> <p>This is the next evolution of the App Sec Effort to move security left<br/>through repeatable secure software design patterns. Security<br/>responsibilities and controls are distributed across various levels of<br/>(IDE-consumable!) UML diagrams; they become Patterns as Code, Architecture<br/>as Code, Config as Code. Now the diagrams are actually useful to the<br/>builders and designers, so no effort is wasted, producing true agility<br/>through treating software archetypes as repeatable, solvable problems with<br/>appropriate security baked in, just in time, rather than bolted on as an<br/>afterthought. Bigger, better, and with real examples. Help us improve<br/>patterns to improve software security.</p> <p>================================================================<br/>Speaker: Joe Gerber<br/>================================================================</p> <p>Joe Gerber is a Secure Software Architect and Secure Software Design<br/>practice lead with 10+ years of secure software design experience. He is<br/>also a recovering senior web developer and former embedded systems<br/>programmer. He deeply desires to use patterns to truly make secure software development a repeatable phenomenon.</p> <p>He has previously presented at:<br/>- RMISC 2018<br/>- SnowFroc 2018<br/>- Three OWASP Chapter meetings<br/>- Local community IT professional groups<br/>- Lead App Sec presenter at quarterly classes held by my employer</p> <p>He was a volunteer at Defcon’s inaugural App Sec Village</p> "}, {"chapter": "Charlotte", "repo": "www-chapter-charlotte", "name": "2021 Kickoff Meeting (Security in a post COVID World)", "date": "2021-01-21", "time": "19:00", "link": "https://www.meetup.com/owaspCLT/events/274975479/", "timezone": "US/Eastern", "description": "<p>Come join us for our First meeting of the year and a frank discussion of Covid and its affect on security this year.</p> "}, {"chapter": "Cleveland", "repo": "www-chapter-cleveland", "name": "OWASP 2021 with Cleveland Chapter", "date": "2021-01-29", "time": "18:30", "link": "https://www.meetup.com/owasp-cleveland-group/events/275751911/", "timezone": "US/Eastern", "description": "<p>The OWASP Cleveland Chapter will host its first meeting which will kickoff on Friday, January 29, 2021 at 6:30 pm EST. The first meeting will provide an introduction to what you can expect from our chapter in 2021 and it will also serve as our first membership drive. The chapter leaders are Eric Potter, Ian Mulhern, and Princeton Brooke. Each leader has adopted an OWASP project that will be reviewed in the first meeting and then expanded-on throughout the course of 2021. We look forward to serving the OWASP community, the city of Cleveland and Northeast Ohio, and security practitioners all over the world.</p> <p>We look forward to hearing from members and having open dialog on how our chapter can assist in servicing the needs of the greater OWASP organization.</p> <p>We will update this posting with the destination URL.</p> "}, {"chapter": "Dallas", "repo": "www-chapter-dallas", "name": "OWASP Dallas January Meeting", "date": "2021-01-26", "time": "12:00", "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/275627078/", "timezone": "US/Central", "description": "<p>Title:</p> <p>IoT Security’s Lucky 13</p> <p>Description:</p> <p>AWS offers an IoT stack that has the goal of simplifying gaining value from smart device - edge device - cloud orchestration. The stack is deceptively simple to use, but, as always, the devil is in the detail when it comes to security.</p> <p>This talk will:<br/>* Introduce the AWS IoT stack<br/>* Provide a quick overview of the ETSI EN 303 645 security guidelines<br/>* Show how AWS security features can help support the recommendations in the ETSI standard by working through a practical use case: EZTEA</p> <p>Bio:</p> <p>Jennifer Janesko is a Senior Consultant at Synopys, Inc. and has worked in security for the past six years focusing on cloud, IoT and application security. Prior to her transition to information security, Jennifer worked for over 15 years in IT as a developer and leader in the areas of education, telecommunications, and semiconductors. She volunteers as an organizer for the yearly BSidesMunich security conference and the security group MUC:SEC e.V.. In her free time, Jennifer enjoys running, hiking, competing in (and making) CTFs and tinkering with technologies.</p> "}, {"chapter": "Denver", "repo": "www-chapter-denver", "name": "Join us (virtually) for Denver/Boulder OWASP's January Meeting!!!", "date": "2021-01-20", "time": "17:30", "link": "https://www.meetup.com/Denver-OWASP/events/275731213/", "timezone": "US/Mountain", "description": "<p>Join us on zoom (link to be posted shortly)<br/>================================================================<br/>Archetypal Secure Application Design Pattern: The Next Evolution<br/>================================================================</p> <p>This is the next evolution of the App Sec Effort to move security left<br/>through repeatable secure software design patterns. Security<br/>responsibilities and controls are distributed across various levels of<br/>(IDE-consumable!) UML diagrams; they become Patterns as Code, Architecture<br/>as Code, Config as Code. Now the diagrams are actually useful to the<br/>builders and designers, so no effort is wasted, producing true agility<br/>through treating software archetypes as repeatable, solvable problems with<br/>appropriate security baked in, just in time, rather than bolted on as an<br/>afterthought. Bigger, better, and with real examples. Help us improve<br/>patterns to improve software security.</p> <p>================================================================<br/>Speaker: Joe Gerber<br/>================================================================</p> <p>Joe Gerber is a Secure Software Architect and Secure Software Design<br/>practice lead with 10+ years of secure software design experience. He is<br/>also a recovering senior web developer and former embedded systems<br/>programmer. He deeply desires to use patterns to truly make secure software development a repeatable phenomenon.</p> <p>He has previously presented at:<br/>- RMISC 2018<br/>- SnowFroc 2018<br/>- Three OWASP Chapter meetings<br/>- Local community IT professional groups<br/>- Lead App Sec presenter at quarterly classes held by my employer</p> <p>He was a volunteer at Defcon’s inaugural App Sec Village</p> "}, {"chapter": "Minneapolis St Paul", "repo": "www-chapter-minneapolis-st-paul", "name": "February meeting: The state of IoT security", "date": "2021-02-11", "time": "19:00", "link": "https://www.meetup.com/OWASP-MSP-Meetup/events/275615353/", "timezone": "US/Central", "description": "<p>TBD</p> "}, {"chapter": "Orange County", "repo": "www-chapter-orange-county", "name": "Virtual Meeting: BOLA, IDOR, MA, BFLA. Welcome to the OWASP API Top 10!", "date": "2021-01-28", "time": "17:45", "link": "https://www.meetup.com/OWASP-OC/events/275655151/", "timezone": "US/Pacific", "description": "<p>Speaker: Adam Fisher, Principal Security Engineer, Salt Security</p> <p>Topic: BOLA, IDOR, MA, BFLA. Welcome to the OWASP API Top 10!</p> <p>Abstract:<br/>In this presentation, Adam will introduce the audience to the OWASP API TOP 10 Security Threats. Adam will highlight the unique attack vectors that API Applications face, review specific breach examples, and why OWASP felt it necessary to specifically highlight these vulnerabilities in a new Top 10 list. We will also explore various efforts by the security industry to secure API Applications and what businesses should expect as they evaluate an API security solution.</p> <p>Speaker Bio:<br/>Adam Fisher is an Enterprise Security Expert whose qualifications include a Bachelor of Science in Information Systems, Master of Business in Information Technology Management, and maintains a number of certifications, CISSP, CCSP, AWS Security Associate, Azure MCP. Adam has a detailed knowledge of Enterprise Security best practices and technologies and has been focused on the creation and deployment of solutions protecting networks, systems, and information assets for Fortune 500 companies and Government Agencies. Adam has worked on Secret level clearance projects for the United States Government and the United Kingdom. Deploying security solutions and network technologies while protecting key government data and assets. In addition, Adam is a respected blogger and thought leader on Enterprise Security.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/adamfisher/\" class=\"linkified\">https://www.linkedin.com/in/adamfisher/</a></p> <p>Schedule:<br/>5:45pm: Introduction, Presentation &amp; Q&amp;A</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2021-01-28", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqycccblc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Sacramento", "repo": "www-chapter-sacramento", "name": "OWASP Sacramento Hangout (Google Meet)", "date": "2021-01-21", "time": "17:00", "link": "https://www.meetup.com/OWASP-Sacramento-Chapter/events/275554873/", "timezone": "US/Pacific", "description": "<p>Please note that this meetup is remote only!! Meetup won’t let us remove the location!!</p> <p>Happy New Years, Chapter!</p> <p>Hope everyone is healthy and safe!</p> <p>This month, continuing our abundance of caution, we are going to hold our meetup remotely on Google Hangouts. Please try to join from a computer.</p> <p>Agenda:<br/>- Community Topics<br/>- OWASP Membership and upcoming events<br/>- Main Topic: Threatspec - how to Threat Model code better.<br/>- Q&amp;A</p> <p>For more information about OWASP, please visit our Wiki at <a href=\"https://owasp.org/www-chapter-sacramento/\" class=\"linkified\">https://owasp.org/www-chapter-sacramento/</a></p> "}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "January 2021 Chapter Meeting", "date": "2021-01-27", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/275711613/", "timezone": "US/Mountain", "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA</a>) to suggest any additional topics.</p> <p>Agenda:<br/>12 - 12:50pm<br/>- OWASP SAMM (Software Assurance Maturity Model) with Brian Glas.</p> <p>12:50 - 1pm<br/>Open Forum, Admin Items, Choose next Guest Speaker</p> <p>Abstract: OWASP SAMM (<a href=\"https://owaspsamm.org\" class=\"linkified\">https://owaspsamm.org</a>) is the prime maturity model for software assurance that provides an effective and measurable way for all types of organizations to analyze and improve their software security posture. Building security into the software development and management practices of a company can be a daunting task. There are many elements to the equation: company structure, different stakeholders, technology stacks, tools and processes, and so forth. Implementing software assurance will have a significant impact on the organization. Yet, trying to achieve this without a good framework is most likely leading to just marginal and unsustainable improvements. OWASP Software Assurance Maturity Model (SAMM) gives you a structural and measurable framework to do just that. It enables you to formulate and implement a strategy for software security that is tailored to the risk profile of your organization. In this talk, we give an overview of the new release of the SAMM model. After 10 years since its first conception, it was important to align it with today’s development practices.<br/>We will cover a number of topics in the talk: (i) the core structure of the model, which was redesigned and extended to align with modern development practices, (ii) the measurement model which was set up to cover both coverage and quality and (iii) the new security practice streams where the SAMM activities are grouped in maturity levels. We will demonstrate the new SAMM2 toolbox to measure the maturity of an example DevOps team and how you can create a roadmap of activities.<br/>Bio: Brian Glas has worked in IT for almost 20 years and information/application security for the last decade. He started as an enterprise Java developer, then transitioned to helping build an application security program as both tech lead and manager. He later played the role of enterprise architect and did a little incident response and reverse engineering malware for fun. Glas then spent a number of years as a consultant helping clients build AppSec programs, create/update SDLCs, and other related initiatives. He has worked on the Trustworthy Computing team at Microsoft and is now an assistant professor of Computer Science at Union University authoring a Cybersecurity program. He also has been a co-lead for SAMM v2 and the OWASP Top 10.</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC/Wasatch AppSec January 2021 Chapter Meeting<br/>Time: Jan 27, 2021 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/99613814556?pwd=eHZjOHhPakZBanlHUXZXbkVocERyUT09\" class=\"linkified\">https://zoom.us/j/99613814556?pwd=eHZjOHhPakZBanlHUXZXbkVocERyUT09</a></p> <p>Meeting ID: 996 1381 4556<br/>Passcode: 276752<br/>One tap mobile<br/>+12532158782,,99613814556# US (Tacoma)<br/>+13462487799,,99613814556# US (Houston)</p> <p>Dial by your location<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 301 715 8592 US (Washington D.C)<br/>+1 312 626 6799 US (Chicago)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 996 1381 4556<br/>Find your local number: <a href=\"https://zoom.us/u/adRd8fuD01\" class=\"linkified\">https://zoom.us/u/adRd8fuD01</a></p> "}, {"chapter": "Dhaka", "repo": "www-chapter-dhaka", "name": "OWASP API Security Top 10", "date": "2021-01-22", "time": "19:00", "link": "https://www.meetup.com/OWASP-Dhaka-Chapter/events/275364270/", "timezone": "Asia/Dhaka", "description": "<p>In December 2019, OWASP published its first top 10 risk list for API security. With this step, OWASP confirms the increasing importance of API security for companies. The talk looks at the new risks and contrasts them with the top 10 risks for web applications. While security products can help to mitigate certain risks as an additional defense line, API developers have the ultimate responsibility for their code and must know the risks to avoid them.</p> <p>This will be an online live event (link will be added before the event).</p> <p>Speaker Biodata of Mr. Md Jahangir Alam:<br/>Md Jahangir Alam is the leader of the OWASP Dhaka Chapter. He is the Head of IT Security at Shimanto Bank Limited and Director of Marketing, ISACA Dhaka Chapter. He is a Certified Information System Auditor (CISA), ISO 27001 Lead Auditor, Certified Ethical Hacker (CEH), Certified Blockchain Professional (CBP), and Lean Six Sigma Black Belt (LSSBB). He is a CSE Graduate from a reputed private university in Bangladesh.</p> "}, {"chapter": "Switzerland", "repo": "www-chapter-switzerland", "name": "ZAP Automation in CI/CD", "date": "2021-02-09", "time": "18:00", "link": "https://www.meetup.com/OWASPSwitzerland/events/275004625/", "timezone": "Europe/Zurich", "description": "<p>OWASP ZAP is probably the most frequently used web application scanner in the world, and automation is one of its strengths.<br/>In this talk Simon will explain the different options you have for running ZAP in a CI/CD pipeline ranging from the packaged scans to directly driving the ZAP API.<br/>He will also explain (and maybe even demo) a new ZAP automation framework which is currently under development.</p> <p>ZAP is an OWASP flagship project and you can find more information on <a href=\"https://www.zaproxy.org/\" class=\"linkified\">https://www.zaproxy.org/</a> .</p> <p>About your speaker:<br/>Simon Bennetts is the OWASP Zed Attack Proxy (ZAP) Project Leader and a Distinguished Engineer at StackHawk, a company that uses ZAP to help users fix application security bugs before they hit production.<br/>He has talked about and demonstrated ZAP at conferences all over the world, including Blackhat, JavaOne, FOSDEM and OWASP AppSec EU, USA &amp; AsiaPac.<br/>Prior to making the move into security he was a developer for 25 years and strongly believes that you cannot build secure web applications without knowing how to attack them.</p> <p>(Note: The link to the event will be added before the event starts.)</p> "}, {"chapter": "Harrisburg", "repo": "www-chapter-harrisburg", "name": "OWASP Virtual Meetup", "date": "2021-01-21", "time": "19:00", "link": "https://www.meetup.com/OWASP-Harrisburg-Chapter/events/275752777/", "timezone": "US/Eastern", "description": "<p>Another virtual OWASP Harrisburg Meetup for the start of the year. We will talk about the year ahead and have a walk-through of the SANs Holiday Hack Challenge.</p> "}, {"chapter": "Victoria", "repo": "www-chapter-victoria", "name": "January 2021 Virtual AppSec Meetup", "date": "2021-01-20", "time": "18:00", "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/275339332/", "timezone": "Canada/Pacific", "description": "<p>The OWASP Victoria chapter is pleased to present our first<br/>event since OWASP BC Day. Michael Cavallin will be delivering a talk on Zero Trust Design for Web Applications.</p> <p>The event will be held online on January 20th from 6:00pm – 7:30pm.</p> <p>It will feature Michael’s talk followed by a Q&amp;A and a draw for a prize (must be registered member). Join us for an evening of application security in the new year!</p> <p>Visit our OWASP Chapter to learn more about us at <a href=\"https://owasp.org/www-chapter-victoria/\" class=\"linkified\">https://owasp.org/www-chapter-victoria/</a></p> <p>Speaker: Michael Cavallin<br/>Presentation: Zero Trust Design for Web Applications (1.5 hr)</p> <p>Abstract: Why do the internet's largest companies use Zero Trust designs? Zero Trust makes attackers' lives hard! You'll leave this talk with three main takeaways: 1) Why Zero Trust design is so important for web application design. 2) A phased approach you can take with your old and new projects. 3) Learn about a simple, secure, scalable Zero Trust reference design you can implement using Okta and Cloudflare (and see a demo!).</p> <p>Biography: Michael is a senior member of BCI's Cyber Security Engineering team and a champion of Zero Trust designs. Michael's own cybersecurity research has discovered and reported security vulnerabilities involving the US Department of Homeland Security's ICS CERT, ICS/SCADA vendors, Defence Research and Development Canada and hardware/software vendors.</p> "}]