[
    {
        "group": "Ghana",
        "repo": "www-chapter-ghana",
        "name": "Trending website threats and what the future might hold for Client-side security",
        "date": "2021-03-29",
        "time": "16:00",
        "link": "https://www.meetup.com/OWASP-Ghana-Chapter/events/276984439/",
        "timezone": "Africa/Accra",
        "description": "<p>The event is organised by LDN Security Community Meetup.</p> <p>The massive increase in e-commerce and digital customer engagement has been followed by the inevitable rise in cyberattacks on websites - but how have they evolved?</p> <p>Join our virtual MeetUp event to learn more about client-side security, and what you can do to defend against them.</p> <p>Randy Paszek, Sales Engineer at Source Defense will discuss:<br/>• Stories from the edge - recent attack examples and what companies are doing to remediate<br/>• Up and coming attack vectors that organisations need to be prepared for<br/>• Preparation techniques, technologies and best practices to protect your website from malicious threats<br/>• What the future looks like for online website security</p> <p>The event will also feature a live attack, giving you a perspective on the tools and approach that bad actors are using in the wild right now, and providing practical tips you can use in your own apps and environments.</p> <p>We'll also provide complimentary threat intel to everyone attends.</p> <p>Please register through MeetUp, and then click the link below on Zoom to receive the login details.</p> <p>Original event page:<br/><a href=\"https://www.meetup.com/LDN-Security-Community-Meetup/events/276867596/\" class=\"linkified\">https://www.meetup.com/LDN-Security-Community-Meetup/events/276867596/</a></p> "
    },
    {
        "group": "Sao Paulo",
        "repo": "www-chapter-sao-paulo",
        "name": "OWASP Sao Paulo Segundo Meetup Virtual de 2021",
        "date": "2021-03-30",
        "time": "19:20",
        "link": "https://www.meetup.com/OWASP-Sao-Paulo-Chapter/events/276964216/",
        "timezone": "America/Sao_Paulo",
        "description": "<p>OWASP Sao Paulo - Segundo Meetup Virtual de 2021</p> <p>A OWASP SP tem o prazer de anunciar a realização do segundo meetup virtual de 2021, no dia 30 de marco de 2021.</p> <p>*** PALESTRAS ***</p> <p>Palestrante : Magno Logan</p> <p>Título: Kubernetes Security - Attacking and Defending K8s Clusters</p> <p>This presentation aims to talk about different attack scenarios leveraging Kubernetes clusters. We'll dig deeper into a real-world attack scenario using real-world applications to demonstrate different ways attackers and malicious users can use to exploit your cluster and the applications running on it. After that, we'll provide some best practices to securing your cluster based on the scenarios and on the CIS Benchmarks for Kubernetes. We'll show how to use RBAC, to enable audit logs for better visibility, and we'll set up some network policies to avoid communication between pods and prevent any lateral movement from attackers.</p> <p>Mini-Bio:</p> <p>Magno Logan works as an Information Security Specialist for Trend Micro Cloud and Container Security Research Team. He specializes in Cloud, Container, and Application Security Research, Threat Modelling, Red Teaming, DevSecOps, and Kubernetes Security, among other topics. He has been tapped as a resource speaker for numerous security conferences around the globe including Canada, USA, Portugal, and Brazil. He is also the founder of JampaSec and a member of the CNCF SIG-Security team.</p> <p>Palestrante : Filipi Pires</p> <p>Título: Mantenha seu Código “safe” durante seu desenvolvimento usando ferramenta OpenSource.</p> <p>Durante essa apresentação estaremos caminhando sobre conceitos de Desenvolvimento Seguro, entendendo o movimento Shft Left, e colocando todos na mesma página sobre SSDLC (Secure Software Development Life Cycle), além de demonstração prática de ferramenta opensource tool exemplificando como a pessoa desenvolvedora pode usar uma ferramenta SAST para análise estática de vulnerabilidade de código, executando ela no código fonte, byte code e/ou binário, demonstrando algum possível “Leak\", através de análise do código fonte validando possíveis vazamentos de credenciais, chaves privadas ou senhas Hard coded e demonstrando no final como podemos ter um relatório com todas as informações de forma prática para apresentar para Tech Leads/Heads/Managers.</p> <p>Mini-Bio:</p> <p>Filipi Pires é Advocate e Pesquisador de Segurança na Zup Innovation, Instrutor e Pesquisador da Hackersec, faz parte da Staff do DEFCON Group São Paulo, tem palestrado em eventos de Segurança nos EUA, Alemanha, Polônia, Hungria, República Tcheca, Brasil e em outros países, atuou como Professor Universitário em cursos de graduação e MBA em faculdades como FIAP / Mackenzie / UNIBTA e UNICIV, além de ser criador e Instrutor do Curso - Análise de Malware - Fundamentals (HackerSec Company).</p> <p>*** INSCRIÇÕES ***</p> <p>O meetup é gratuito e para fazer a inscrição, você deverá confirmar a sua presença através do meetup.com.</p> <p>*** PROGRAMAÇÃO ***</p> <p>19h20 – Abertura<br/>19h30 – Palestra – Kubernetes Security - Attacking and Defending K8s Clusters – Magno Logan<br/>20h30 – Palestra – Mantenha seu Código “safe” durante seu desenvolvimento usando ferramenta OpenSource – Filipi Pires<br/>21h30 – Encerramento</p> <p>*** LINK PARA TRANSMISSÃO ***</p> <p>A palestra será transmitida pelo YouTube. O link será enviado para o email cadastrado e também será disponibilizado aqui na descrição do meetup, no dia 28 de março de 2020.</p> <p>*** SOBRE A OWASP SÃO PAULO ***</p> <p>A OWASP São Paulo é um dos 9 capítulos brasileiros entre os mais de 270 ativos em todo o mundo. O objetivo é disseminar a missão da fundação, tornando a segurança das aplicações visível para que as pessoas e as organizações possam tomar decisões conscientes sobre os verdadeiros riscos que correm.</p> <p>São realizados encontros periódicos para compartilhamento de conhecimentos, discussão de temas e aprendizado sobre segurança de software.</p> <p>Participe!</p> <p>Equipe OWASP São Paulo.</p> "
    },
    {
        "group": "Jakarta",
        "repo": "www-chapter-jakarta",
        "name": "Getting API security right",
        "date": "2021-03-27",
        "time": "14:00",
        "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/276846828/",
        "timezone": "Asia/Jakarta",
        "description": "<p>Title :</p> <p>Getting API security right</p> <p>Long Abstract</p> <p>The shift towards an API landscape indicates a significant evolution in the way we build applications. The rise of JavaScript and mobile applications have sparked an explosion of easily-accessible REST APIs. But does the rise of APIs result in the downfall of security? Why are there so many vulnerabilities and incidents involving APIs? How can you ensure that your APIs are secure?</p> <p> </p> <p>In this session, we use real-world cases to dive into best practices for securing your APIs. We discuss the attack surface of an API, common authorization problems, and best practice techniques to avoid these problems. At the end of this session, you will have an actionable set of guidelines to assess and improve the security of your own APIs.</p> <p>Name and title</p> <p>Dr. Philippe De Ryck</p> <p>Web Security Expert, Founder of Pragmatic Web Security</p> <p>Bio</p> <p>Philippe De Ryck helps developers protect companies through better web security. His Ph.D. in web security from KU Leuven lies at the basis of his exceptional knowledge of the security landscape. As the founder of Pragmatic Web Security, Philippe delivers security training and security consulting to companies worldwide. His online course platform allows anyone to learn complex security topics at their own pace. Philippe is a Google Developer Expert and an Auth0 Ambassador/Expert for his community contributions on the security of web applications and APIs.</p> <p>Social media profiles</p> <p>Twitter: <a href=\"https://twitter.com/PhilippeDeRyck\" class=\"linkified\">https://twitter.com/PhilippeDeRyck</a></p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/PhilippeDeRyck/\" class=\"linkified\">https://www.linkedin.com/in/PhilippeDeRyck/</a></p> <p>Github: <a href=\"https://github.com/philippederyck/\" class=\"linkified\">https://github.com/philippederyck/</a></p> <p>join by zoom</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/97993014788?pwd=UkI3bDRDRkNTd2hDeGpna1hNR3I4dz09\" class=\"linkified\">https://zoom.us/j/97993014788?pwd=UkI3bDRDRkNTd2hDeGpna1hNR3I4dz09</a></p> <p>Meeting ID: 979 9301 4788<br/>Passcode: owaspjkt21</p> "
    },
    {
        "group": "Tulsa",
        "repo": "www-chapter-tulsa",
        "name": "OWASP Tulsa break-out at Tulsa Web Devs; Free child care provided by LTFF",
        "date": "2021-04-19",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Tulsa-Chapter/events/nbdvmryccgbzb/",
        "timezone": "US/Central",
        "description": "<p>OWASP Tulsa has a break-out talk at every Tulsa Web Devs meetup. Tulsa Web Devs &amp; Techlahoma provide free food &amp; child-care!</p> <p>6pm - 6:30pm: Eat, mingle, announcements &amp; presentation pitches (5 minutes each)<br/>6:30pm - 8pm: Break out into OWASP Tulsa talk<br/>8pm: Leave to another venue, Typically Prairie Brewpub (<a href=\"https://www.yelp.com/biz/prairie-brewpub-tulsa\" class=\"linkified\">https://www.yelp.com/biz/prairie-brewpub-tulsa</a>)</p> <p>(Right next door to 36°N)</p> "
    },
    {
        "group": "Santa Barbara",
        "repo": "www-chapter-santa-barbara",
        "name": "Eradicate Vulnerability Classes with Secure Defaults + Lightweight Enforcement",
        "date": "2021-03-30",
        "time": "17:45",
        "link": "https://www.meetup.com/Santa-Barbara-OWASP-Chapter/events/276857915/",
        "timezone": "US/Pacific",
        "description": "<p>NOTE: You need to RSVP in order to get the link the day of the event.</p> <p>### Event Agenda (PST timezone) ###<br/>05.45 pm -- Event Kickoff &amp; Announcements, by Walter Martín Villalba, OWASP SB Leader -- <a href=\"https://twitter.com/act1vand0\" class=\"linkified\">https://twitter.com/act1vand0</a><br/>06.00 pm -- Presentation: Eradicate Vulnerability Classes with Secure Defaults + Lightweight Enforcement, by Clint Gibler -- <a href=\"https://twitter.com/clintgibler\" class=\"linkified\">https://twitter.com/clintgibler</a><br/>07.00 pm -- Closing Remarks</p> <p>### Abstract ###<br/>We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time.</p> <p>Rather than investing in finding more bugs, many modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks can enable organizations to solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole.</p> <p>In this talk, we’ll present a practical step-by-step methodology for:<br/>Choosing what to focus your AppSec resources on<br/>How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes<br/>How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers<br/>How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company</p> <p>### Bio###<br/>Clint Gibler (@clintgibler) is the Head of Security Research for r2c, a startup working on giving security tools directly to developers. Previously, Clint was a Research Director at NCC Group, a global security consulting firm, where he helped companies implement security automation and DevSecOps best practices as well as performed penetration tests for companies ranging from large enterprises to new startups. Clint has previously spoken at conferences including BlackHat USA, AppSec USA/EU/Cali, BSidesSF, and many DevSecCons. Clint holds a Ph.D. in Computer Science from the University of California, Davis. Want to keep up with security research? Check out *tl;dr sec*, Clint’s newsletter that contains summaries of artisanally curated, top talks and useful security links and resources from around the web. <a href=\"https://tldrsec.com/\" class=\"linkified\">https://tldrsec.com/</a></p> "
    },
    {
        "group": "Oklahoma City",
        "repo": "www-chapter-oklahoma-city",
        "name": "OWASP Oklahoma City Social Event",
        "date": "2021-03-29",
        "time": "16:00",
        "link": "https://www.meetup.com/Oklahoma-City-Chapter-Meetup/events/277120054/",
        "timezone": "US/Central",
        "description": "<p>Meet with others in the Oklahoma City area to discuss web application security.</p> "
    },
    {
        "group": "Brisbane",
        "repo": "www-chapter-brisbane",
        "name": "OWASP Meetup - '6mile' Paul McCarty",
        "date": "2021-03-31",
        "time": "18:30",
        "link": "https://www.meetup.com/Brisbane-OWASP-Meetup-Group/events/274794211/",
        "timezone": "Australia/Brisbane",
        "description": "<p>'Paul McCarty' - All your code repo are belong to us. What the Solarwinds hack should tell us about the state of software development</p> <p>If there's anything that the Solarwinds hack has taught us, it's that our industry needs to look internally and really try to understand WHY developers are not embracing security. Simply saying we need to \"shift left\" is bu*****t hype and means nothing. This talk will lay out the behaviours and workflows that developers use and how that affects the security of the products they built. It will also talk about the management and business requirements that encourage developers to build insecure products. I will use public and proprietary data to underpin the arguments and show how things are getting worse, instead of better in a public cloud-focused world.</p> "
    },
    {
        "group": "New Zealand",
        "repo": "www-chapter-new-zealand",
        "name": "Covid (What's changed & needs to change in infosec), Planning for this year",
        "date": "2021-03-31",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-New-Zealand-Chapter-Christchurch/events/275597430/",
        "timezone": "Pacific/Auckland",
        "description": "<p>Agenda:</p> <p>* Chat &amp; drink with mates<br/>* Community Topics<br/>Recent &amp; Upcoming events<br/>* Covid, how has/is it affecting us, changes we've made, need to make as organisations and personally<br/>* What do you want out of OWASP Chch this year, what do you have to contribute?<br/>* Continue the hallway conversations</p> <p>Discussion on Covid and what we need to be thinking about in our Jobs in relation to InfoSec and our personal OpSec</p> <p>As we move into this mid and post-pandemic world with remote and in-office work blending,<br/>what must organizations and us personally consider, in order to sustain/create data, application, infrastructure and personal security while still considering efficiencies and user experience?<br/>How has/does remote work change the security stack?</p> <p>Bring your ideas of what you would like the OWASP NZ chapter for Christchurch to cover this year, and whether you'd like to speak and/or contribute with a information security topic of your own.</p> "
    },
    {
        "group": "Sydney",
        "repo": "www-chapter-sydney",
        "name": "OWASP Sydney Fight Club - April meet",
        "date": "2021-04-21",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/277127563/",
        "timezone": "Australia/Sydney",
        "description": "<p>Welcome back to OWASP Sydney Chapter's Fight Club CTF! We’ve heard your feedback from our first Fight Club and plan to make this one even better!</p> <p>The first rule of Fight Club is: no attacking other participants' personal computers.<br/>The second rule of Fight Club is: no attacking other participants' personal computers.<br/>Other than that, all attack vectors within the given IP range are allowed. This includes Denial of Service, Man-in-the-Middle, and any other attack methods you can think of that are usually banned from CTFs!</p> <p>Challenges will be of varying difficulties but the idea is the same -- break into a machine, plant your team's flag, then defend your machine(s) from other teams who will be trying to plant their own flag. The team whose flag is present once the time limit is up claims the points for that machine.</p> <p>At the end of the year, the top team from each Fight Club night will go head to head in our grand finale at BSides Sydney!</p> <p>To register please go to: <a href=\"https://forms.gle/VUWjcTz4xVFUhGWM7\" class=\"linkified\">https://forms.gle/VUWjcTz4xVFUhGWM7</a></p> <p>This month’s event will be held on Discord so make sure to also join our community here: <a href=\"https://discord.com/invite/uAWze2B\" class=\"linkified\">https://discord.com/invite/uAWze2B</a></p> <p>Don't miss out on this opportunity to be crowned fight club champion!</p> <p>DISCLAIMER:<br/>OWASP Sydney does not guarantee that the ENVIRONMENT or any other associated website or servers, through which the content is made available to the Users, are provided without any “virus” or harmful component. The User’s entry to the “closed network” - (“Fight Club Network”) shall be performed under their own responsibility.</p> <p>Anything provided to the Users through our ENVIRONMENT shall not be regarded in any way, directly or indirectly, as stimulation, advice or instigation to commitment of any unlawful action. All publications or services provided have a clear educational purpose, such as upgrading User’s skills in penetration/security testing. Every User acts based upon their private will and ethics being the sole responsible for their actions.</p> <p>OWASP Sydney bears no responsibility for any misuse and/or inappropriate use of the services of the ENVIRONMENT by a User. For any damages caused, to the ENVIRONMENT, to the Network, to another User or to any third party, the sole responsible is the User that carried out the above-mentioned actions.</p> <p>OWASP Sydney under no circumstances, including the case of negligence, shall be held responsible for any kind of damage, which the User of the ENVIRONMENT may suffer given that they access on their own initiative.</p> "
    },
    {
        "group": "Austin",
        "repo": "www-chapter-austin",
        "name": "OWASP Austin Chapter Monthly Meeting - March 2021",
        "date": "2021-03-30",
        "time": "11:45",
        "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/276781839/",
        "timezone": "US/Central",
        "description": "<p>Chapter information and a presentation --</p> <p>Successful Customer Engagements using the OWASP Mobile Application Security Verification Standard</p> <p>Abstract:</p> <p>The team will be discussing Mobile Application Penetration Testing from the perspectives of original scoping and testing using OWASP’s Mobile Application Security Verification Standard including the various tools and resources available on both Android and IOS. We will be discussing not just the OWASP standard, but also give advice on lessons learned through our engagements highlighting several key issues and obstacles to consider for ensuring a successful experience for both the customer and your team.</p> <p>Speakers:</p> <p>-Mark Spears, Solis Security - Sr. Security Consultant &amp; Red Team Lead<br/>-Sam Danna, Solis Security - Security Consultant<br/>-Jon Adderholt, Solis Security - Security Consultant<br/>-Angela Lane, Solis Security – Project Manager</p> <p>Bio:<br/>Mark, Sam, and Jon comprise the Offensive Security Operations (aka Red Team) at Solis Security performing all sorts of engagements including Network, Web Application (+Mobile, APIs, and etc), Spearphishing, Wifi, Hardware Hacking, and more.</p> "
    },
    {
        "group": "Charlotte",
        "repo": "www-chapter-charlotte",
        "name": "How to Set up & Use C2 Empire and StarKiller",
        "date": "2021-04-21",
        "time": "19:00",
        "link": "https://www.meetup.com/owaspCLT/events/274988410/",
        "timezone": "US/Eastern",
        "description": "<p>How to How to Set up &amp; Use C2 Empire and StarKiller, for Red Team Testing. Presented by Josh.</p> "
    },
    {
        "group": "Portland",
        "repo": "www-chapter-portland",
        "name": "Brian Myers - XXE for Dummies (or How to Make an XML Parser Send You Files)",
        "date": "2021-04-07",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Portland-Chapter/events/276673932/",
        "timezone": "US/Pacific",
        "description": "<p>Description: A short, slow introduction to XML External Entity vulnerabilities. This talk grew out of an internal training for developers where I work. I'll explain what XXEs are, demonstrate how to exploit them, and review the standard defenses.</p> <p>Bio: Brian Myers is Director of Information Security at WebMD Health Services in Portland. He's spent over 25 years in software development, including time at Borland and Netscape.</p> "
    },
    {
        "group": "San Diego",
        "repo": "www-chapter-san-diego",
        "name": "The (Cyber) Security Paradox",
        "date": "2021-04-15",
        "time": "18:00",
        "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccgbtb/",
        "timezone": "US/Pacific",
        "description": "<p>Speaker: Ashton Mozano</p> <p>Talk Description: Taking inspiration from Parrondo's Paradox, this talk discusses how operating on the verge of catastrophic failure in modern electronics creates the paradox that the more effort put into \"securing\" a system may in fact be making it more vulnerable.</p> <p>Bio: Ash started as a kid in the pre-WWW community as the SysOp and Co-SysOp of a few US and European popular cracking BBSes, took a break from coding in college to study molecular biology and work on the human genome project, studied international business management in Europe, practiced law as a private sector and government litigator in the US, and has tought at various universities. He has held leadership roles in the tech sector, but would frequently return back to his roots in being hands-on in making and breaking software systems for the private sector and a DoD civilian, contractor and Naval Officer.</p> "
    },
    {
        "group": "Delhi",
        "repo": "www-chapter-delhi",
        "name": "OWASP Delhi March 2021 Chapter Meeting (Virtual)",
        "date": "2021-03-27",
        "time": "16:00",
        "link": "https://www.meetup.com/OWASP-Delhi-NCR-Chapter/events/277095715/",
        "timezone": "Asia/Calcutta",
        "description": "<p>OWASP Delhi March 2021 Meetup</p> <p>Agenda:</p> <p>4:00 pm - 4:15 pm IST : Introduction/Chapter Updates<br/>4:15 pm - 5 pm IST: Security Automation with Python by Himanshu Shukla<br/>5:00 pm - 5:45 pm IST: Active Directory Security - Kerberoasting by Ragini Chauhan<br/>5:45 pm - 6 pm IST: Feedback/Wrap up</p> <p>Abstracts:</p> <p>Talk Name - Security Automation With Python</p> <p>Abstract - Security Automation is emerging day by day. Once we learn any manual technique, it's a sublime thought to automate that process. By automation, not only we reduce human efforts but we are also deep diving into depths of understanding a particular technique. Python is one of the great asset for security professionals and it has everything to help us in the process of automation. \"Once a great human learned SQL injection and automated it &amp; today we have SQLMAP tool.\", This is the power of automation.</p> <p>Speaker - Himanshu Shukla<br/>Twitter - <a href=\"https://twitter.com/etc5had0w\" class=\"linkified\">https://twitter.com/etc5had0w</a><br/>Linkedin - <a href=\"https://www.linkedin.com/in/himanshushuklacs\" class=\"linkified\">https://www.linkedin.com/in/himanshushuklacs</a></p> <p>Talk Name - Active Directory Security - Kerberoasting</p> <p>Abstract - It about Active directory security in windows environment. most of companies internal infrastructure security is centrally handle by AD. so as an Attacker when I compromise a system where I have escalated my priv to local admin access. This talk is all about a way to get local admin access to domain admin access.</p> <p>Speaker - Ragini Chauhan</p> "
    },
    {
        "group": "Mumbai",
        "repo": "www-chapter-mumbai",
        "name": "OWASP Mumbai Online Meetup - 27th March 2021",
        "date": "2021-03-27",
        "time": "12:00",
        "link": "https://www.meetup.com/OWASP-Mumbai-Chapter/events/277112516/",
        "timezone": "Asia/Calcutta",
        "description": "<p>Session Details:</p> <p>Introduction to OWASP Mumbai Chapter.</p> <p>Newsbytes with Kalyani Devgade.</p> <p>Careers in Cyber Security by Nikhil Chodankar.</p> <p>Mastering the Art of Executive Presence with Bishakha Jain.</p> <p>General Discussion, QnA &amp; Feedback.</p> "
    },
    {
        "group": "Cambridge",
        "repo": "www-chapter-cambridge",
        "name": "ARU CSNRG, OWASP Camb & BCS Cyber Forensics “Wildlife Cybercrime Investigations\"",
        "date": "2021-04-20",
        "time": "17:30",
        "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/277176222/",
        "timezone": "Europe/London",
        "description": "<p>Hosted by the Cyber Security &amp; Networking Research Group, Anglia Ruskin University, OWASP Cambridge Chapter, BCS Cybercrime Forensics SG &amp; BCS Dorset/Hampshire Branches.</p> <p>Background</p> <p>OWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.</p> <p>The Cyber Security and Networking (CSN) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research.</p> <p>The BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics</p> <p>Speaker Bio &amp; Abstracts</p> <p>Stuart Clarke - Regional Director &amp; Cyber CTO at Nuix. \"Wildlife Cybercrime Investigations using Open Source Data”</p> <p>Bio: Stuart Clarke - Regional Director &amp; Cyber CTO at Nuix.</p> <p>Stuart is an internationally respected information security expert who is responsible for the overall security and intelligence strategy and delivery at Nuix. During his time at the company, Stuart has advised the United Nations’ peak cybersecurity body ITU and provided cybersecurity training for over 60 computer emergency response teams. He led the development of Nuix Investigation &amp; Response, an innovative investigative tool used to delve into the causes and scope of data breaches. He also currently leads the development of Nuix Insight Analytics &amp; Intelligence, a powerful security intelligence platform.</p> <p>Stuart has a deep understanding of the Nuix technology and capabilities. Prior to joining Nuix, he used Nuix offerings extensively in breach response. He brings that understanding together with a vision for the cybersecurity needs of Nuix’s current and prospective clients. He holds a Bachelor of Science degree with honours in Computer Forensics and a Master’s Degree in Business Administration. He has developed and delivered training for a Master of Science program in Computer Security and Forensics, has contributed to a book covering evidence preservation as well as published several industry-recognized white papers.</p> <p>Abstract : \" Wildlife Cybercrime Investigations using Open Source Data”</p> <p>The illegal wildlife trade is one of the largest forms of transnational organized crime, earning tens of billions of dollars per year. Fraud, money-laundering, violence, trafficking, and corruption often come hand-in-hand with wildlife crime. The challenges for law enforcement agencies are like those investigators face every day—although often in more exotic locations.</p> <p>Many criminal networks use mobile devices, social media platforms, the dark web, e-commerce, and instant messaging to coordinate their activities, find buyers, and sell their illicit product. Investigators must take a multifaceted approach that bridges real-world and digital activity, exposing hidden connections across people, objects, locations, and events. This session will explore digital forensic techniques that enable all kinds of investigators to understand criminal networks and reveal insights that help disrupt future illegal activities.</p> <p>In the session you will learn:</p> <p>• The key drivers behind one of the largest organized global crimes<br/>• How Nuix can connect POLE objects across intelligence, mobile &amp; IoT devices and social media to reveal hidden connections<br/>• Techniques for developing intelligence to disrupt all forms of organized crime.</p> <p>Agenda</p> <p>17:30 - Webinar waiting lobby opens<br/>17:45 - Presentation followed by Questions and Answers<br/>19:00 - Closing</p> "
    },
    {
        "group": "Germany",
        "repo": "www-chapter-germany",
        "name": "~ ModSecurity Core Rule Set (CRS)",
        "date": "2021-04-14",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Hamburg-Stammtisch/events/276707163/",
        "timezone": "Europe/Berlin",
        "description": "<p>... presented by Christian Folini</p> <p>Abstract:<br/>=========</p> <p>This is a basic introduction to the OWASP ModSecurity Core Rule Set<br/>(CRS). The talk presents ModSecurity as an open source web application<br/>firewall, runs an installation demo for CRS, presents important group<br/>of rules and explains the core concepts like anomaly scoring, paranoia<br/>levels and strict siblings along the way.</p> <p>---------------------</p> <p>More content to follow. Link might change.</p> "
    },
    {
        "group": "Hungary",
        "repo": "www-chapter-hungary",
        "name": "🦸🏼‍♀️🦸🦸🏽‍♂️ Return of The Security Champions! Ep. 2 [en,jitsi,yt,ch]",
        "date": "2021-03-31",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-HU/events/277145495/",
        "timezone": "Europe/Budapest",
        "description": "<p>Live on YT: TBD<br/>Join on Jitsi without any registration in your browser or in the Jitsi mobile app (just copy the below link including https as the name of the room):<br/><a href=\"https://8x8.vc/secm/ch\" class=\"linkified\">https://8x8.vc/secm/ch</a><br/>Or join on Clubhouse:<br/><a href=\"https://www.joinclubhouse.com/event/TBD\" class=\"linkified\">https://www.joinclubhouse.com/event/TBD</a></p> <p>### About</p> <p>This meetup is about the practice of security champions, and it adds to the previous episode which was more about the theory.</p> <p>Julia delivers her experience and pain being a one year old security champion in a finance tech middle size company. She will give an overview of what worked good and what she would gladly change if she have had a time machine. There will be tips given on whether or not the whole swarming around security championship is needed and how to succeed from day zero.</p> <p>Alexander, Davide, Péter, Marcos and Timur will reflect on the main speakers interactively.</p> <p>As a reminder in the previous episode Marcos Valle [Glovo!] was speaking about the theory and also shared his experiences learned on the front lines.<br/><a href=\"https://www.youtube.com/watch?v=LPNZCKpJySU\" class=\"embedded\">https://www.youtube.com/watch?v=LPNZCKpJySU</a></p> <p>### Speakers</p> <p>Julia Ganol, chapter lead mobile / senior iOS developer, Amsterdam</p> <p>### Moderated by</p> <p>Timur Khrotko and Péter Nyilasy on behalf of OWASP HU</p> <p>### Meat links</p> <p>\"Security Champions v2.0\", a 2017 talk by Alexander Antukh:<br/><a href=\"https://owasp.org/www-pdf-archive/OWASP_Bucharest_2017_Antukh.pdf\" class=\"linkified\">https://owasp.org/www-pdf-archive/OWASP_Bucharest_2017_Antukh.pdf</a></p> <p>Security Champions Playbook v1.1, a project:<br/><a href=\"https://github.com/c0rdis/security-champions-playbook\" class=\"linkified\">https://github.com/c0rdis/security-champions-playbook</a></p> <p>\"Software security at the organizational level\", an article by Péter Nyilasy:<br/><a href=\"https://medium.com/defdeveu/software-security-at-the-organizational-level-980174615443\" class=\"linkified\">https://medium.com/defdeveu/software-security-at-the-organizational-level-980174615443</a></p> <p>\"Organizational glue (OD approach to the champs dilemma)\" a Global AppSec 2020 talk by Péter Nyilasy w/ Timur Khrotko:<br/><a href=\"https://youtu.be/OsHNYG8uciM\" class=\"embedded\">https://youtu.be/OsHNYG8uciM</a></p> <p>### Credits<br/>Photo by Karsten Winegeart on Unsplash<br/><a href=\"https://www.pngwing.com/en/free-png-bnufr\" class=\"linkified\">https://www.pngwing.com/en/free-png-bnufr</a></p> "
    },
    {
        "group": "Norway",
        "repo": "www-chapter-norway",
        "name": "Privacy Case Study: Ambient Light Sensor API",
        "date": "2021-04-21",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Norway/events/277094300/",
        "timezone": "Europe/Oslo",
        "description": "<p>Welcome to another remote meetup!<br/>This time we will be joined by Lukasz Olejnik, who will walk us through an Ambient Light Sensor API privacy case study.<br/>We'll wrap things up with a short Q&amp;A afterward.</p> <p>For the majority of users, web browser is the most important computer application. Increasingly complex, exciting and rich, features are standardized by W3C and implemented in web browsers on a normal basis. New browser features introduce interesting privacy challenges for standardization, research and development. I will demonstrate a privacy case study based on the example of Ambient Light Sensor. A web privacy impact assessment of a planned web browser feature, the Ambient Light Sensor API, indicated risks arising from the exposure of overly precise information about the lighting conditions in the user environment. The analysis led to the demonstration of direct risks of leaks of user data, such as the list of visited websites or exfiltration of sensitive content across distinct browser contexts. Our work contributed to the creation of web standards leading to decisions by browser vendors (i.e. obsolescence, non-implementation or modification to the operation of browser features). We highlight the need to consider broad risks when making reviews of new features. I will suggest practically-driven high-level observations lying on the intersection of web security and privacy risk engineering and modeling, and standardization.</p> <p>Dr Lukasz Olejnik acts as an independent security and privacy researcher and advisor. His experience spans research, industry, standardization, and policy. His research interests include information and computer security and privacy, user data disclosure and dissemination problems as well as privacy-sensitive matters related to web browser functionalities, web security, privacy reviews, and privacy impact assessments. His research analysing user tracking and profiling on the web has impacted web standards and web browsers.</p> <p>Lukasz is a World Wide Web Consortium’s (W3C) Invited Expert, where he focuses on privacy of web standards. In[masked] he was elected to the W3C’s Technical Architecture Group. Lukasz is involved in technology policy, focusing on cyber security, privacy, and data protection. He held roles as technology policy advisor at the European Parliament (working on ePrivacy), scientific advisor on cyber warfare at the International Committee of the Red Cross, with a focus on assessing the humanitarian consequences of cyber operations, and science and technology advisor at the European Data Protection Supervisor.</p> <p>Read more about the case study on his website:<br/><a href=\"https://blog.lukaszolejnik.com/shedding-light-on-designing-web-features-with-privacy-risks-impact-assessments-case-study/\" class=\"linkified\">https://blog.lukaszolejnik.com/shedding-light-on-designing-web-features-with-privacy-risks-impact-assessments-case-study/</a></p> "
    },
    {
        "group": "Poland",
        "repo": "www-chapter-poland",
        "name": "8. OWASP Poland Meetup Online",
        "date": "2021-03-31",
        "time": "18:00",
        "link": "https://www.meetup.com/owasp-poland/events/276886134/",
        "timezone": "Europe/Warsaw",
        "description": "<p>Serdecznie zapraszam na kolejne zdalne spotkanie OWASP, które odbędzie się 31 marca 2021. Zaczniemy od omówienia interesującej podatności HTTP Request Smuggling a zakończymy ogólną dyskusją na temat najczęściej spotykanych podatności w minionym roku (prezentacja w języku angielskim).</p> <p>---</p> <p>18:00 – 18:05 – Powitanie i otwarcie spotkania, Daniel Krasnokucki, Michał Kurek</p> <p>18:05 – 18:50 – Przemytnicy żądań, czyli HTTP Request Smuggling, Justyna Bojar, Krzysztof Cąderek</p> <p>Podczas prezentacji przedstawiona zostanie nietypowa podatność HTTP Request Smuggling, która wynika z różnic w przetwarzaniu żądań HTTP przez poszczególne urządzenia. Pozwala ona na \"przemycenie\" dowolnego żądania jako części innego, nieszkodliwego żądania HTTP, co może nieść za sobą poważne skutki. Omówione zostanie z czego wynika ta podatność oraz zaprezentowane będą przykłady jej wykorzystania podczas rzeczywistych testów penetracyjnych.</p> <p>Justyna zajmuje się testami penetracyjnymi aplikacji webowych, API oraz audytami bezpieczeństwa w zespole Cyber Security KPMG, interesuje się również wykorzystaniem sztucznej inteligencji w cyberbezpieczeństwie. Jej największą pasją są podróże, a w czasie pandemii gra na ukulele, czyta książki i planuje przyszłe wyjazdy.</p> <p>Krzysztof pracuje w KPMG jako konsultant bezpieczeństwa. Najczęściej przeprowadza testy penetracyjne aplikacji webowych oraz API. Dodatkowo wykonuje również projekty z zakresu reakcji na incydenty. Poza projektami zajmuje się również monitorowaniem bezpieczeństwa sieci oraz administracją. W czasie wolnym często gra w gry planszowe ze znajomymi.</p> <p>18:50 – 19:35 – Most frequent critical vulnerabilities in 2020, Andriy Varusha</p> <p>Andriy lives in Krakow and runs an AppSec company. In his presentation, he will share some conclusions from his team's experience in 2020. Andriy will show what were the top critical vulnerabilities identified, demonstrating some of the examples (anonymous of course) and consequences to the business. Also, he will share an overview of the statistics related to vulnerabilities revealed and how customers tend to treat them.</p> <p>19:35 – 20:00 – Q&amp;A, otwarta dyskusja</p> "
    },
    {
        "group": "Switzerland",
        "repo": "www-chapter-switzerland",
        "name": "OWASP DefectDojo - the Heart of your AppSec Automation",
        "date": "2021-04-14",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASPSwitzerland/events/276343964/",
        "timezone": "Europe/Zurich",
        "description": "<p>OWASP Switzerland brings you another high profile talk directly from the source.</p> <p>Defect Dojo project leads Aaron Weaver and Matt Tesauro as well as contributor/moderator Fred Blaise will initiate us into the magic of Defect Dojo.</p> <p>Abstract<br/>You’re tasked with ‘doing AppSec’ for your company and you’ve got more apps and issues than you know how to deal with. How do you make sense of the different tools outputs for all your different apps? DefectDojo can be your one source of truth and become the heart of your AppSec automation program.</p> <p>DefectDojo grew out of a Product Security program 8 years ago and was created by AppSec people for AppSec people. In this talk, you’ll learn about DefectDojo and how to make the most of the many features it offers including its REST-based API. DefectDojo can be your one source of truth for discovered security vulnerabilities, report generation, aggregation of over 80 different security tools, inventory of applications, tracking testing efforts and metrics on the AppSec program. DefectDojo was the heart of an AppSec automation effort that saw an increase in assessments from 44 to 414 in two years. Don't you want 9.4 times more output from your AppSec program? It's time to ditch spreadsheets and get DefectDojo.</p> <p>You can find more about Defect Dojo on their website: <a href=\"https://www.defectdojo.org/\" class=\"linkified\">https://www.defectdojo.org/</a></p> <p>Our speakers for this talk are:<br/>- Matt Tesauro: Project Lead DefectDojo.<br/>- Aaron Weaver: Project Lead DefectDojo.<br/>- Fred Blaise: Moderator DefectDojo. As he lives in Switzerland, we can consider him the “local branch of DefectDojo” ;-)</p> "
    },
    {
        "group": "Sofia",
        "repo": "www-chapter-sofia",
        "name": "Compromising Modern Online Banking Apps through Hijacking Android Devices",
        "date": "2021-03-27",
        "time": "10:00",
        "link": "https://www.meetup.com/OWASP-Sofia-Chapter/events/277134156/",
        "timezone": "Europe/Sofia",
        "description": "<p>(The talk will be in Bulgarian)</p> <p>Live Demo: Compromising Modern Online Banking Apps through Hijacking Android Devices</p> <p>In this talk Dr. Svetlin Nakov will explain and demonstrate how easily a 10-years old child can gain full control over modern European online banking apps, through hijacking an Android mobile phone, using trivial remote administration tools and screen recording apps from the official Android app store. The speaker will demonstrate why online banking should not rely for the multi-factor authentication on a single connected device. Finally, the speaker will give recommendations for fixing the security in online banking systems.</p> <p>Dr. Svetlin Nakov (<a href=\"https://nakov.com\" class=\"linkified\">https://nakov.com</a>) is a passionate software engineer, inspirational technical trainer and tech entrepreneur, with 20 years of experience in a broad range of programming languages, software technologies and platforms, applied cryptography and cybersecurity. He is an author of the \"Practical Cryptography for Developers\" book (<a href=\"https://cryptobook.nakov.com\" class=\"linkified\">https://cryptobook.nakov.com</a>). Svetlin is co-founder of several highly successful tech startups and non-profit organizations. Currently, he is innovation and inspiration manager at SoftUni (<a href=\"https://softuni.org\" class=\"linkified\">https://softuni.org</a>) - the largest tech education provider in South-Eastern Europe.</p> <p>[BG]<br/>Демонстрация: компрометиране на онлайн банкиране чрез отвличане на Android телефон</p> <p>В тази демонстрация на живо д-р Светлин Наков ще обясни и демонстрира колко лесно 10-годишно дете може да получи пълен контрол над съвременните европейски приложения за онлайн банкиране, чрез отвличане на мобилен телефон с Android, използвайки тривиални инструменти за отдалечено администриране и приложения за запис на екрана от Android app store. Лекторът ще демонстрира защо онлайн банкирането не трябва да разчита на многофакторното удостоверяване на единично свързано устройство. Накрая ще бъдат дадени препоръки за подобряване на сигурността в системите за онлайн банкиране.</p> <p>Д-р Светлин Наков (<a href=\"https://nakov.com\" class=\"linkified\">https://nakov.com</a>) е разпален софтуерен инженер, вдъхновяващ преподавател и технологичен предприемач, с 20-годишен опит в широк спектър от програмни езици, софтуерни технологии и платформи, приложна криптография и киберсигурност. Той е автор на книгата \"Практическа криптография за разработчици\" (<a href=\"https://cryptobook.nakov.com\" class=\"linkified\">https://cryptobook.nakov.com</a>). Светлин е съосновател на няколко изключително успешни технологични стартиращи компании и нестопански организации. В момента той е мениджър по иновации и вдъхновение в SoftUni (<a href=\"https://softuni.org\" class=\"linkified\">https://softuni.org</a>) - най-големият доставчик на технологично образование в Югоизточна Европа.</p> "
    },
    {
        "group": "Kyiv",
        "repo": "www-chapter-kyiv",
        "name": "OWASP Kyiv Spring 2021 ONLINE Meetup",
        "date": "2021-04-24",
        "time": "10:00",
        "link": "https://www.meetup.com/kyiv-meetup-group/events/276870639/",
        "timezone": "Europe/Kiev",
        "description": "<p>The second OWASP Kyiv chapter meetup in 2021 will be held on April 24 in the online format. The attendance is free of charge.<br/>If you want to be a speaker or present your workshop, please feel free to fill the form here: <a href=\"https://cfp.owaspukraine.org/okspring2021/\" class=\"linkified\">https://cfp.owaspukraine.org/okspring2021/</a></p> "
    },
    {
        "group": "Victoria",
        "repo": "www-chapter-victoria",
        "name": "April 2021 Virtual AppSec Meetup",
        "date": "2021-04-20",
        "time": "18:00",
        "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/276852869/",
        "timezone": "Canada/Pacific",
        "description": "<p>The OWASP Victoria chapter is pleased to present our Spring 2021 event where Amiran Alavidze will be delivering a talk on Kubernetes security.</p> <p>The event will be held online on April 20th from 6:00pm – 7:00pm.</p> <p>It will feature Amiran’s talk followed by a Q&amp;A and a draw for a prize (must be registered member and reside in Canada). Join us for an evening of application security learning and discussions.</p> <p>Visit our OWASP Chapter to learn more about us at <a href=\"https://owasp.org/www-chapter-victoria/\" class=\"linkified\">https://owasp.org/www-chapter-victoria/</a></p> <p>Speaker: Amiran Alavidze<br/>Presentation: Securing Managed Kubernetes (1hr)</p> <p>Abstract<br/>It’s clear that Kubernetes has won the container orchestration wars and is here to stay. The complexity, flexibility and rapid development cycle of Kubernetes mean that Kubernetes security landscape varies significantly across deployments and is not well understood generally.</p> <p>This talk focuses on security of managed cloud Kubernetes clusters, which provide a decently secure baseline that addresses the majority of recommendations you’ll find on the Internet. You’ll come out equipped with understanding of the Kubernetes threat model and actionable recommendations for securely running workloads in Kubernetes.</p> <p>Speaker Bio<br/>Amiran is currently Director, Security and Risk Management at Tasktop, building a product security program. With over 15 years in information security in roles ranging from system engineering and security operations to governance, risk and compliance, Amiran is advocating a pragmatic, business-focused approach to security.<br/>Security is not just a job, it’s a passion.</p> <p>Official Event Sponsor: KPMG Canada (<a href=\"https://home.kpmg/ca/en/home.html\" class=\"linkified\">https://home.kpmg/ca/en/home.html</a>)</p> "
    },
    {
        "group": "Bonita Springs",
        "repo": "www-chapter-bonita-springs",
        "name": "OWASP Monthly Meeting",
        "date": "2021-04-06",
        "time": "18:30",
        "link": "https://www.meetup.com/OWASP-Bonita-Springs-Chapter/events/276036837/",
        "timezone": "US/Eastern",
        "description": "<p>This meeting will be held virtually only and will continue on our coverage of vulnerable web application issues and the OWASP Top 10. Given time, examples may be provided as well.</p> <p>We generally review security related happenings, share tips and tricks for configuring software and hardware, and chat about various topics such as security, privacy, exploitation, vulnerabilities, pen testing, web app security, CTFs, IoT security, mobile security and anything else members wish to discuss.</p> "
    },
    {
        "group": "Karachi",
        "repo": "www-chapter-karachi",
        "name": "Security in Payment Applications",
        "date": "2021-03-28",
        "time": "19:00",
        "link": "https://www.meetup.com/OWASP-Karachi-Chapter/events/277131011/",
        "timezone": "Asia/Karachi",
        "description": "<p>These days many applications are being developed. We see Mobile Apps, Web Apps, integrated Payment Platforms, and yet many of us fail to realize, what it really takes to bake Security in those applications.</p> <p>Please join us in a detailed talk with Mr. Kashif Hassan (Director - Risk Associates, OWASP Karachi Chapter Leader having multiple Certifications) on how to add Security in Payment Application, particularly where Card Payment are involved.</p> <p>Where: online: ( Link would be displayed after one RSVPs)<br/>When: 28 March 2021<br/>When: 1900 hours.<br/>Bring with you one hour of time to learn things, and questions, if you want to ask.</p> "
    }
]