[{"chapter": "Tunisia", "repo": "www-chapter-tunisia", "name": "OWASP SAMM2 - Your Dynamic Software Security Journey", "date": "2021-01-29", "time": "12:00", "link": "https://www.meetup.com/OWASP-Tunis-Meetup-Group/events/275749110/", "timezone": "Africa/Tunis", "description": "<p>Take your ticket here: <a href=\"https://www.eventbrite.co.uk/e/owasp-samm2-your-dynamic-software-security-journey-tickets-136600244007\" class=\"linkified\">https://www.eventbrite.co.uk/e/owasp-samm2-your-dynamic-software-security-journey-tickets-136600244007</a></p> <p>Thanks to Our Guest: Sebastien Deleersnyder</p> <p>Sebastien Deleersnyder (<a href=\"https://twitter.com/sebadele\" class=\"linkified\">https://twitter.com/sebadele</a>) is co-founder, CEO of Toreon and a proponent of application security as a holistic endeavor. He started the Belgian OWASP chapter, was a member of the OWASP Foundation Board and performed several public presentations on Application Security. Seba also co-founded the yearly security &amp; hacker BruCON conference and trainings in Belgium. With a background in development and many years of experience in security, he has trained countless developers to create software more securely. He has led OWASP projects such as OWASP SAMM, thereby truly making the world a little bit safer. Now he is adapting application security models to the evolving field of DevOps and is also focused on bringing Threat Modeling to a wider audience.</p> <p>Desription</p> <p>OWASP Software Assurance Maturity Model (SAMM) enables you to formulate and implement a strategy for software security that is tailored to the risk profile of your organisation. In this talk, we give an overview of the new release of the SAMM model. After 10 years since its first conception, it was important to align it with today’s development practices. We will cover a number of topics in the talk:<br/>the core structure of the model, which was redesigned and extended to align with modern development practices, the measurement model which was setup to cover both coverage and quality and the new security practice streams where the SAMM activities are grouped in maturity levels. We will demonstrate the new SAMM2 toolbox to measure the maturity of an example development team and how you can create a roadmap of activities.</p> "}, {"chapter": "Oklahoma City", "repo": "www-chapter-oklahoma-city", "name": "Web Application Vulnerability Testing", "date": "2021-01-29", "time": "15:00", "link": "https://www.meetup.com/Oklahoma-City-Chapter-Meetup/events/275799003/", "timezone": "US/Central", "description": "<p>I’m this meeting we are going to cover how to identify and test for 3 web application vulnerabilities.</p> <p>The presenters will be:</p> <p>1. Joe Sullivan<br/>2. Skyler Tuter<br/>3. TBD</p> <p>This is a virtual meeting.</p> "}, {"chapter": "Sydney", "repo": "www-chapter-sydney", "name": "OWASP Sydney Fight Club - February Meet", "date": "2021-02-17", "time": "18:00", "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/275618877/", "timezone": "Australia/Sydney", "description": "<p>Introducing OWASP Sydney Chapter's first ever Fight Club CTF! Inspired by Hack the Box's King of the Hill, every second month, we are bringing you a night of hacking, to unleash your skills on a series of vulnerable machines, then defend against your opponents! This will be a team-based event where you are free to choose your own teams (minimum of 2 members and maximum of 4). If you are unable to find a team, let us know and we will help form a team for you.</p> <p>The first rule of Fight Club is: no attacking other participants' personal computers. The second rule of Fight Club is: no attacking other participants' personal computers. Other than that, all attack vectors within the given IP range are allowed. This includes Denial of Service, Man-in-the-Middle, and any other attack methods you can think of that are usually banned from CTFs!</p> <p>Challenges will be of varying difficulties but the idea is the same -- break into a machine, plant your team's flag, then defend your machine(s) from other teams who will be trying to plant their own flag. The team whose flag is present once the time limit is up claims the points for that machine.</p> <p>At the end of the year, the top team from each Fight Club night will go head to head in our grand finale at BSides Sydney!</p> <p>To register please go to: <a href=\"https://forms.gle/Ukb1gTZZLR7SALHA6\" class=\"linkified\">https://forms.gle/Ukb1gTZZLR7SALHA6</a></p> <p>Don't miss out on this opportunity to be crowned fight club champion!</p> <p>DISCLAIMER:<br/>OWASP Sydney does not guarantee that the ENVIRONMENT or any other associated website or servers, through which the content is made available to the Users, are provided without any “virus” or harmful component. The User’s entry to the “closed network” - (“Fight Club Network”) shall be performed under their own responsibility.</p> <p>Anything provided to the Users through our ENVIRONMENT shall not be regarded in any way, directly or indirectly, as stimulation, advice or instigation to commitment of any unlawful action. All publications or services provided have a clear educational purpose, such as upgrading User’s skills in penetration/security testing. Every User acts based upon their private will and ethics being the sole responsible for their actions.</p> <p>OWASP Sydney bears no responsibility for any misuse and/or inappropriate use of the services of the ENVIRONMENT by a User. For any damages caused, to the ENVIRONMENT, to the Network, to another User or to any third party, the sole responsible is the User that carried out the above-mentioned actions.</p> <p>OWASP Sydney under no circumstances, including the case of negligence, shall be held responsible for any kind of damage, which the User of the ENVIRONMENT may suffer given that they access on their own initiative.</p> "}, {"chapter": "Cleveland", "repo": "www-chapter-cleveland", "name": "OWASP 2021 with Cleveland Chapter", "date": "2021-01-29", "time": "18:30", "link": "https://www.meetup.com/owasp-cleveland-group/events/275751911/", "timezone": "US/Eastern", "description": "<p>The OWASP Cleveland Chapter will host its first meeting which will kickoff on Friday, January 29, 2021 at 6:30 pm EST. The first meeting will provide an introduction to what you can expect from our chapter in 2021 and it will also serve as our first membership drive. The chapter leaders are Eric Potter, Ian Mulhern, and Princeton Brooke. Each leader has adopted an OWASP project that will be reviewed in the first meeting and then expanded-on throughout the course of 2021. We look forward to serving the OWASP community, the city of Cleveland and Northeast Ohio, and security practitioners all over the world.</p> <p>We look forward to hearing from members and having open dialog on how our chapter can assist in servicing the needs of the greater OWASP organization.</p> <p>We will update this posting with the destination URL.</p> "}, {"chapter": "Minneapolis St Paul", "repo": "www-chapter-minneapolis-st-paul", "name": "February meeting: The state of IoT security", "date": "2021-02-11", "time": "19:00", "link": "https://www.meetup.com/OWASP-MSP-Meetup/events/275615353/", "timezone": "US/Central", "description": "<p>TBD</p> "}, {"chapter": "New York City", "repo": "www-chapter-new-york-city", "name": "Threat Modeling by Izar Tarandach and Matthew Coles", "date": "2021-02-11", "time": "19:00", "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/275276260/", "timezone": "US/Eastern", "description": "<p>Izar Tarandach (@izar_t) and Matthew Coles (@coles_matthewj) will discuss the following topics in applied threat modeling:</p> <p>Principles: Formulate a conversation around the relationships of concepts in security. This will include attackers, exploits and value, and how the characteristics of these connections might be understood and managed.</p> <p>Methods: Refresher on modeling techniques and things to consider, then dive into a selection of modeling and analysis methodologies that will help you get from principles to practice.</p> <p>Evolution: Automated threat analysis using an open source tool(pytm). We will talk through the making of pytm and then do a demo.</p> <p>*** Speaker bios</p> <p>Izar Tarandach has peeked and poked at security from various sides over the last couple of decades, currently focusing on modern SDLC's and how AppSec extrapolates onto the larger scheme of Security. He has a MSc in Computer Science/Security from Boston U.</p> <p>Matthew Coles (he/him) is a security professional focused on the security of physical devices and the ecosystems and processes that enable them to operate. He has an advanced degree in Computer Science from WPI, and maintains a CSSLP certification.</p> <p>Izar and Matt have collaborated on security techniques and training for the past 10 years, co-authoring a book on Threat Modeling, and an open source threat modeling automation system, pytm.</p> <p>- OWASP PyTM: <a href=\"https://owasp.org/www-project-pytm/\" class=\"linkified\">https://owasp.org/www-project-pytm/</a><br/>- Threat Modeling Manifesto: <a href=\"http://www.threatmodelingmanifesto.org\" class=\"linkified\">http://www.threatmodelingmanifesto.org</a><br/>- Threat Modeling: A Practical Guide for Development Teams: <a href=\"https://www.amazon.com/Threat-Modeling-Identification-Avoidance-Secure/dp/1492056553\" class=\"linkified\">https://www.amazon.com/Threat-Modeling-Identification-Avoidance-Secure/dp/1492056553</a></p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2021-02-25", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqyccdbhc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Cambridge", "repo": "www-chapter-cambridge", "name": "ARU CSNRG, OWASP Cambridge & BCS Cybercrime Forensics “IoT Forensics” Webinar", "date": "2021-02-02", "time": "18:00", "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/275823465/", "timezone": "Europe/London", "description": "<p>Hosted by the Cyber Security &amp; Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter &amp; BCS Cybercrime Forensics SG.</p> <p>Speaker Biographies &amp; Abstracts</p> <p>Keith Cottenden CISSP, Head of Digital Forensics &amp; Incident Response, 3B Data Security, \"IoT Forensics”</p> <p>Bio: Keith Cottenden CISSP, Head of Digital Forensics &amp; Incident Response, 3B Data Security</p> <p>Keith is Head of Digital Forensics and Incident Response and a Certified Information Systems Security Professional with 3B Data Security. In this position he is responsible for overseeing PCI Forensic Investigations and Incident Response; addressing and managing the aftermath of a security breach or cyberattack.</p> <p>Prior to this appointment, Keith was the Technical Director at CYFOR for 15 years where he was responsible for directing all digital forensic operations within the company; providing specialist knowledge of information technology investigative techniques and dealing with complex evidential and legal issues, instructing investigating officers and counsel as appropriate; ensuring evidence continuity, evidential integrity and admissibility of any recovered evidence in a manner acceptable to a Court of Law.</p> <p>Keith’s exemplary career includes 22 years in the Royal Air Force Police specialising as a Counterintelligence and Information Technology Security investigator. He has worked on behalf of law enforcement agencies, solicitors and corporate clients on a variety of UK based and international cases. He is a highly experienced and respected digital forensic expert witness who is regularly instructed in significant civil litigation cases and regularly gives evidence in criminal and civil courts including the High Court of Justice.</p> <p>Keith has an established reputation as a cyber security consultant with extensive knowledge of the principles and practices of digital forensics and eDiscovery with a wealth of experience conducting investigations and consulting at clients premises worldwide; preparing complex technical reports for clients and court that are easy to understand, informative and precise and has the relevant understanding of British, EU and US law in relation to civil litigation, computer based fraud and misuse and corporate IT legislative requirements and a comprehensive knowledge of the ACPO guidelines and the procedures relating to the investigation of computer crime.</p> <p>He has presented hundreds of seminars and has spoken at national and international conferences; he is frequently quoted in the media, featuring on Panorama ‘Are the Net Police Coming for You?’ (2010), BBC Inside Out (2014) and BBC Rip Off Britain (2016); also live on Sky News (2014) and BBC London News (2008), giving expert opinion in relation to cybercrime.</p> <p>Abstract : “IoT Forensics”</p> <p>Connected physical devices, home automation appliances, and wearable devices are all part of the Internet of Things (IoT). All of these have two major things in common; seamless connectivity and huge data transfer. This also results in plenty of additional opportunities for significant data breaches and associated cyber security threats. The objective of traditional digital forensics is to identify, collect, analyse, and present digital evidence, collected from various mediums, in a cyber related incident; the exponential growth of IoT devices and the increasing number of cyber security incidents has given birth to the term IoT forensics and the resulting challenges. Additionally, most IoT devices come with no inbuilt security features and there is a requirement for more research into IoT devices security, IoT forensic readiness, and a forensic framework for IoT device.</p> <p>Provisional Agenda</p> <p>18:00 - Webinar waiting lobby opens<br/>18:15 - Presentation followed by Questions and Answers<br/>19:30 - Closing, with virtual networking</p> "}, {"chapter": "Switzerland", "repo": "www-chapter-switzerland", "name": "ZAP Automation in CI/CD", "date": "2021-02-09", "time": "18:00", "link": "https://www.meetup.com/OWASPSwitzerland/events/275004625/", "timezone": "Europe/Zurich", "description": "<p>OWASP ZAP is probably the most frequently used web application scanner in the world, and automation is one of its strengths.<br/>In this talk Simon will explain the different options you have for running ZAP in a CI/CD pipeline ranging from the packaged scans to directly driving the ZAP API.<br/>He will also explain (and maybe even demo) a new ZAP automation framework which is currently under development.</p> <p>ZAP is an OWASP flagship project and you can find more information on <a href=\"https://www.zaproxy.org/\" class=\"linkified\">https://www.zaproxy.org/</a> .</p> <p>About your speaker:<br/>Simon Bennetts is the OWASP Zed Attack Proxy (ZAP) Project Leader and a Distinguished Engineer at StackHawk, a company that uses ZAP to help users fix application security bugs before they hit production.<br/>He has talked about and demonstrated ZAP at conferences all over the world, including Blackhat, JavaOne, FOSDEM and OWASP AppSec EU, USA &amp; AsiaPac.<br/>Prior to making the move into security he was a developer for 25 years and strongly believes that you cannot build secure web applications without knowing how to attack them.</p> "}]