[{"chapter": "Las Vegas", "repo": "www-chapter-las-vegas", "name": "OWASP: CMD + CTRL Event! ", "date": "2020-08-26", "time": "18:00", "link": "https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/272172954/", "timezone": "US/Pacific", "description": "<p>CMD+CTRL Cyber Range was a hit from our last year's event (<a href=\"https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/263621436/\" class=\"linkified\">https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/263621436/</a>) so we are doing this again!</p> <p>OWASP Las Vegas and Security Innovation invite members to compete in the CMD+CTRL Cyber Range - intentionally vulnerable applications and websites that teach how to think like an attacker. Players have fun exploiting their way through hundreds of vulnerabilities while scoring points and moving up the leaderboard. Score at least 1,000 points, and you qualify for the gift raffle!</p> <p>Want to start early? Prepare with courses, resources, success stories and a different<br/>cyber range on Security Innovation’s Community Site.<br/>Newbies - Join us to see how many vulnerabilities you can identify<br/>Veterans - Come back to Shadow Bank and see what you missed</p> <p>Register early to reserve your spot and get a sneak peek at our cheat sheets and FAQs! <a href=\"https://web.securityinnovation.com/owasp-las-vegas\" class=\"linkified\">https://web.securityinnovation.com/owasp-las-vegas</a></p> "}, {"chapter": "Ottawa", "repo": "www-chapter-ottawa", "name": "OWASP Ottawa August 2020 Meetup", "date": "2020-08-17", "time": "12:00", "link": "https://www.meetup.com/OWASP-Ottawa/events/272355636/", "timezone": "Canada/Eastern", "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p><a href=\"https://www.youtube.com/watch?v=tX9RHZ_O5NU\" class=\"embedded\">https://www.youtube.com/watch?v=tX9RHZ_O5NU</a></p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p>12:00 EDT PM: Technical Talks</p> <p>1. Announcements</p> <p>2. OWASP DevSecOps Maturity Model</p> <p>From a startup to a multinational corporation the software development industry is currently dominated by agile frameworks and product teams and as part of it DevOps strategies.</p> <p>It has been observed that during implementation, security aspects can be missed. The OWASP DevSecOps Maturity Model, which is presented in the talk, shows security measures which are applied when using DevOps strategies and how these can be prioritized. With the help of DevOps strategies security can also be enhanced. Under the guidance of the forward-looking DevSecOps Maturity Model, appropriate principles and measures can defend against attacks.</p> <p>In this session Timo will give an introduction and answer questions like when to use OWASP SAM and when and how to use DSOMM.</p> <p>OUR SPEAKER: Timo Pagel, DevSecOps Consultant</p> <p>Timo has been in the IT industry for over fifteen years. After being a system administrator and web developer in his early times, he became involved in OWASP. He now advises his clients on DevOps security, either hands on or as a trainer, with the focus on security test automation for software and infrastructure.</p> "}, {"chapter": "Uruguay", "repo": "www-chapter-uruguay", "name": "AppSec Days - Summer of Security", "date": "2020-08-25", "time": "13:00", "link": "https://www.meetup.com/OWASP-Uruguay-Chapter/events/271426480/", "timezone": "America/Montevideo", "description": "<p>OWASP Foundation estará realizando una nueva serie de eventos internacionales virtuales en el que los participantes podrán anotarse y realizar un nuevo training. Tener en cuenta que estos training son pagos, se realizarán todos a la misma vez (solo se podrá realizar uno de ellos en cada evento) y se dictan en Inglés.</p> <p>Los links a la página de cada evento son:<br/>- Junio (23-24): <a href=\"https://june.appsecdays.org/\" class=\"linkified\">https://june.appsecdays.org/</a><br/>- Julio (28-29): <a href=\"https://july.appsecdays.org/\" class=\"linkified\">https://july.appsecdays.org/</a><br/>- Agosto (25-26): <a href=\"https://august.appsecdays.org/\" class=\"linkified\">https://august.appsecdays.org/</a></p> "}, {"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "DevSecBots: Bot the Gap", "date": "2020-08-26", "time": "20:00", "link": "https://www.meetup.com/SGSecurityMG/events/272160770/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "South Florida", "repo": "www-chapter-south-florida", "name": "OWASP South Florida Chapter Meeting August 2020 - Talk + Discussion + Networking", "date": "2020-08-19", "time": "18:00", "link": "https://www.meetup.com/South-Florida-OWASP-Chapter/events/272505087/", "timezone": "US/Eastern", "description": "<p>IMPORTANT NOTE: Due to ongoing public health concerns related to COVID-19, we will be hosting this meeting virtually via zoom. You'll get the meeting URL when you RSVP. Any update will be communicated before the meeting.</p> <p>***Talk***<br/>Title: Detect complex code patterns using semantic grep</p> <p>Speaker: Grayson Hardaway</p> <p>Abstract: We’ll discuss a program analysis tool we’re developing called Semgrep (<a href=\"https://github.com/returntocorp/semgrep\" class=\"linkified\">https://github.com/returntocorp/semgrep</a>). It's a multilingual semantic tool for writing security and correctness queries on source code (for Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle (<a href=\"http://coccinelle.lip6.fr/\" class=\"linkified\">http://coccinelle.lip6.fr/</a>), for Linux kernel refactoring, and later developed Semgrep while at Facebook. He’s now full time with us at r2c (<a href=\"https://r2c.dev/\" class=\"linkified\">https://r2c.dev/</a>).</p> <p>Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.</p> <p>For example, find subprocess calls with shell=True in Python using the query:<br/>subprocess.open(..., shell=True)<br/>This will even find snippets like:<br/>import subprocess as s<br/>s.open(f'rm {args}', shell=True)</p> <p>Or find hardcoded credentials using the query:<br/>boto3.client(..., aws_secret_access_key=”...”, aws_access_key_id=”...” )</p> <p>Source code: <a href=\"https://github.com/returntocorp/semgrep\" class=\"linkified\">https://github.com/returntocorp/semgrep</a><br/>Test in your browser: <a href=\"https://semgrep.dev/\" class=\"linkified\">https://semgrep.dev/</a></p> <p>Speaker's Bio: Grayson Hardaway is a security researcher at r2c, a startup working on static analysis tools purpose-built for the modern workflow. At r2c, Grayson authors static analysis tailored for finding security vulnerabilities in open source code. Previously, Grayson worked for the US Department of Defense fuzzing and exploiting obscure protocols. When not submitting patches, Grayson is hefting a heavy pack uphill, crafting guitar solos, or learning something new: currently woodworking.</p> <p>***Networking Session***<br/>After the talk, OWASP chapter members and interested parties can linger for virtual networking.... to catch up on recent COVID-19-related issues, working-from-home experiences, job situations, our next meeting date, etc.</p> "}, {"chapter": "Northern Virginia", "repo": "www-chapter-northern-virginia", "name": "AppSec, DevSecOps, and IoT - Oh My!", "date": "2020-08-20", "time": "18:30", "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/272348331/", "timezone": "US/Eastern", "description": "<p>Abstract: It doesn't take much to realize that the world of IoT has exploded. How many now have a Ring doorbell and are using Alexa to control their homes? Sensors, indicators and trackers are everywhere and many times we are not even aware of it. But in a world where there is an ever-increasing threat landscape and more attacks then ever, where does security fit in? How do we balance convenience, speed and data integrity? And when we realize that behind every device is an application that will process that data and then communicate to another application, how do we ensure that those applications are secure? This is why Application Security and DevSecOps are so important in this space and make all the difference between success and failure.</p> <p>Bio: Rob is currently a Global Application Security Sales Evangelist for HCL providing thought leadership for the application security space, particularly as it relates to DevOps and DevSecOps initiatives. Prior to this role, Rob was with IBM for 14 years with roles in Application Security Evangelism, Worldwide Sales Enablement, Tiger Teams and Field Services for the Management and Platform Segment offerings in IBM Cloud. Rob has worked with clients all over the world to help address their challenges in ways that bring a positive impact to the business bottom line. Rob has spoken at numerous events and conferences, including Evanta CISO Summits, THINK, InterConnect, DevloperConnect, IBM Top Guns and many customer events. Prior to IBM, Rob spent 13 years with 5 different companies working as a configuration management specialist with an emphasis on Rational tooling. Rob graduated from the University of Southern California with a degree in Aerospace Engineering and is an avid fan of college football. When not at work, Rob enjoys spending time with his family, serving with his church, running and cycling. You can connect with Rob via LinkedIn, Facebook and Instagram but the best way is by joining the “Robservatory” on twitter using the handle @Robservatory.</p> "}, {"chapter": "Oklahoma City", "repo": "www-chapter-oklahoma-city", "name": "Test your skills on the CMD+CTRL Cyber Range", "date": "2020-08-27", "time": "16:00", "link": "https://www.meetup.com/Oklahoma-City-Chapter-Meetup/events/272195625/", "timezone": "US/Central", "description": "<p>Join your friends in the OWASP Oklahoma City chapter for a unique and challenging event featuring the CMD+CTRL Cyber Range on Thursday, August 27th starting at 4:00pm CT.</p> <p>What is a Cyber Range?<br/>CMD+CTRL Cyber Ranges are intentionally vulnerable applications and websites that tempt players to steal money, view their boss’s salary, buy expensive items for free, and conduct other nefarious acts. Hundreds of vulnerabilities, common to most business applications, lay waiting.</p> <p>For each vulnerability you find, you’ll get points added to your score and climb the live leaderboard. Top scorers get prizes, but all players have fun!</p> <p>Worried you won’t know what to do?<br/>Don’t worry. We’ll provide cheatsheets and tips to get you quickly ramped up.</p> <p>Register online at: <a href=\"https://web.securityinnovation.com/owasp-okc\" class=\"linkified\">https://web.securityinnovation.com/owasp-okc</a></p> "}, {"chapter": "Bay Area", "repo": "www-chapter-bay-area", "name": "Hacker Days: Kubernetes Security: From Control Plane to Layer 7", "date": "2020-08-20", "time": "11:00", "link": "https://www.meetup.com/Bay-Area-OWASP/events/272516000/", "timezone": "US/Pacific", "description": "<p>Kubernetes infrastructure dominates the container orchestration market. Despite its popularity, 43% of engineers say security challenges block Kubernetes adoption. Engineers embrace Kubernetes for its agility and scalability, but with speed comes inherent security risks. It’s critical to secure each layer of infrastructure, from the control plane to layer 7, in order to isolate threats and prevent further damage. Join our next discussion with Jimmy Mesta of Signal Sciences to learn a defense-in-depth approach when securing containerized apps. DevOps professionals will learn to mitigate security pitfalls like permissions mistakes, misconfigurations, or infrastructure blindspots.</p> <p>Speaker details:- Jimmy Mesta is a veteran DevOps leader with 15+ years of experience. He is the Head of Security Research at Signal Sciences, a web application security company based in Los Angeles. Jimmy has spent time on both the offensive and defensive side of the industry, working to build modern, developer-friendly security solutions. He previously ran the local Santa Barbara OWASP chapter and taught Kubernetes, Docker, DevOps, mobile security, and pentesting courses for Manicode.</p> "}, {"chapter": "Bay Area", "repo": "www-chapter-bay-area", "name": "Hacker Days: How I created my own clone (from Blackhat)", "date": "2020-08-13", "time": "11:00", "link": "https://www.meetup.com/Bay-Area-OWASP/events/272435206/", "timezone": "US/Pacific", "description": "<p>This talk is inspired by an episode of Black Mirror. I will be demonstrating a live demo creating a bot who talks like me and can be used to impersonate me online and do social engineering. I will be showing a live demo of how to create such bots over text, voice or video and walk through various techniques which the attendees can use to create such smart social engineering attacks.<br/>Github link:- <a href=\"https://github.com/titanlambda/identity-cloning\" class=\"linkified\">https://github.com/titanlambda/identity-cloning</a></p> <p>Speaker details:-<br/>Tamaghna Basu, OSCP, GCIH, RHCE, CEH, ECSA, co-founder/CTO of neoEYED Inc. He has 15+ years of experience in cyber security domain. He is a mentor for Stanford Cyber Security Course and SANS certified mentor for the course – \"Sec 504: Hacker Techniques, Exploits and Incident Handling\". His main areas of research include AI/ML, Web app security and network pen-testing, exploit development, incident handling and cyber forensic. Being a software developer earlier, he worked in java, .net, ruby etc. and various domains like finance, insurance, gaming etc. He has won multiple hacking challenges and hackathons in the industry around the world from MasterCard, IBM, PwC, InMobi, NULLCON and more etc. He also presented in other security conferences like NULLCON, C0C0N, OWASP, ISACA etc. Tamaghna is one of the core members of NULL security community, he facilitates Chennai/Bangalore NULL Chapter, a frequent speaker of NULL and OWASP meets, conducted multiple hacking workshops in NULL HUMLA, Bangalore. He is an active member of security communities like honeynet, NAISG, DSCI, Clubhack etc. He also contributed to security magazines like Clubhack and ISACA journal. He has achieved various other certifications like Cyber Crime Investigation, Diploma in Cyber Law etc.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2020-08-27", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqybclbkc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP Meetup - IAST & OSA", "date": "2020-08-27", "time": "19:00", "link": "https://www.meetup.com/OWASP-STL/events/268671057/", "timezone": "US/Central", "description": ""}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "August Virtual Chapter Meeting", "date": "2020-08-27", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/272254724/", "timezone": "US/Mountain", "description": "<p>This month's meetup will be VIRTUAL, given current state of social distancing. Please join Wasatch AppSec Slack and suggest any additional topics.</p> <p>Thanks to Hirevue (and Jake Schroeder) for providing the Zoom session.</p> <p>Agenda:<br/>12-12:45pm<br/>Open Topics (TBD)<br/>12:45-1pm<br/>Open Forum, Admin Items</p> <p>-----<br/>Jake Schroeder is inviting you to a scheduled Zoom meeting.<br/>Topic: Wasatch AppSec Meetup<br/>Time: Aug 27, 2020 12:00 PM Mountain Time (US and Canada)<br/>Join Zoom Meeting<br/><a href=\"https://hirevue.zoom.us/j/97102626886?pwd=U1RVd25rUlBWVVptTVRPNTRLUnVKUT09\" class=\"linkified\">https://hirevue.zoom.us/j/97102626886?pwd=U1RVd25rUlBWVVptTVRPNTRLUnVKUT09</a><br/>Meeting ID: 971 0262 6886<br/>Passcode: 808939<br/>One tap mobile<br/>+16699006833,,97102626886#,,,,,,0#,,808939# US (San Jose)<br/>+12532158782,,97102626886#,,,,,,0#,,808939# US (Tacoma)<br/>Dial by your location<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 646 876 9923 US (New York)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>Meeting ID: 971 0262 6886<br/>Passcode: 808939<br/>Find your local number: <a href=\"https://hirevue.zoom.us/u/agbmrQNRl\" class=\"linkified\">https://hirevue.zoom.us/u/agbmrQNRl</a><br/>Join by SIP<br/>97102626886@zoomcrc.com<br/>Join by H.323<br/>162.255.37.11 (US West)<br/>162.255.36.11 (US East)<br/>115.114.131.7 (India Mumbai)<br/>115.114.115.7 (India Hyderabad)<br/>213.19.144.110 (EMEA)<br/>103.122.166.55 (Australia)<br/>64.211.144.160 (Brazil)<br/>69.174.57.160 (Canada)<br/>207.226.132.110 (Japan)<br/>Meeting ID: 971 0262 6886<br/>Passcode: 808939</p> "}]