[{"chapter": "Ottawa", "repo": "www-chapter-ottawa", "name": "OWASP Ottawa: Introduction to OWASP ZAP Scripting", "date": "2021-03-25", "time": "12:00", "link": "https://www.meetup.com/OWASP-Ottawa/events/276862835/", "timezone": "Canada/Eastern", "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p><a href=\"https://www.youtube.com/watch?v=sB_nAx5Cm90\" class=\"embedded\">https://www.youtube.com/watch?v=sB_nAx5Cm90</a></p> <p>7:00 EDT PM: Technical Talks</p> <p>1. Announcements</p> <p>2. Introduction to OWASP ZAP Scripting</p> <p>Abstract:<br/>1 hour presentation about incoming course on OWASP ZAP. In this session we are going to talk about:<br/>- OWASP ZAP project overview<br/>- OWASP ZAP features<br/>- Compare OWASP ZAP with other tools<br/>- OWASP ZAP Advantages<br/>- Introducing the incoming workshop and importance of OWASP ZAP scripting</p> <p>Bio:<br/>Ali Abdollahi is a technologist with 9 years of experience working in a variety of fields. Ali is a full-time consultant helping clients with product testing, reverse engineering, penetration testing, exploit developing, red-teaming, secure coding, and more, giving him ample opportunity to use his skills in a diversity of ways. In addition, He is an instructor, author and board of review at Hakin9 company. Ali is a self-confessed bug hunter, publisher of many vulnerabilities and CVEs. Ali is a regular speaker and trainer at industry conferences like: DEFCON (Aerospace, Red Team and AppSec villages), OWASP AppSec Days, c0c0n XII, Confidence Conference 2020, BSides Budapest, BSides Toronto, Texas Cyber Summit, TyphoonCon (SSD Secure Disclosure), YASCon, NoNameCon 20, COUNTERMEASURE|2020, DragonCon, etc…</p> "}, {"chapter": "Jakarta", "repo": "www-chapter-jakarta", "name": "Getting API security right", "date": "2021-03-27", "time": "14:00", "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/276846828/", "timezone": "Asia/Jakarta", "description": "<p>Title :</p> <p>Getting API security right</p> <p>Long Abstract</p> <p>The shift towards an API landscape indicates a significant evolution in the way we build applications. The rise of JavaScript and mobile applications have sparked an explosion of easily-accessible REST APIs. But does the rise of APIs result in the downfall of security? Why are there so many vulnerabilities and incidents involving APIs? How can you ensure that your APIs are secure?</p> <p> </p> <p>In this session, we use real-world cases to dive into best practices for securing your APIs. We discuss the attack surface of an API, common authorization problems, and best practice techniques to avoid these problems. At the end of this session, you will have an actionable set of guidelines to assess and improve the security of your own APIs.</p> <p>Name and title</p> <p>Dr. Philippe De Ryck</p> <p>Web Security Expert, Founder of Pragmatic Web Security</p> <p>Bio</p> <p>Philippe De Ryck helps developers protect companies through better web security. His Ph.D. in web security from KU Leuven lies at the basis of his exceptional knowledge of the security landscape. As the founder of Pragmatic Web Security, Philippe delivers security training and security consulting to companies worldwide. His online course platform allows anyone to learn complex security topics at their own pace. Philippe is a Google Developer Expert and an Auth0 Ambassador/Expert for his community contributions on the security of web applications and APIs.</p> <p>Social media profiles</p> <p>Twitter: <a href=\"https://twitter.com/PhilippeDeRyck\" class=\"linkified\">https://twitter.com/PhilippeDeRyck</a></p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/PhilippeDeRyck/\" class=\"linkified\">https://www.linkedin.com/in/PhilippeDeRyck/</a></p> <p>Github: <a href=\"https://github.com/philippederyck/\" class=\"linkified\">https://github.com/philippederyck/</a></p> <p>join by zoom</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/97993014788?pwd=UkI3bDRDRkNTd2hDeGpna1hNR3I4dz09\" class=\"linkified\">https://zoom.us/j/97993014788?pwd=UkI3bDRDRkNTd2hDeGpna1hNR3I4dz09</a></p> <p>Meeting ID: 979 9301 4788<br/>Passcode: owaspjkt21</p> "}, {"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "DISCOUNT PHISH BURN BETTER and  USER MODE API HOOKS AND BYPASSES", "date": "2021-03-25", "time": "20:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/276419652/", "timezone": "Europe/Copenhagen", "description": "<p>Note: THIS IS AN ONLINE EVENT! Link to stream will be released here prior to the event.</p> <p>THE SPEAKER</p> <p>Magnus Stubman, Security Advisor at Improsec and former security consultant at F-Secure and Zacco.<br/><a href=\"https://www.linkedin.com/in/magnusstubman/\" class=\"linkified\">https://www.linkedin.com/in/magnusstubman/</a></p> <p>Magnus started his career as a software developer and later turned his attention to Cyber Security, specifically attack and penetration testing, both digital and physical. Today Magnus specialize in Red Teaming.</p> <p>Magnus will do something we haven't facilited in OWASP CPH before - He will do a double-presentation - to take you on a technical security ride.. Keep reading to learn more...</p> <p>THE TALKS</p> <p>TALK 1 : DISCOUNT PHISH BURN BETTER</p> <p>- Did my e-mail provider detect my malicious intent?</p> <p>- Was there an e-mail gateway that saw my malware?</p> <p>- Did it land in the junk/spam folder?</p> <p>- Has the victim even seen it or read it yet?</p> <p>- Did he/she click the link or did it seem suspicious?</p> <p>- Did the malware download properly?</p> <p>- Was it analysed in a sandbox?</p> <p>- Did the Anti-Virus detect it? What about EDR?</p> <p>- Maybe the SOC is torturing my malware in a lab environment right now?</p> <p>- Maybe it executed fine, but just stopped working due to a bug?</p> <p>- Was the outbound C2 traffic blocked or even worse, detected?</p> <p>Have you ever asked yourself one of the above questions, or just wonder how life is as an attacker seeking to conduct a successful (spear) phishing campaign? \"Discount Phish Burn Better\" is a talk about how an attacker can improve his odds of successfully phishing a victim by reducing the cost of payload/malware development.</p> <p>TALK 2 : USER MODE API HOOKS AND BYPASSES</p> <p>- Can I upload my tools to the compromised workstation without being detected or do I have to stay in-memory?</p> <p>- Will the EDR detect if I use process injection to migrate to e.g. explorer.exe?</p> <p>- Can I dump LSASS and steal NTLM hashes?</p> <p>- Can I backdoor an application, e.g. Citrix Receiver to escalate privileges when another user logs in?</p> <p> <br/>On-host security products such as Anti-Virus (AV) and Endpoint Detection and Response (EDR) products aim to have sufficient surveillance of the host to ensure that attackers can't operate without being detected. One of the techniques such products use is known as Win32 API hooking in user mode. However, as the user-mode component of APIs are loaded and owned by the current process, the process itself can inspect, overwrite or simply just not use them and use its own implementation of the API functionality, to avoid messing with the hooks altogether. This talk will give an introduction to Win32 APIs, modules, API hooks and different bypass techniques that may be essential to avoiding detection.</p> <p>WHO CAN PARTICIPATE?<br/>The event is open for everyone - but it is highly technical.</p> <p>Photo: Blake Connally, Unsplash.com</p> "}, {"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "Workshop: Elastic SIEM (4 hr) ", "date": "2021-03-20", "time": "12:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/276244555/", "timezone": "Europe/Copenhagen", "description": "<p>This time around OWASP Copenhagen will host a free 4hr workshop on Elastic SIEM courtesy of David Thejl-Clayton - SOC leader of JN Data.</p> <p>The workshop is designed to get you started using it and provide you with hands-on experience with that along with MISP and TheHive, two accompaning tools which, just as Elastic, are free to use.</p> <p>Everything will be held virtually. We will provide each student with their own virtual environment. Due to practical reasons we have limited seats to this so sign up before it's too late!</p> <p>We will include a high-level description of the workshop later.</p> "}, {"chapter": "Santa Barbara", "repo": "www-chapter-santa-barbara", "name": "Eradicate Vulnerability Classes with Secure Defaults + Lightweight Enforcement", "date": "2021-03-30", "time": "17:45", "link": "https://www.meetup.com/Santa-Barbara-OWASP-Chapter/events/276857915/", "timezone": "US/Pacific", "description": "<p>NOTE: You need to RSVP in order to get the link the day of the event.</p> <p>### Event Agenda (PST timezone) ###<br/>05.45 pm -- Event Kickoff &amp; Announcements, by Walter Martín Villalba, OWASP SB Leader -- <a href=\"https://twitter.com/act1vand0\" class=\"linkified\">https://twitter.com/act1vand0</a><br/>06.00 pm -- Presentation: Eradicate Vulnerability Classes with Secure Defaults + Lightweight Enforcement, by Clint Gibler -- <a href=\"https://twitter.com/clintgibler\" class=\"linkified\">https://twitter.com/clintgibler</a><br/>07.00 pm -- Closing Remarks</p> <p>### Abstract ###<br/>We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time.</p> <p>Rather than investing in finding more bugs, many modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks can enable organizations to solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole.</p> <p>In this talk, we’ll present a practical step-by-step methodology for:<br/>Choosing what to focus your AppSec resources on<br/>How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes<br/>How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers<br/>How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company</p> <p>### Bio###<br/>Clint Gibler (@clintgibler) is the Head of Security Research for r2c, a startup working on giving security tools directly to developers. Previously, Clint was a Research Director at NCC Group, a global security consulting firm, where he helped companies implement security automation and DevSecOps best practices as well as performed penetration tests for companies ranging from large enterprises to new startups. Clint has previously spoken at conferences including BlackHat USA, AppSec USA/EU/Cali, BSidesSF, and many DevSecCons. Clint holds a Ph.D. in Computer Science from the University of California, Davis. Want to keep up with security research? Check out *tl;dr sec*, Clint’s newsletter that contains summaries of artisanally curated, top talks and useful security links and resources from around the web. <a href=\"https://tldrsec.com/\" class=\"linkified\">https://tldrsec.com/</a></p> "}, {"chapter": "Northern Virginia", "repo": "www-chapter-northern-virginia", "name": "Limiting Supply Chain Risk with Dependency-Track ", "date": "2021-03-18", "time": "18:30", "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/276682068/", "timezone": "US/Eastern", "description": "<p>Abstract:<br/>Dependency-Track is an intelligent Component Analysis platform that allows organizations to identify and reduce risk in the software supply chain. Dependency-Track takes a unique and highly beneficial approach by leveraging the capabilities of Software Bill of Materials (SBOM). This approach provides capabilities that traditional Software Composition Analysis (SCA) solutions cannot achieve.</p> <p>Discover the benefits of leveraging CycloneDX Software Bill of Materials along with OWASP Dependency-Track to identyify risk across a wider range of use cases.</p> <p>About Steve Springett:<br/>Steve educates teams on the strategy and specifics of developing secure software.</p> <p>He practices security at every stage of the development lifecycle by leading sessions on threat modeling, secure architecture and design, static/dynamic/component analysis, offensive research, and defensive programming techniques.</p> <p>Steve's passionate about helping organizations identify and reduce risk from the use of third-party and open source components. He is an open source advocate and leads the OWASP Dependency-Track project, OWASP Software Component Verification Standard (SCVS) project, CycloneDX software bill of material standard, and participates in several related projects and working groups.</p> "}, {"chapter": "Austin", "repo": "www-chapter-austin", "name": "OWASP Austin Chapter Monthly Meeting - March 2021", "date": "2021-03-30", "time": "11:45", "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/276781839/", "timezone": "US/Central", "description": "<p>Chapter information and a presentation --</p> <p>Successful Customer Engagements using the OWASP Mobile Application Security Verification Standard</p> <p>Abstract:</p> <p>The team will be discussing Mobile Application Penetration Testing from the perspectives of original scoping and testing using OWASP’s Mobile Application Security Verification Standard including the various tools and resources available on both Android and IOS. We will be discussing not just the OWASP standard, but also give advice on lessons learned through our engagements highlighting several key issues and obstacles to consider for ensuring a successful experience for both the customer and your team.</p> <p>Speakers:</p> <p>-Mark Spears, Solis Security - Sr. Security Consultant &amp; Red Team Lead<br/>-Sam Danna, Solis Security - Security Consultant<br/>-Jon Adderholt, Solis Security - Security Consultant<br/>-Angela Lane, Solis Security – Project Manager</p> <p>Bio:<br/>Mark, Sam, and Jon comprise the Offensive Security Operations (aka Red Team) at Solis Security performing all sorts of engagements including Network, Web Application (+Mobile, APIs, and etc), Spearphishing, Wifi, Hardware Hacking, and more.</p> "}, {"chapter": "Cleveland", "repo": "www-chapter-cleveland", "name": "OWASP Cleveland Chapter - March Meeting", "date": "2021-03-26", "time": "18:30", "link": "https://www.meetup.com/owasp-cleveland-group/events/276777304/", "timezone": "US/Eastern", "description": "<p>Join the OWASP Cleveland Chapter for our March 2021 meeting where we will review the t-shirt design contest, expand on the OWASP Top 10, Zed Attack Proxy ZAP, Honeypots, and more.</p> "}, {"chapter": "Columbus", "repo": "www-chapter-columbus", "name": "Lessons learned from recent Supply Chain attacks", "date": "2021-03-25", "time": "12:00", "link": "https://www.meetup.com/Columbus-OWASP/events/276714213/", "timezone": "US/Eastern", "description": "<p>Hi everyone! We will start out with news and notes (virtually) and then talk about the Software Supply Chain.</p> <p>Description: Overview of lessons learned and key takeaways from recent Supply Chain attacks. Key takeaways:<br/>- Multiple vulnerabilities in target infrastructures can lead to build pipeline compromise<br/>- Potentially detailed internal working knowledge can be leveraged<br/>- Care was taken to avoid potential warnings and build failures<br/>- Unintended functionality deployed as part of signed update<br/>- Similar common weaknesses in typical information security blocking and tackling at victim sites were exploited to avoid detection<br/>- In all, there is no preventative or detective control domain within the Cyber Security realm that is unaffected by overall failures or weaknesses as part of an attack of this nature, from legal frameworks to advanced threat detection.</p> <p>Bio:<br/>Michael Fabian<br/>- Principal Consultant in Atlanta, GA<br/>- BS – Political Science<br/>- MS – information Systems – Information Security<br/>- MS – Systems Engineering<br/>Prior to Synopsys<br/>- 20 Years professional experience<br/>- 11 years in non-IT Systems Security<br/>- Experience from end user analysis to vendor product design<br/>- Industry Participation – From Medical Devices to Weapon Systems<br/>- Smart Grid Working Group (SGIP)<br/>- IEC/ISA TC65 – IEC 62443</p> "}, {"chapter": "Dallas", "repo": "www-chapter-dallas", "name": "OWASP Dallas March Meeting", "date": "2021-03-23", "time": "12:00", "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/276136637/", "timezone": "US/Central", "description": "<p>Title:</p> <p>Penetration Test at Scale: A Data-focused Approach</p> <p>Description:</p> <p>Managing a global application penetration testing program across the Enterprise poses operational challenges. Extracting and leverage meaningful data can minimize those challenges. We’ll look at some key components to consider for a successful program.</p> <p>Bio:</p> <p>Phillip Pham is an experienced cybersecurity professional with more than a decade of experience​ working in Big Four Consulting​, healthcare, financial​, and online services​ industries. Phillip has led offensive security programs and large-scale pen test engagements​. He is an Offensive Security Certified Professional (OSCP)​ and a SANS AppSec Fighter contributor​ (LinkedIn open-redirect disclosure​; DOM-based XSS in the wild).</p> "}, {"chapter": "Kansas City", "repo": "www-chapter-kansas-city", "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting", "date": "2021-03-22", "time": "18:30", "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccfbdc/", "timezone": "US/Central", "description": "<p>Hello, all!</p> <p>Spring 2021 and COVID vaccines are finally here, and we need to figure out what the future of OWASP-KC looks like. This meeting will be a general social and planning virtual meetup to try to get some idea of where things stand going forward. If you are new to to the group and want to know what's up, or if you've been around for a while and want to help plan for our next chapter, please join us!</p> "}, {"chapter": "New York City", "repo": "www-chapter-new-york-city", "name": "Do certain types of developers or teams write more secure code? by Anita D'Amico", "date": "2021-04-08", "time": "19:00", "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/276109825/", "timezone": "US/Eastern", "description": "<p>Abstract: Why do some developers and development teams write more secure code than others? How do we account for the “human factors” that contribute to vulnerable software? This talk will describe several human factors—developer, team and environmental characteristics—that influence whether developers will inadvertently introduce security weaknesses into their code. I will present the results of research on how factors such as developer experience, disrupted attention, team size, team co-location, communication, work hours, and code rewrites affect software security. The research results are drawn from DoD-funded R&amp;D and academic research conducted on the software engineering practices used to develop both open-source and proprietary software.</p> <p>Speaker Bio: Anita D’Amico, PhD is CEO of Code Dx, Inc. which provides Application Security Orchestration and Correlation solutions to industry and government, and supports two OWASP projects, Code Pulse and Attack Surface Detector. Her roots are in experimental psychology and human factors, and she has built a career of leading technology development to enhance human performance. Her attention is now focused on enhancing the decisions and work processes of software developers and AppSec analysts to make code more secure. A 2016 Forbes article named Anita as one of “five cool women in security” who serve as role models for young women entering the field. More recently, Anita was named as one of “100 Fascinating Females Fighting Cybercrime” in the 2019 book “Women Know Cyber.”</p> "}, {"chapter": "New York City", "repo": "www-chapter-new-york-city", "name": "“Is blockchain really secure??” by Shrutirupa Banerjiee", "date": "2021-03-20", "time": "12:30", "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/276820584/", "timezone": "US/Eastern", "description": "<p>Abstract:</p> <p>There is a lot of confusion related to blockchain and its security, and we can never ignore that. In this session, we will understand the basics of blockchain so that the security aspect of the same can be clarified. We will also go through some real-life attack scenarios.<br/>The only pre-requisite for the session is:<br/>The willingness to learn something interesting</p> <p>Bio:</p> <p>I am Shrutirupa Banerjiee (@freak_crypt). I have been in the field of security for over 2 and a half years. I am having experience in working on blockchain technologies and conducting security reviews for Web and mobile applications, and Ethereum based Smart Contracts in my previous role as an Information Security Consultant and research intern. Currently, I am independently researching on Ethereum Based Smart Contracts alongside working as a Web Application Security Analyst with the WAF Research team at Qualys. I am also the Pune Chapter Lead for the Infosecgirls community. I have also been a speaker at conferences such as Owasp Seasides 2019-2020, Bsides Singapore 2019, Rootconf 2019, Webinars, Cyberfrat, and Null Meets.</p> "}, {"chapter": "Orange County", "repo": "www-chapter-orange-county", "name": "Virtual Meeting: Kubernetes Security 101: Best Practices to Secure your Cluster", "date": "2021-03-25", "time": "17:30", "link": "https://www.meetup.com/OWASP-OC/events/276858588/", "timezone": "US/Pacific", "description": "<p>Speaker: Magno Logan, Information Security Specialist, Trend Micro</p> <p>Topic: Kubernetes Security 101: Best Practices to Secure your Cluster</p> <p>Abstract:<br/>This talk aims to give an overview about how Kubernetes works and provide some best practices to secure your cluster whenever you are deploying a new cluster on your own or via managed services such as GKE, EKS or AKS. We are going to cover everything from the Control Plane or the Master Node, starting with the API server, including etcd, RBAC and network policies. Then, we’ll cover the worker nodes, kubelet, audit logs and pods best practices. We'll talk about the CIS Benchmarks for Kubernetes and the default configurations you need to worry about when deploying a new cluster. We'll show how to use RBAC and assign roles and permissions to your cluster users. We'll demonstrate how to enable audit logs for better visibility and later we'll set up some network policies to avoid communication between pods and prevent any lateral movement from attackers.</p> <p>Speaker Bio:<br/>Magno Logan works as an Information Security Specialist for Trend Micro. He specializes in Cloud, Container and Application Security Research, Threat Modelling and Red Teaming. He has been tapped as a resource speaker for numerous security conferences around the globe. He is also a member of the CNCF SIG-Security team.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/magnologan/\" class=\"linkified\">https://www.linkedin.com/in/magnologan/</a><br/>Twitter: <a href=\"https://twitter.com/magnologan\" class=\"linkified\">https://twitter.com/magnologan</a><br/>Github: <a href=\"https://github.com/magnologan\" class=\"linkified\">https://github.com/magnologan</a></p> <p>Schedule:<br/>5:30 pm: Introduction<br/>5:35 pm: Kubernetes Security 101: Best Practices to Secure your Cluster</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2021-03-25", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqyccfbhc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Sacramento", "repo": "www-chapter-sacramento", "name": "API Security - OWASP Sacramento March Meetup", "date": "2021-03-25", "time": "18:00", "link": "https://www.meetup.com/OWASP-Sacramento-Chapter/events/276905145/", "timezone": "US/Pacific", "description": "<p>This month, we have Adam Fisher from SALT presenting on BOLA, IDOR, MA, BFLA. Welcome to the OWASP API Top 10!</p> <p>Adam Fisher is an Enterprise Security Expert whose qualifications include a Bachelor of Science in Information Systems, Master of Business in Information Technology Management, and maintains a number of certifications, CISSP, CCSP, AWS Security Associate, Azure MCP.</p> <p>PS: We have a surprise gift card for all of the attendees. Be sure to join on time!</p> <p>Agenda:<br/>- Community Topics<br/>- Search for a co-chapter-lead<br/>- Main Topic: BOLA, IDOR, MA, BFLA. Welcome to the OWASP API Top 10!<br/>- Q/A</p> <p>For more information about OWASP, please visit our Wiki at <a href=\"https://owasp.org/www-chapter-sacramento/\" class=\"linkified\">https://owasp.org/www-chapter-sacramento/</a></p> "}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "March 2021 Chapter Meeting", "date": "2021-03-25", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/276763741/", "timezone": "US/Mountain", "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-nw4d0iq9-bBMKHrFITzJMMsDye6FNYg\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-nw4d0iq9-bBMKHrFITzJMMsDye6FNYg</a>) to suggest any additional topics.</p> <p>---------------------------------------------<br/>Agenda:<br/>12 - 12:50pm<br/>- Guest: Clint Gibler (@clintgibler), moderator of tldr;sec, will be joining us to talk about SemGrep</p> <p>Title: Semgrep: lightweight static analysis built for modern development</p> <p>Abstract: How we write software has changed, and many security tools have failed to keep up.</p> <p>This talk will introduce Semgrep, an open source, lightweight static analysis tool that’s fast (scans in minutes, not hours or days), easy to integrate into any CI system, and provides high signal results. Semgrep provides feedback wherever you want it - as GitHub PR comments, via Slack messages, or even in your IDE.</p> <p>We’ll provide an overview of how Semgrep works, how to roll it out to all of your repos in just a few minutes, and even how to write custom Semgrep rules unique to your company, without having to learn a painful DSL.</p> <p>12:50 - 1pm<br/>- Open Forum, Admin Items, Upcoming Events<br/>- Determine topic for next month<br/>---------------------------------------------</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC March 2021 Chapter Meeting<br/>Time: Mar 25, 2021 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/95489098638?pwd=cGVuWGJ1L0RrQ2RVbXZTOEx2V2lkUT09\" class=\"linkified\">https://zoom.us/j/95489098638?pwd=cGVuWGJ1L0RrQ2RVbXZTOEx2V2lkUT09</a></p> <p>Meeting ID: 954 8909 8638<br/>Passcode: 396952<br/>One tap mobile<br/>+16699006833,,95489098638# US (San Jose)<br/>+12532158782,,95489098638# US (Tacoma)</p> <p>Dial by your location<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 301 715 8592 US (Washington DC)<br/>+1 312 626 6799 US (Chicago)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 954 8909 8638<br/>Find your local number: <a href=\"https://zoom.us/u/aun59cFDS\" class=\"linkified\">https://zoom.us/u/aun59cFDS</a></p> "}, {"chapter": "San Diego", "repo": "www-chapter-san-diego", "name": "The (Cyber) Security Paradox", "date": "2021-04-15", "time": "18:00", "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccgbtb/", "timezone": "US/Pacific", "description": "<p>Speaker: Ashton Mozano</p> <p>Talk Description: Taking inspiration from Parrondo's Paradox, this talk discusses how operating on the verge of catastrophic failure in modern electronics creates the paradox that the more effort put into \"securing\" a system may in fact be making it more vulnerable.</p> <p>Bio: Ash started as a kid in the pre-WWW community as the SysOp and Co-SysOp of a few US and European popular cracking BBSes, took a break from coding in college to study molecular biology and work on the human genome project, studied international business management in Europe, practiced law as a private sector and government litigator in the US, and has tought at various universities. He has held leadership roles in the tech sector, but would frequently return back to his roots in being hands-on in making and breaking software systems for the private sector and a DoD civilian, contractor and Naval Officer.</p> "}, {"chapter": "San Diego", "repo": "www-chapter-san-diego", "name": "Monthly Meeting - John Althouse & JARM", "date": "2021-03-18", "time": "18:00", "link": "https://www.meetup.com/Open-Web-Application-Security-Project-San-Diego-OWASP-SD/events/bcnwbsyccfbxb/", "timezone": "US/Pacific", "description": "<p>Please join us with John Althouse who will be speaking on JARM and how it can be used to detect malicious attacker infrastructure across the internet.</p> <p><a href=\"https://engineering.salesforce.com/easily-identify-malicious-servers-on-the-internet-with-jarm-e095edac525a\" class=\"linkified\">https://engineering.salesforce.com/easily-identify-malicious-servers-on-the-internet-with-jarm-e095edac525a</a><br/><a href=\"https://github.com/salesforce/jarm\" class=\"linkified\">https://github.com/salesforce/jarm</a></p> "}, {"chapter": "Suffolk", "repo": "www-chapter-suffolk", "name": "[ONLINE]OWASP Suffolk Chapter - Security for Managers", "date": "2021-03-24", "time": "19:00", "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/276874058/", "timezone": "Europe/London", "description": "<p>AGENDA:<br/>* Introduction<br/>* Security for Managers<br/>* Networking<br/>* Open discussion<br/>* Virtual Beer</p> <p>\"Security For Managers\"’ is intended as a wake-up call for people who assume that IT security doesn’t apply to them or their company. Think of it as a visit from a consultant who spends a lot of time with you, and then says: ‘This is what you need to do’, and then doesn’t charge you a penny!</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and get a ticket to be admitted to the event by building security - your name will be checked against the guest list.<br/>Register to attend this event at OWASP Suffolk Chapter - Meetup - RSVP to attend</p> "}, {"chapter": "Bristol Uk", "repo": "www-chapter-bristol-uk", "name": "Virtual Discussion: Stopping injection vulnerabilities with is_literal()", "date": "2021-03-18", "time": "18:00", "link": "https://www.meetup.com/OWASP-Bristol/events/276564621/", "timezone": "Europe/London", "description": "<p>Programming languages would ideally stop us from making mistakes. The biggest mistakes lead to injection vulnerabilities, where safe strings (defined by the programmer), are mixed with unsafe values (e.g. from the user).</p> <p>The is_literal() check is an ongoing project by Craig Francis and Dan Ackroyd, building on Google’s Christoph Kern’s work, as a way to check if a variable (e.g. an SQL string) is safe, to make sure there are no mistakes.</p> <p>We will start the evening with a quick talk about the idea, and the justification for why this check needs to exist - also available at:</p> <p><a href=\"https://github.com/craigfrancis/php-is-literal-rfc/blob/main/justification.md\" class=\"linkified\">https://github.com/craigfrancis/php-is-literal-rfc/blob/main/justification.md</a></p> <p>Then we will discuss any issues you can find, as well as our plan on how to get this proposal added to the PHP language:</p> <p><a href=\"https://wiki.php.net/rfc/is_literal\" class=\"linkified\">https://wiki.php.net/rfc/is_literal</a></p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/93248737850?pwd=ZkN4ZnhnR0pISkhoNlMreWcwV0t0Zz09\" class=\"linkified\">https://zoom.us/j/93248737850?pwd=ZkN4ZnhnR0pISkhoNlMreWcwV0t0Zz09</a></p> <p>Meeting ID: 932 4873 7850<br/>Passcode: 338085<br/>One tap mobile<br/>+442080806592,,93248737850# United Kingdom<br/>+443300885830,,93248737850# United Kingdom</p> <p>Dial by your location<br/>+44 208 080 6592 United Kingdom<br/>+44 330 088 5830 United Kingdom<br/>+44 131 460 1196 United Kingdom<br/>+44 203 481 5237 United Kingdom<br/>+44 203 481 5240 United Kingdom<br/>+44 203 901 7895 United Kingdom<br/>+44 208 080 6591 United Kingdom<br/>Meeting ID: 932 4873 7850<br/>Find your local number: <a href=\"https://zoom.us/u/acGnAxw02x\" class=\"linkified\">https://zoom.us/u/acGnAxw02x</a></p> "}, {"chapter": "Aarhus", "repo": "www-chapter-aarhus", "name": "OWASP Aarhus Chapter Meeting - March - Online", "date": "2021-03-23", "time": "19:00", "link": "https://www.meetup.com/OWASP-Aarhus-Chapter/events/276962924/", "timezone": "Europe/Copenhagen", "description": "<p>19:00 - 19:15<br/>\"Welcome\"<br/>Thomas Ljungberg Kristensen - Co-Chapter Leader OWASP Aarhus<br/>Dennis Perto - Co-Chapter Leader OWASP Aarhus</p> <p>19:15 - 20:00<br/>\"System auditing – Helping or disrupting?\"<br/>Kenneth Waaben Nielsen, Technical Lead Auditor, JN Data</p> <p>About the presentation<br/>\"System auditing – Helping or disrupting?\"<br/>This talk goes a bit into the details and talks about how system audit can benefit companies in raising the level of security. What are 3 lines of defense and audit statements? Does audit help or is it just a disruptive task?</p> <p>About Kenneth<br/>Kenneth has worked as both internal and external system auditor for more than 13 years. He spends most of his free time learning various areas in IT security.</p> <p>20:00 - 20:45<br/>\"Old Pareto had a Chart: How to achieve 80% of Threat Modelling Benefits with 20% of the Effort\"<br/>Irene Michlin, Application Security practice lead at IBM</p> <p>About the presentation:<br/>The earlier in the lifecycle you pay attention to security, the better are the outcomes. Threat modelling is one of the best techniques for improving the security of your software. It is a structured method for identifying weaknesses on design level. However, it is often perceived by the organisations as too expensive to introduce, or too slow to fit modern lifecycles, be it Agile, Lean, or DevOps.</p> <p>This talk will show how to fit threat modelling in fast-paced software development, without requiring every developer to become an expert. The outcomes should be immediately applicable, hopefully empowering you to try it at work tomorrow.</p> <p>About Irene:<br/>Irene Michlin is a security consultant at IBM. Before going into application security consultancy, Irene worked as software engineer, architect, and technical lead at companies ranging from startups to corporate giants. Her professional interests include securing development life-cycles and architectures.</p> <p>20:45 - 21:00<br/>Goodbyes and plans going forward<br/>Thomas Ljungberg Kristensen - Co-Chapter Leader OWASP Aarhus<br/>Dennis Perto - Co-Chapter Leader OWASP Aarhus</p> "}, {"chapter": "Switzerland", "repo": "www-chapter-switzerland", "name": "OWASP DefectDojo - the Heart of your AppSec Automation", "date": "2021-04-14", "time": "18:00", "link": "https://www.meetup.com/OWASPSwitzerland/events/276343964/", "timezone": "Europe/Zurich", "description": "<p>OWASP Switzerland brings you another high profile talk directly from the source.</p> <p>Defect Dojo project leads Aaron Weaver and Matt Tesauro as well as contributor/moderator Fred Blaise will initiate us into the magic of Defect Dojo.</p> <p>Abstract<br/>You’re tasked with ‘doing AppSec’ for your company and you’ve got more apps and issues than you know how to deal with. How do you make sense of the different tools outputs for all your different apps? DefectDojo can be your one source of truth and become the heart of your AppSec automation program.</p> <p>DefectDojo grew out of a Product Security program 8 years ago and was created by AppSec people for AppSec people. In this talk, you’ll learn about DefectDojo and how to make the most of the many features it offers including its REST-based API. DefectDojo can be your one source of truth for discovered security vulnerabilities, report generation, aggregation of over 80 different security tools, inventory of applications, tracking testing efforts and metrics on the AppSec program. DefectDojo was the heart of an AppSec automation effort that saw an increase in assessments from 44 to 414 in two years. Don't you want 9.4 times more output from your AppSec program? It's time to ditch spreadsheets and get DefectDojo.</p> <p>You can find more about Defect Dojo on their website: <a href=\"https://www.defectdojo.org/\" class=\"linkified\">https://www.defectdojo.org/</a></p> <p>Our speakers for this talk are:<br/>- Matt Tesauro: Project Lead DefectDojo.<br/>- Aaron Weaver: Project Lead DefectDojo.<br/>- Fred Blaise: Moderator DefectDojo. As he lives in Switzerland, we can consider him the “local branch of DefectDojo” ;-)</p> "}, {"chapter": "Timisoara", "repo": "www-chapter-timisoara", "name": "OWASP Timisoara #18 - Security Automation, Code Patterns (Online)", "date": "2021-03-18", "time": "18:00", "link": "https://www.meetup.com/OWASP-Timisoara-Chapter/events/276604009/", "timezone": "Europe/Bucharest", "description": "<p>The next OWASP Timisoara Chapter Meeting will be online.</p> <p>&gt; Spring sessions - Theme: Security Automation &amp; Intelligence, Code Patters</p> <p>&gt; Schedule:<br/>Introduction, OWASP News &amp; Updates - Catalin Curelaru</p> <p>Surface Security - Security Intelligence Automation Platform - Teofil Cojocariu (Paddy Power Betfair)</p> <p>Detect complex code patterns using semantic grep - Bence Nagy (Semgrep)</p> <p>Time: 18:00 to 20:00</p> <p>&gt;&gt;Abstract - Surface Security:<br/>Our external attack surface is constantly growing, which gives external attackers the opportunity to continuously search for new attack vectors. In order to successfully respond to Security incidents we needed a centralized platform which aggregates all the data about our premises in a single place.</p> <p>Surface Security (Security Intelligence Automation Platform) is an internally built tool which assists our internal Security teams to gain a holistic view about our externally exposed assets. More than that, it facilitates faster incident response based on the information correlated by it. Surface started as a small project in which we tried to close the gaps identified in our security controls. The platform's core is built in Django which is a Python-based open-source framework which has a fast learning curve. Besides Django, we're using technologies like Ansible (automation), Dkron (fault-tolerant jobs), Elasticsearch (Security metrics storage) and Grafana (reporting). During the whole period it gained a lot of traction in our company determining people to contribute to its success by implementing and suggesting new features. We're currently utilizing it for reporting the Security gaps to other areas of key business areas and for Security controls like: monitoring our externally exposed assets, vulnerability management, security incidents, bug bounty reports and penetration testing.</p> <p>Bio:<br/>I'm focused on Application Security Engineering &amp; Penetration Testing combined with CAMS mindset (Culture, Automation, Measurement, Sharing - DevSecOps) and I reported security bugs to Google, Facebook, Uber, Bitdefender, ING Bank, Yahoo or other companies. One of the most interesting thing is that I built a platform \"Surface - Security Intelligence Automation Platform\" which is being used by more than 900 people in Paddy Power Betfair, Flutter and I was the Security SME for a Private Cloud based on OpenStack with environments as code.</p> <p>&gt;&gt;Abstract - Detect complex code patterns using semantic grep<br/>We’ll discuss a program analysis tool we’re developing called Semgrep. It's a multilingual semantic tool for writing security and correctness queries on source code (for Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle, for Linux kernel refactoring, and later developed Semgrep while at Facebook. He’s now full time with us at r2c. Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.<br/>For example, find subprocess calls with shell=True in Python using the query:<br/>subprocess.open(..., shell=True)<br/>This will even find snippets like:<br/>import subprocess as s<br/>s.open(f'rm {args}', shell=True)</p> <p>Bio:<br/>Bence Nagy is a software engineer at r2c, working on Semgrep, an open-source syntax-aware code search tool. At r2c, his responsibilities tend towards building various interfaces atop the core semgrep CLI. These include CI integrations, editor extensions, and the semgrep.dev web app. He previously led a developer experience team at Kiwi.com, the Czech Republic’s top startup at the time of its acquisition in 2019. You should totally ask him for video game recommendations after the talk.</p> "}, {"chapter": "Cork", "repo": "www-chapter-cork", "name": "OWASP Cork - Adversarial machine learning", "date": "2021-03-23", "time": "18:00", "link": "https://www.meetup.com/OWASP-Cork/events/276818788/", "timezone": "Europe/Dublin", "description": "<p>**** Meeting link will be added closer to the date and accessible to those who RSVP only ****</p> <p>Talk 1: Deep malware obfuscation<br/>Speaker: Saeid Rezaei - Machine learning researcher at University College Cork</p> <p>Deep learning has been widely utilized in many practical applications and achieved remarkable commercial success. It can be used in malware obfuscation engines which are used to secure digital rights management against hackers, and bypass anti-malware programs. In the real world scenarios, there are some constraints that should be considered during malware obfuscation. Using deep learning can help to select the best samples which are satisfying these constraints. In this presentation, we will show how can we use deep learning techniques to improve the performance of obfuscator engines against malware detection techniques.</p> <p>Talk 2: Adversarial machine learning (AML)<br/>Speakers: Dr. Sorcha Healy Principal Engineer, Lead Data Scientist at McAfee and Dr. Catherine Huang - Principal Engineer and Senior Staff Data Scientist at McAfee</p> <p>In this talk Sorcha and Catherine will review the general attack landscape against ML and ML security providers. Understanding the fundamentals behind what a machine learning model does and how it works in combination with the Mitre Adversarial Matrix can provide some sensible MLOps practices to protect the components of a ML system. We will review adversarial machine learning (AML) use cases and demonstrate McAfee’s applied research in AML in protecting our customers against this hostile landscape.</p> "}, {"chapter": "Zhytomyr", "repo": "www-chapter-zhytomyr", "name": "OWASP Zhytomyr meetup 2021", "date": "2021-03-25", "time": "19:30", "link": "https://www.meetup.com/OWASP-Zhytomyr-Chapter/events/276956783/", "timezone": "Europe/Kiev", "description": "<p>Spring is here! And it means we celebrate OWASP Zhytomyr Birthday with an inspirational meetup. Let’s meet in a friendly atmosphere and discuss security with our special guest – Anastasi Vixentael. No slides and boring lectures. We’ll talk about \"Security on your project from scratch\". The questions from the audience will be very welcome! Join us on March 25, 19:30, online.</p> "}, {"chapter": "Porto Alegre", "repo": "www-chapter-porto-alegre", "name": "OWASP Chapter POA - Encontro 005 [ONLINE]", "date": "2021-03-25", "time": "19:30", "link": "https://www.meetup.com/OWASP-Porto-Alegre-Chapter/events/276969660/", "timezone": "America/Sao_Paulo", "description": "<p>Buenas pessoal!</p> <p>Chegamos ao nosso encontro 005, o primeiro de 2021! Essa noite teremos uma edição especial com três palestrantes. Não deixem de participar!</p> <p>25 de Março, quinta-feira, a partir das 19h30 - Link disponível em breve</p> <p>Confira a agenda:</p> <p>19h35-20h15<br/>\"No Outro Lado da Linha - Um Panorama sobre Segurança em Dispositivos Móveis\"<br/>Fábio Sartorato (Analista de Segurança de Software na SiDi)</p> <p>20:20-21:00<br/>\"O Pentest Morreu?\"<br/>Amir Velho (Product Owner com foco em Segurança da Informação na Agility)</p> <p>21:05-21:45<br/>\"Criando APIs Seguras\"<br/>Vinícius Campitelli (Desenvolvedor e Entusiasta por Cibersegurança)</p> <p>Contamos com vocês!</p> "}]