[{"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "SIEM and Elasticsearch for absolute beginners", "date": "2021-02-18", "time": "20:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/275689509/", "timezone": "Europe/Copenhagen", "description": "<p>Curious about SIEM and/or Elastic? You heard about it, but don't really know what it is? You know what it is, but curious about what to do next? This is the talk for you!<br/>We will have a few subjects for you:<br/>- SIEM as a concept<br/>- Elastic as platform and it's usability<br/>- Introduction to Elastic SIEM<br/>- Introduction to TheHive - a security incident response platform that can help you get the most out of your Elastic platform.</p> <p>Elastic is available for free - so is TheHive. So everybody can be on board here.</p> <p>Schedule (Times are subject to change. Talks are confirmed):<br/>20.00 OWASP Copenhagen intro (Klaus Agnoletti)<br/>20.05 Introduction to SIEM in general and Elastic as platform (David Thejl-Clayton, SOC manager @JN Data)<br/>20.30 Introduction to Elastic SIEM (James Spiteri, Principal Product Manager of Elastic SIEM, Elastic)<br/>21.00 Introduction to TheHive (Nabil Adouani, TheHive Project)</p> <p>Links:<br/>Elastic SIEM (<a href=\"https://www.elastic.co/siem\" class=\"linkified\">https://www.elastic.co/siem</a>)<br/>TheHive (<a href=\"https://thehive-project.org\" class=\"linkified\">https://thehive-project.org</a>)</p> <p>Stay tuned!</p> "}, {"chapter": "South Florida", "repo": "www-chapter-south-florida", "name": "OWASP South Florida - Fireside Chat with Zane Lackey", "date": "2021-02-24", "time": "18:00", "link": "https://www.meetup.com/South-Florida-OWASP-Chapter/events/276115983/", "timezone": "US/Eastern", "description": "<p>IMPORTANT NOTE: Due to ongoing COVID-19 public health concerns, we will be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.</p> <p>Hi all! We are very excited to announce a special fireside chat with Zane Lackey. Don't miss this event!</p> <p>***Talk***<br/>Fireside chat with Zane Lackey</p> <p>Zane Lackey is the Co-Founder of Signal Sciences (acquired by Fastly) and the Author of Building a Modern Security Program (O’Reilly Media). He serves on multiple advisory boards and is an investor in modern cybersecurity and DevOps companies. Prior to co-founding Signal Sciences, Zane lead a security team at the forefront of the DevOps/Cloud shift as CISO of Etsy.</p> "}, {"chapter": "Sydney", "repo": "www-chapter-sydney", "name": "OWASP Sydney Fight Club - February Meet", "date": "2021-02-17", "time": "18:00", "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/275618877/", "timezone": "Australia/Sydney", "description": "<p>Introducing OWASP Sydney Chapter's first ever Fight Club CTF! Inspired by Hack the Box's King of the Hill, every second month, we are bringing you a night of hacking, to unleash your skills on a series of vulnerable machines, then defend against your opponents! This will be a team-based event where you are free to choose your own teams (minimum of 2 members and maximum of 4). If you are unable to find a team, let us know and we will help form a team for you.</p> <p>The first rule of Fight Club is: no attacking other participants' personal computers. The second rule of Fight Club is: no attacking other participants' personal computers. Other than that, all attack vectors within the given IP range are allowed. This includes Denial of Service, Man-in-the-Middle, and any other attack methods you can think of that are usually banned from CTFs!</p> <p>Challenges will be of varying difficulties but the idea is the same -- break into a machine, plant your team's flag, then defend your machine(s) from other teams who will be trying to plant their own flag. The team whose flag is present once the time limit is up claims the points for that machine.</p> <p>At the end of the year, the top team from each Fight Club night will go head to head in our grand finale at BSides Sydney!</p> <p>To register please go to: <a href=\"https://forms.gle/Ukb1gTZZLR7SALHA6\" class=\"linkified\">https://forms.gle/Ukb1gTZZLR7SALHA6</a></p> <p>Don't miss out on this opportunity to be crowned fight club champion!</p> <p>DISCLAIMER:<br/>OWASP Sydney does not guarantee that the ENVIRONMENT or any other associated website or servers, through which the content is made available to the Users, are provided without any “virus” or harmful component. The User’s entry to the “closed network” - (“Fight Club Network”) shall be performed under their own responsibility.</p> <p>Anything provided to the Users through our ENVIRONMENT shall not be regarded in any way, directly or indirectly, as stimulation, advice or instigation to commitment of any unlawful action. All publications or services provided have a clear educational purpose, such as upgrading User’s skills in penetration/security testing. Every User acts based upon their private will and ethics being the sole responsible for their actions.</p> <p>OWASP Sydney bears no responsibility for any misuse and/or inappropriate use of the services of the ENVIRONMENT by a User. For any damages caused, to the ENVIRONMENT, to the Network, to another User or to any third party, the sole responsible is the User that carried out the above-mentioned actions.</p> <p>OWASP Sydney under no circumstances, including the case of negligence, shall be held responsible for any kind of damage, which the User of the ENVIRONMENT may suffer given that they access on their own initiative.</p> "}, {"chapter": "Boulder", "repo": "www-chapter-boulder", "name": "Join us (virtually) for Boulder/Denver OWASP's February Meeting!!!", "date": "2021-02-17", "time": "17:30", "link": "https://www.meetup.com/OWASP-Boulder/events/276112313/", "timezone": "US/Mountain", "description": "<p>Join us on zoom: (Link to be provided/updated on day of event)<br/>================================================================<br/>You Don't Have to Be Crazy to Work Here<br/>================================================================</p> <p>Cybersecurity professionals spend most of their day focused on the health and wellbeing of the environments in their care. However, the cost of reducing risk and keeping our networks safe often comes at the price of our professionals' mental health. Many InfoSec professionals burn out, suffer from anxiety and depression, and turn to unhealthy coping mechanisms, which further exacerbate underlying psychological and physical health issues.</p> <p>This talk will alleviate the stigma around mental health and stress the importance of open and frank dialogs about this critical issue impacting our community. I will share my journey, reverse engineer the stigma of mental health in business, and look at ways to hack mental health in productive and meaningful ways.</p> <p>================================================================<br/>Speaker: Douglas Brush<br/>================================================================</p> <p>Douglas is an information security executive with over 26 years of entrepreneurship and professional technology experience. He is a globally recognized expert in the field of cyber security, incident response, digital forensics, and information governance. In addition to serving as a CISO and leading enterprise security assessments, he has conducted hundreds of investigations involving hacking, data breaches, trade secret theft, employee malfeasance, and a variety of other legal and compliance issues. He also serves as a federally court-appointed Special Master and neutral expert in high profile litigation matters involving privacy, security, and eDiscovery.</p> <p>He is the founder and host of Cyber Security Interviews, a popular information security podcast.</p> "}, {"chapter": "Dallas", "repo": "www-chapter-dallas", "name": "OWASP Dallas February Meeting", "date": "2021-02-23", "time": "12:00", "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/276118297/", "timezone": "US/Central", "description": "<p>Title:</p> <p>Secure Coding Tournament</p> <p>Description:</p> <p>We’ve partnered with Secure Code Warrior to bring you a defensive security-based tournament from a developer's perspective. The tournament allows you to test your skill against the other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability.</p> <p>You can find tournament step-by-step guide here: <a href=\"https://youtu.be/o8XhKK_eOOs\" class=\"embedded\">https://youtu.be/o8XhKK_eOOs</a></p> <p>The tournament is run virtually so you can join through your laptop from the most convenient location. Complete all the challenges and win prizes! Once you register, keep an eye out for your confirmation email with instructions and the Zoom link for the day of the tournament!</p> <p>Instructions for playing:<br/>1) Register for the Secure Code Warrior platform here: <a href=\"https://discover.securecodewarrior.com/OWASPDallas-tournament.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPDallas-tournament.html</a><br/>2) Once logged in, click “Tournaments”<br/>3) Join the OWASP Dallas Secure Coding Tournament</p> <p>The Secure Code Warrior platform will be open before and after the tournament, so feel free to practice in the “Training” tab.</p> <p>Monitor the live leaderboard to see how you're performing!</p> <p>Please note: You must register at the link above in order to play.</p> <p>Bio:</p> <p>Derek Orgeron is an Enterprise Account Executive for Secure Code Warrior, a global security company that makes software development better and more secure. After spending his entire career in the technology and SAAS space, Derek is passionate about educating organizations on better security coding practices and building lasting partnerships. Prior to joining Secure Code Warrior, Derek worked for Anaconda, a software platform dedicated to helping developers, data scientists, and larger enterprise organizations use open source Python/R in a secure manner. Connect with Derek on LinkedIn: <a href=\"https://www.linkedin.com/in/derek-orgeron/\" class=\"linkified\">https://www.linkedin.com/in/derek-orgeron/</a></p> "}, {"chapter": "Denver", "repo": "www-chapter-denver", "name": "Join us (virtually) for Denver/Boulder OWASP's January Meeting!!!", "date": "2021-02-17", "time": "17:30", "link": "https://www.meetup.com/Denver-OWASP/events/276112312/", "timezone": "US/Mountain", "description": "<p>Join us on zoom: (Link to be provided/updated on day of event)<br/>================================================================<br/>You Don't Have to Be Crazy to Work Here<br/>================================================================</p> <p>Cybersecurity professionals spend most of their day focused on the health and wellbeing of the environments in their care. However, the cost of reducing risk and keeping our networks safe often comes at the price of our professionals' mental health. Many InfoSec professionals burn out, suffer from anxiety and depression, and turn to unhealthy coping mechanisms, which further exacerbate underlying psychological and physical health issues.</p> <p>This talk will alleviate the stigma around mental health and stress the importance of open and frank dialogs about this critical issue impacting our community. I will share my journey, reverse engineer the stigma of mental health in business, and look at ways to hack mental health in productive and meaningful ways.</p> <p>================================================================<br/>Speaker: Douglas Brush<br/>================================================================</p> <p>Douglas is an information security executive with over 26 years of entrepreneurship and professional technology experience. He is a globally recognized expert in the field of cyber security, incident response, digital forensics, and information governance. In addition to serving as a CISO and leading enterprise security assessments, he has conducted hundreds of investigations involving hacking, data breaches, trade secret theft, employee malfeasance, and a variety of other legal and compliance issues. He also serves as a federally court-appointed Special Master and neutral expert in high profile litigation matters involving privacy, security, and eDiscovery.</p> <p>He is the founder and host of Cyber Security Interviews, a popular information security podcast.</p> "}, {"chapter": "Minneapolis St Paul", "repo": "www-chapter-minneapolis-st-paul", "name": "February meeting: The state of IoT security", "date": "2021-02-11", "time": "19:00", "link": "https://www.meetup.com/OWASP-MSP-Meetup/events/275615353/", "timezone": "US/Central", "description": "<p>TBD</p> "}, {"chapter": "New York City", "repo": "www-chapter-new-york-city", "name": "Threat Modeling by Izar Tarandach and Matthew Coles", "date": "2021-02-11", "time": "19:00", "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/275276260/", "timezone": "US/Eastern", "description": "<p>Izar Tarandach (@izar_t) and Matthew Coles (@coles_matthewj) will discuss the following topics in applied threat modeling:</p> <p>Principles: Formulate a conversation around the relationships of concepts in security. This will include attackers, exploits and value, and how the characteristics of these connections might be understood and managed.</p> <p>Methods: Refresher on modeling techniques and things to consider, then dive into a selection of modeling and analysis methodologies that will help you get from principles to practice.</p> <p>Evolution: Automated threat analysis using an open source tool(pytm). We will talk through the making of pytm and then do a demo.</p> <p>*** Speaker bios</p> <p>Izar Tarandach has peeked and poked at security from various sides over the last couple of decades, currently focusing on modern SDLC's and how AppSec extrapolates onto the larger scheme of Security. He has a MSc in Computer Science/Security from Boston U.</p> <p>Matthew Coles (he/him) is a security professional focused on the security of physical devices and the ecosystems and processes that enable them to operate. He has an advanced degree in Computer Science from WPI, and maintains a CSSLP certification.</p> <p>Izar and Matt have collaborated on security techniques and training for the past 10 years, co-authoring a book on Threat Modeling, and an open source threat modeling automation system, pytm.</p> <p>- OWASP PyTM: <a href=\"https://owasp.org/www-project-pytm/\" class=\"linkified\">https://owasp.org/www-project-pytm/</a><br/>- Threat Modeling Manifesto: <a href=\"http://www.threatmodelingmanifesto.org\" class=\"linkified\">http://www.threatmodelingmanifesto.org</a><br/>- Threat Modeling: A Practical Guide for Development Teams: <a href=\"https://www.amazon.com/Threat-Modeling-Identification-Avoidance-Secure/dp/1492056553\" class=\"linkified\">https://www.amazon.com/Threat-Modeling-Identification-Avoidance-Secure/dp/1492056553</a></p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2021-02-25", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqyccdbhc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Bangalore", "repo": "www-chapter-bangalore", "name": "Moving to a different Meetup Group", "date": "2021-02-28", "time": "19:00", "link": "https://www.meetup.com/OWASP-Bangalore-Chapter/events/276065123/", "timezone": "Asia/Calcutta", "description": "<p>Hi Team,</p> <p>We are moving to a different meet-up group by 28th <a href=\"https://www.meetup.com/bangalore-owasp-meetup-group\" class=\"linkified\">https://www.meetup.com/bangalore-owasp-meetup-group</a></p> "}, {"chapter": "Switzerland", "repo": "www-chapter-switzerland", "name": "ZAP Automation in CI/CD", "date": "2021-02-09", "time": "18:00", "link": "https://www.meetup.com/OWASPSwitzerland/events/275004625/", "timezone": "Europe/Zurich", "description": "<p>OWASP ZAP is probably the most frequently used web application scanner in the world, and automation is one of its strengths.<br/>In this talk Simon will explain the different options you have for running ZAP in a CI/CD pipeline ranging from the packaged scans to directly driving the ZAP API.<br/>He will also explain (and maybe even demo) a new ZAP automation framework which is currently under development.</p> <p>ZAP is an OWASP flagship project and you can find more information on <a href=\"https://www.zaproxy.org/\" class=\"linkified\">https://www.zaproxy.org/</a> .</p> <p>About your speaker:<br/>Simon Bennetts is the OWASP Zed Attack Proxy (ZAP) Project Leader and a Distinguished Engineer at StackHawk, a company that uses ZAP to help users fix application security bugs before they hit production.<br/>He has talked about and demonstrated ZAP at conferences all over the world, including Blackhat, JavaOne, FOSDEM and OWASP AppSec EU, USA &amp; AsiaPac.<br/>Prior to making the move into security he was a developer for 25 years and strongly believes that you cannot build secure web applications without knowing how to attack them.</p> "}]