[{"chapter": "Las Vegas", "repo": "www-chapter-las-vegas", "name": "Secure Coding CTF Tournament", "date": "2020-10-22", "time": "16:00", "link": "https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/273749267/", "timezone": "US/Pacific", "description": "<p>Secure Coding CTF Tournament</p> <p>Date: Thursday, October 22, 2020</p> <p>Time: 4:00pm - 6:00pm (Pacific Time)</p> <p>REGISTRATION IS REQUIRED: <a href=\"https://discover.securecodewarrior.com/OWASPLasVegas-tournament.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPLasVegas-tournament.html</a></p> <p>Description:<br/>CTF with Secure Code Warrior<br/>Twitter - @SecCodeWarrior<br/>LinkedIn – <a href=\"https://www.linkedin.com/company/secure-code-warrior\" class=\"linkified\">https://www.linkedin.com/company/secure-code-warrior</a><br/>Facebook – <a href=\"https://www.facebook.com/securecodewarrior/\" class=\"linkified\">https://www.facebook.com/securecodewarrior/</a></p> <p>Secure Coding CTF Tournament<br/>Capture the Flag for Developers/Pentesters</p> <p>Improve your secure coding skills by joining our live Secure Code Warrior tournament. The tournament allows you to compete against the other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability.</p> <p>All challenges are based on the OWASP Top 10, and players can choose to compete in a range of software languages including Java EE, Java Spring, C# MVC, C# WebForms, Go, Ruby on Rails, Python Django &amp; Flask, Scala Play, Node.JS, React, and both iOS and Android development languages.</p> <p>Throughout the tournament, players earn points and watch as they climb to the top of the leaderboard. Prizes will be awarded to the top finishers! First place will receive a hoodie, and lots of bragging rights!</p> "}, {"chapter": "Ottawa", "repo": "www-chapter-ottawa", "name": "OWASP Ottawa October 2020 Meetup", "date": "2020-10-21", "time": "19:00", "link": "https://www.meetup.com/OWASP-Ottawa/events/273690955/", "timezone": "Canada/Eastern", "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p><a href=\"https://www.youtube.com/watch?v=qHXOwEyRvLs\" class=\"embedded\">https://www.youtube.com/watch?v=qHXOwEyRvLs</a></p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p>7:00 EDT PM: Technical Talks</p> <p>1. Announcements</p> <p>2. A Client-Side Data Encryption Solution for Cloud-Based Systems</p> <p>Abstract:<br/>Infrastructure-as-a-Service (IaaS) and Platform-as-a-Service (PaaS) solutions usually offer data at rest encryption for common storage solutions like databases and filesystems. This has the potential to reveal sensitive information to the third party’s employees or to any malicious actor. For highly sensitive information this could be undesirable and in these scenarios it could be highly desirable to encrypt data prior to storing it with a IaaS or PasS provider to mitigate this risk. . In this talk we’ll present two open source Ruby libraries that we have developed to aide in the deployment of solutions that require this degree of protection, we’ll cover the architecture of the solution and the third party services that they are currently compatible with.</p> <p>Bio:<br/>Brent Carrara is a software developer turned security professional passionate about building security into large scale systems. As the Head of Security at Ario, he is responsible for establishing and maintaining the security program for the financial technology startup. Brent holds a Bachelor’s degree from the University of Waterloo in Software Engineering, a Master’s degree from the University of Ottawa in Digital Identity and Biometrics and a PhD from the University of Ottawa in Covert Channels. He has published papers in various security topics including information hiding, digital credentials, biometric authentication and covert communication.</p> <p>Weiyun Lu is a software developer at Thinking Capital with a focus on the security of the platform. He holds Masters degrees from the University of Ottawa in mathematics (algebras of many-valued and quantum logics) and computer science (formal verification of code obfuscation algorithms). At heart a pure mathematician, he transitioned to the software field out of his interest in cryptography and formal theorem proving. He also has a nocturnal alter ego as a bassist in a metal band that has played throughout Ontario and Quebec.</p> <p>3. Enforcing Code &amp; Security Standards with Semgrep</p> <p>Abstract:<br/>We’ll discuss a program analysis tool we’re developing called Semgrep (<a href=\"https://github.com/returntocorp/semgrep#semgrep\" class=\"linkified\">https://github.com/returntocorp/semgrep#semgrep</a>). It's a multilingual semantic tool for writing security and correctness queries on source code (for Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle (<a href=\"http://coccinelle.lip6.fr/\" class=\"linkified\">http://coccinelle.lip6.fr/</a>), for Linux kernel refactoring, and later developed Semgrep while at Facebook.</p> <p>Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.</p> <p>Bio:</p> <p>Colleen Dai is a security software engineer at r2c, a startup working on building static analysis tools that focus on precision and being custom-fit to the consumer. At r2c, Colleen has worked on the language parsing along with AST matching. She is also writing rules to find security vulnerabilities in open source code. Colleen recently received her B.S. in Computer Science and M.S. in Statistics from Stanford. She regularly enjoys Brazilian Jiujitsu, drawing, and trying (and failing) not to eat everything in her fridge.</p> "}, {"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "Finding the needle in a needle stack - NexGen Analytics in CyberSec Using ML+AI", "date": "2020-10-21", "time": "19:30", "link": "https://www.meetup.com/SGSecurityMG/events/273202440/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Sydney", "repo": "www-chapter-sydney", "name": "Sydney OWASP Night - How to become a security specialist", "date": "2020-10-21", "time": "18:00", "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/273424954/", "timezone": "Australia/Sydney", "description": "<p>The Sydney OWASP Chapter is BACK and revamped for 2020 with a fresh set of goals and leaders to bring you local cybersecurity events!</p> <p>We are focused on promoting equality within the workforce, education for new cybersecurity talents, and fostering a supportive community. To achieve these goals, we hold events throughout the year to bring regarded speakers, networking opportunities, and an annual CTF (with a cash prize!).</p> <p>Join us on Wednesday 21st October at 6PM for our first event featuring special guest speakers Ricki Burke and Lukasz Gogolkiewicz as they discuss some of the challenges of getting into the security job market and overcoming them to land your first role in the field.</p> <p>Ricki is heavily involved in the infosec community and is one of Australia’s leading cyber security recruiters. He is the founder of CyberSec People, where him and his team support organisations in hiring skilled infosec professionals.</p> <p>Lukasz is a highly proficient security professional who heads up Corporate Security at SEEK. He has worked with some of the world largest banks and financial organisations, has worked with federal, state and local governments, presented at and organised a number security conferences, and helps mentor the next generation of security professionals.</p> <p>Whether you're a student seeking some insight behind the scenes of working in cybersecurity or an experienced industry leader looking to meet new people, OWASP Chapter meetups are open to all and free to attend so we encourage everyone to come along!</p> <p>Read more about us on our website: <a href=\"https://owasp.org/www-chapter-sydney/\" class=\"linkified\">https://owasp.org/www-chapter-sydney/</a></p> "}, {"chapter": "Austin", "repo": "www-chapter-austin", "name": "October 2020 Chapter Meeting", "date": "2020-10-27", "time": "11:55", "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/273845168/", "timezone": "US/Central", "description": "<p>Title:<br/>Mobile Security in a Remote World</p> <p>Attacks on the endpoint are no longer limited to traditional endpoints like laptops and workstations; mobile devices have been ranked the #1 hardest enterprise asset to defend. Compounded by bring-your-own device policies, enterprises are struggling to protect themselves against a growing variety of mobile threats. In this session, we will dive into the challenges with securing mobile in the enterprise security space and the evolution of mobile device security. Join us to learn about why attackers are shifting to target mobile, validated by investigations from the Cybereason Nocturnus team, and how the enterprise security industry is moving to address them.</p> <p>Speaker:<br/>Allie Mellen has spent the past decade in engineering, development, and technical consulting roles at multiple venture-backed startups, as well as research roles at MIT and Boston University. Her passion is combining technology and entrepreneurship, having run her own successful iOS development company out of college and been an investment partner at a venture fund investing in student-run startups. She has worked with multiple nonprofits to teach engineering to students and minorities, including the Global App Initiative and WISP, and has mentored business students at Hult Business School. She received her B.S. degree in Computer Engineering, and has been recognized worldwide for her security research at conferences like Black Hat USA, DEFCON, HOPE, and others. She is now a security strategist in the Office of the CSO at Cybereason, where she is a frequent speaker at security conferences globally teaching about security and pushing the boundaries of the industry.</p> "}, {"chapter": "Jacksonville", "repo": "www-chapter-jacksonville", "name": "OWASP Monthly Online meeting ", "date": "2020-10-12", "time": "18:30", "link": "https://www.meetup.com/OWASP-Jacksonville-Chapter/events/273751089/", "timezone": "US/Eastern", "description": "<p>The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org.</p> "}, {"chapter": "Minneapolis St Paul", "repo": "www-chapter-minneapolis-st-paul", "name": "October meeting: Securing Infrastructure as Code", "date": "2020-10-29", "time": "19:00", "link": "https://www.meetup.com/OWASP-MSP-Meetup/events/273422662/", "timezone": "US/Central", "description": "<p>Join us for a lively discussion of Infrastructure as Code (IaC), the hot<br/>new way to configure the Cloud. We'll cover:</p> <p>* Best practices<br/>* Testing and Validation for IaC<br/>* Remediation<br/>* Fitting IaC into the App Sec PIpeline<br/>* Immutable infrastructure<br/>* Is it Security Architecture or Secure Coding?</p> <p>So get your head out of the Cloud for a couple of hours and get ready<br/>for some down-to-earth information exchange.</p> <p>Due to COVID-19 restrictions, this will be an online event.</p> "}, {"chapter": "Nashville", "repo": "www-chapter-nashville", "name": "OWASP Nashville October Meetup: Defending Multicloud Infrastructure", "date": "2020-10-27", "time": "18:29", "link": "https://www.meetup.com/OWASP-Nashville-Chapter/events/273520924/", "timezone": "US/Central", "description": "<p>Join Senior Application Security Engineer at Asurion and Instructor for the SANS Institute Brandon Evans at OWASP Nashville's next online Meetup. Brandon will discuss how to defend infrastructure and applications running in Amazon Web Services (AWS), Microsoft Azure, and the Google Cloud Platform (GCP).</p> <p>Brandon is the lead author of SANS SEC510: Multicloud Security Assessment and Defense. For more information, visit: SANS.org/SEC510</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2020-10-29", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqybcnbmc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Sacramento", "repo": "www-chapter-sacramento", "name": "OWASP Sacramento - October (Remote Only - Google Hangouts)", "date": "2020-10-16", "time": "19:00", "link": "https://www.meetup.com/OWASP-Sacramento-Chapter/events/273517872/", "timezone": "US/Pacific", "description": "<p>Please note that this meetup is remote only!! Meetup won’t let us remove the location!!</p> <p>Happy Halloween, Chapter!</p> <p>Here is what we are going to cover this month.</p> <p>Hope everyone is healthy and safe!</p> <p>This month, continuing our abundance of caution, we are going to hold our meetup remotely on Google Hangouts. Please try to join from a computer.</p> <p><a href=\"https://meet.google.com/xzu-iiiq-mmx\" class=\"linkified\">https://meet.google.com/xzu-iiiq-mmx</a></p> <p>Agenda:<br/>- Community Topics<br/>- Main Topic: Identification, credit card, and cash authentication<br/>- Q&amp;A</p> <p>For more information about OWASP, please visit our Wiki at <a href=\"https://owasp.org/www-chapter-sacramento/\" class=\"linkified\">https://owasp.org/www-chapter-sacramento/</a></p> "}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP Meetup - CTF", "date": "2020-11-06", "time": "19:00", "link": "https://www.meetup.com/OWASP-STL/events/268671065/", "timezone": "US/Central", "description": "<p>Capture the Flag (CTF) is a computer security competition. CTF contests are usually designed to serve as an educational exercise to give participants experience in securing a machine, as well as conducting and reacting to the sort of attacks found in the real world. Reverse-engineering, network sniffing, protocol analysis, system administration, programming, and cryptanalysis.</p> <p>* This will be an open CTF which means this is open book. You may use any tool or internet accessible resource: Burpsuite, IDE, Metasploit, etc.</p> <p>* Work in single or 2 person teams</p> <p>* Be the person/team with the most challenges completed to win (time will determine a tie)</p> "}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "October Virtual Chapter Meeting", "date": "2020-10-29", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/273669025/", "timezone": "US/Mountain", "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA</a>) to suggest any additional topics.</p> <p>Agenda:<br/>12 - 12:45pm<br/>- Discussion (TBD)</p> <p>12:45 - 1pm<br/>Open Forum, Admin Items, Choose next Guest Speaker</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC/Wasatch AppSec - October Chapter Meeting<br/>Time: Oct 29, 2020 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/98770637269?pwd=ekFnVHA3aW03TXkwbFFxKzQ3RUlZdz09\" class=\"linkified\">https://zoom.us/j/98770637269?pwd=ekFnVHA3aW03TXkwbFFxKzQ3RUlZdz09</a></p> <p>Meeting ID: 987 7063 7269<br/>Passcode: 020827<br/>One tap mobile<br/>+16699006833,,98770637269# US (San Jose)<br/>+12532158782,,98770637269# US (Tacoma)</p> <p>Dial by your location<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 929 436 2866 US (New York)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>Meeting ID: 987 7063 7269<br/>Find your local number: <a href=\"https://zoom.us/u/aUsjImmBw\" class=\"linkified\">https://zoom.us/u/aUsjImmBw</a></p> "}, {"chapter": "Israel", "repo": "www-chapter-israel", "name": "Virtual AppSec IL 2020 Conference", "date": "2020-10-28", "time": "09:00", "link": "https://www.meetup.com/OWASP-Israel/events/273224114/", "timezone": "Asia/Jerusalem", "description": "<p>Hi Everybody!</p> <p>I am happy to announce that the annual OWASP AppSec Israel Conference is now in motion!<br/>In the spirit of Covid-19 It is going to be a two days virtual event this year with great content and training workshops, on Tuesday-Wednesday, October 27-28 2020.</p> <p>AppSec IL site : <a href=\"https://appsecil.org\" class=\"linkified\">https://appsecil.org</a></p> <p>after lots of thinking we will use this event as the method for registration!<br/>Soon we will share the agenda</p> <p>As you all know, OWASP’s AppSec Israel is the largest conference in Israel and the region for application security, and regularly draws hundreds of participants.<br/>Last event over 800 people attended – don’t miss it this year!<br/>The Virtual Conference will include multiple lecture tracks, un-conference sessions, chat rooms,and meeting rooms.</p> <p>We also want to continue the tradition that was started last year, to have another full day of Security Training just before the conference day. We are reaching out to you, AppSec community to help and support us for making it happen, we are looking for trainers and sponsors.</p> <p>The Training event will be conducted by professional security trainers, selected by OWASP, and free to attend, just preregister to the event.</p> <p>Looking forward to seeing you all!</p> "}, {"chapter": "Israel", "repo": "www-chapter-israel", "name": "Virtual AppSec IL 2020 Training Day", "date": "2020-10-27", "time": "09:00", "link": "https://www.meetup.com/OWASP-Israel/events/273501887/", "timezone": "Asia/Jerusalem", "description": "<p>Hi Everybody!</p> <p>I am happy to announce that the annual OWASP AppSec Israel Conference is now in motion!<br/>In the spirit of Covid-19 It is going to be a two days virtual event this year with great content and training workshops, on Tuesday-Wednesday, October 27-28 2020.</p> <p>AppSec IL site : <a href=\"https://appsecil.org\" class=\"linkified\">https://appsecil.org</a></p> <p>After lots of thinking we will use this event as the method for registration!<br/>Soon we will share the agenda for the training</p> <p>As you all know, OWASP’s AppSec Israel is the largest conference in Israel and the region for application security, and regularly draws hundreds of participants.<br/>Last event over 800 people attended – don’t miss it this year!<br/>The Virtual Conference will include multiple lecture tracks, un-conference sessions, chat rooms,and meeting rooms.</p> <p>We also want to continue the tradition that was started last year, to have another full day of Security Training just before the conference day. We are reaching out to you, AppSec community to help and support us for making it happen, we are looking for trainers and sponsors.</p> <p>The Training event will be conducted by professional security trainers, selected by OWASP, and free to attend, just preregister to the event.</p> <p>Looking forward to seeing you all!</p> "}, {"chapter": "Bristol Uk", "repo": "www-chapter-bristol-uk", "name": "Secure Code Warrior Tournament", "date": "2020-10-27", "time": "18:00", "link": "https://www.meetup.com/OWASP-Bristol/events/268319035/", "timezone": "Europe/London", "description": "<p>Opening meeting - Zoom details:<br/>Topic: OWASP Bristol - Secure Code Warrior Tournament<br/>Time: Oct 27, 2020 06:00 PM London</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/99583981560?pwd=MkN0Q2NpTDF5eW5wK0ZUajNKS0pPUT09\" class=\"linkified\">https://zoom.us/j/99583981560?pwd=MkN0Q2NpTDF5eW5wK0ZUajNKS0pPUT09</a></p> <p>Meeting ID: 995 8398 1560<br/>Passcode: 542873<br/>One tap mobile<br/>+12532158782,,99583981560# US (Tacoma)<br/>+13017158592,,99583981560# US (Germantown)</p> <p>Dial by your location<br/>+1 253 215 8782 US (Tacoma)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 995 8398 1560<br/>Find your local number: <a href=\"https://zoom.us/u/apHTPsgrT\" class=\"linkified\">https://zoom.us/u/apHTPsgrT</a></p> "}, {"chapter": "Norway", "repo": "www-chapter-norway", "name": "Enforcing Code & Security Standards with Semgrep", "date": "2020-10-13", "time": "19:00", "link": "https://www.meetup.com/OWASP-Norway/events/273505813/", "timezone": "Europe/Oslo", "description": "<p>Duration:<br/>45 min</p> <p>Abstract:<br/>We’ll discuss a program analysis tool we’re developing called Semgrep. It's a multilingual semantic tool for writing security and correctness queries on source code (for Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle, for Linux kernel refactoring, and later developed Semgrep while at Facebook. He’s now full time with us at r2c.</p> <p>Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.</p> <p>For example, find subprocess calls with shell=True in Python using the query:<br/>subprocess.open(..., shell=True)<br/>This will even find snippets like:<br/>import subprocess as s<br/>s.open(f'rm {args}', shell=True)</p> <p>Or find hardcoded credentials using the query:<br/>boto3.client(..., aws_secret_access_key=”...”, aws_access_key_id=”...” )</p> <p>Source code: <a href=\"https://github.com/returntocorp/semgrep\" class=\"linkified\">https://github.com/returntocorp/semgrep</a><br/>Test in your browser: <a href=\"https://semgrep.dev/\" class=\"linkified\">https://semgrep.dev/</a></p> <p>Speaker bio:<br/>Bence Nagy is a software engineer at r2c, working on Semgrep, an open-source syntax-aware code search tool. At r2c, his responsibilities tend towards building various interfaces atop the core semgrep CLI. These include CI integrations, editor extensions, and the semgrep.live web app. He previously led a developer experience team at Kiwi.com, the Czech Republic’s top startup at the time of its acquisition in 2019. You should totally ask him for video game recommendations after the talk.</p> "}, {"chapter": "Somerset", "repo": "www-chapter-somerset", "name": "Exploring OWASP ZAP", "date": "2020-10-30", "time": "19:00", "link": "https://www.meetup.com/OWASP-Somerset-Chapter/events/273592981/", "timezone": "US/Eastern", "description": "<p>If you are not familiar with the OWASP ZAP project this is a great chance to get an introduction to a powerful, free web app scanner. If you are familiar please join and help answer any questions that attendees may have or just enjoy the opportunity to participate in the OWASP Somerset community!</p> <p>We will look at using the ZAP scanner to find vulnerabilities in web apps. This is the first part of a series on app scanning that will go from the basics to when, how, and why you may want to work with engineering teams to automate security tooling in the DevSecOps pipeline.</p> "}]