[{"chapter": "Orange County", "repo": "www-chapter-orange-county", "name": "Virtual Meeting: The Latest Web Application Threats Discovered and Revealed", "date": "2020-12-15", "time": "17:45", "link": "https://www.meetup.com/OWASP-OC/events/275046305/", "timezone": "US/Pacific", "description": "<p>Speaker: David Lindner, CISO, at Contrast Security</p> <p>Topic: The Latest Web Application Threats Discovered and Revealed</p> <p>Abstract:<br/>Open Web AI Security Project may be the future of application security Want to learn what the \"watch list\" of application vulnerabilities needs to be today? What's attacking known vulnerabilities on open-source code? Are you able to tie vulnerability and attack data to help prioritize your risk? Why do some applications have certain vulnerabilities and others don't? Join David Lindner, CISO, at Contrast Security as he reviews the latest in AppSec vulnerability and attack trends spelled out in the Contrast Labs Bimonthly and Yearly AppSec Intelligence Reports . In this talk, David will explain:</p> <p>- Vulnerabilities that are found in a subset of applications but absent in others</p> <p>- The numbers of attacks an application received on average</p> <p>- Prevalence of vulnerabilities versus the likelihood that they will be exploited</p> <p>- Meantime to Resolution (MTTR) in protected assets</p> <p>- A \"watch list\" of vulnerabilities that require special scrutiny</p> <p>Speaker Bio:<br/>David is an experienced Application Security Professional with over 18 years of experience in the computer security industry. During this time, David has worked within multiple disciplines in the security field, from application development, network architecture design and support, IT security and consulting, security training, and application security. Over the past 10 years, David has specialized in all things related to mobile applications and securing them. David has supported many different clients including financial, government, automobile, healthcare, and retail. In his spare time, David is seen on the golf course or honing his mobile testing skills by participating in numerous bug bounties.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/dlindner/\" class=\"linkified\">https://www.linkedin.com/in/dlindner/</a></p> <p>Twitter: @golfhackerdave</p> <p>Schedule:<br/>5:45pm: Introduction, Presentation &amp; Q&amp;A<br/>At end of meeting: Raffle (two $50 gift certificates sponsored by Contrast Security)</p> <p>Unlike our usual in-person meetings, this event is BYOB. Our meeting sponsor, Contrast Security, will provide $25 Uber Eats e-gift cards for attendees. A link to register for the Uber Eats e-gift cards will be provided during the meeting.</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "}, {"chapter": "Cambridge", "repo": "www-chapter-cambridge", "name": "ARU CSNRG, OWASP Cambs & BCS Cybercrime SG \"The Shadowserver Foundation\" Webinar", "date": "2020-12-15", "time": "18:00", "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/274821801/", "timezone": "Europe/London", "description": "<p>ARU CSNRG, OWASP Cambridge &amp; BCS Cybercrime Forensics \" The Shadowserver Foundation, who we are, what we do and why we love doing it!”\" Webinar</p> <p>Tuesday 15th December 18:00 – 19:30 – Online</p> <p>Hosted by the Cyber Security &amp; Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter &amp; BCS Cybercrime Forensics SG.</p> <p>Background</p> <p>OWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.</p> <p>The Cyber Security and Networking (CSN) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP &amp; the UK Cyber Security Forum amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment.</p> <p>The BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.</p> <p>Speaker Biographies &amp; Abstracts</p> <p>Stewart Garrick (Law Enforcement Liaison and Operations Manager), Shadowserver Foundation. \"The Shadowserver Foundation, who we are, what we do and why we love doing it!”</p> <p>Bio: Stewart Garrick (Law Enforcement Liaison and Operations Manager)</p> <p>Shadowserver member for 5 years. Previously 30 years in UK Law Enforcement (culminating as a Senior Investigating Officer in the National Crime Agency). As career detective he worked primarily on major crime units engaged on both proactive and reactive investigations, including many high profile cybercrime cases as the senior investigator - such as the Gameover Zeus and Dridex botnet takedowns. More recently he works in LE supporting roles for the NPO, The Shadowserver Foundation. He is currently actively engaged in multiple ongoing international investigations. He understands the operational challenges and differing evidentiary restrictions and capabilities across LE worldwide. His focus is always to help LE achieve their Intelligence and evidential needs in ways they can use. Qualifications: MSc in Countering Organised Crime and Terrorism at UCL and Certified Information Systems Security Professional (CISSP).</p> <p>Abstract : “The Shadowserver Foundation, who we are, what we do and why we love doing it!”</p> <p>This presentation will give an overview of this not for profit Foundation, which has become a key component in the international fight to protect Internet users.</p> <p>The talk with give an overview of our data, how we collect it, who is entitled to it, with a look at how we use our knowledge on occasions to help Law Enforcement internationally in their fight against distant and hard to reach criminals.</p> <p>Maybe you can help too?</p> <p>NB: No investigations will be hurt in the course of this presentation!</p> <p>Provisional Agenda</p> <p>18:00 - Webinar waiting lobby opens<br/>18:15 - Presentation followed by Questions and Answers<br/>19:30 - Closing, with virtual networking</p> <p>Registration</p> <p>To register for this free event, please register online:</p> <p><a href=\"https://attendee.gotowebinar.com/register/7511229433928467981\" class=\"linkified\">https://attendee.gotowebinar.com/register/7511229433928467981</a></p> "}, {"chapter": "Somerset", "repo": "www-chapter-somerset", "name": "Exploring OWASP ZAP", "date": "2020-12-18", "time": "19:00", "link": "https://www.meetup.com/OWASP-Somerset-Chapter/events/273592981/", "timezone": "US/Eastern", "description": "<p>If you are not familiar with the OWASP ZAP project this is a great chance to get an introduction to a powerful, free web app scanner. If you are familiar please join and help answer any questions that attendees may have or just enjoy the opportunity to participate in the OWASP Somerset community!</p> <p>We will look at using the ZAP scanner to find vulnerabilities in web apps. This is the first part of a series on app scanning that will go from the basics to when, how, and why you may want to work with engineering teams to automate security tooling in the DevSecOps pipeline.</p> "}]