[{"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "Cybersecurity Innovation - The good, the bad and the alarming. ", "date": "2020-12-10", "time": "20:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/274829683/", "timezone": "Europe/Copenhagen", "description": "<p>You will learn about the future of cybersecurity - What is the next big step for the attackers? Are people, businesses and public organisations equipped to deal with what's coming? How is the innovative capacity in cybersecurity preparing to go on the defence?</p> <p>1ST SPEAKER<br/>Tim Sloth Jørgensen, Program chief for cybersecurity in the Danish Industry Foundation, Chief Strategy Officer of Defence and Security at Terma A/S, advisor to the Danish Ministry og Defence, professor at Copenhagen Business School, former Chief of the Danish Defence.<br/><a href=\"https://www.linkedin.com/in/tim-sloth-jorgensen-3b199a23/\" class=\"linkified\">https://www.linkedin.com/in/tim-sloth-jorgensen-3b199a23/</a></p> <p>Tim will share his insights based on several years of first-hand experience, and will tell us about what they are looking for when investing in new cybersecurity projects - What is he anticipating? Is he hopeful or concerned for the future?</p> <p>2ND SPEAKER<br/>Rasmus L. Fruergaard-Pedersen,<br/>Security Software Engineer at Kamstrup<br/>(<a href=\"https://www.linkedin.com/in/rfruergaard/\" class=\"linkified\">https://www.linkedin.com/in/rfruergaard/</a>)</p> <p>Rasmus enables the business to use security correctly.<br/>Innovation in software, sensors and communications is what the company Kamstrup is associated with, but how do they ensure a sufficient security stance across a business spanning that wide?<br/>Rasmus will talk briefly about technical security champions, business security principles and how to ensure a common understanding of what security is acceptable.</p> <p>What will you learn from this talk?<br/>Translating technical security to business risk; Making security a competitive parameter; Questions to ask when wanting to secure a product in a complex business environment.</p> <p>We can't wait to see you!</p> <p>(Note: THIS IS AN ONLINE EVENT! Link to stream will be revealed here shortly before the talk)</p> "}, {"chapter": "Seattle", "repo": "www-chapter-seattle", "name": "Free event: INTERFACE-VIRTUAL / Seattle 2020", "date": "2020-12-10", "time": "08:30", "link": "https://www.meetup.com/Seattle-Open-Web-Application-Security-Project-OWASP-Chapter/events/274585603/", "timezone": "US/Pacific", "description": "<p><a href=\"https://f2fevents.com/evite/sea20-the-advisory-council/\" class=\"linkified\">https://f2fevents.com/evite/sea20-the-advisory-council/</a><br/><a href=\"https://www.f2fevents.com/event/sea20\" class=\"linkified\">https://www.f2fevents.com/event/sea20</a></p> <p>Join us at INTERFACE Seattle<br/>The Advisory Council invites you to attend a CPE-accredited educational conference for IT professionals focusing on the latest developments in this constantly changing information technology environment. As a key-influencer on the evaluation of IT solutions, INTERFACE Seattle was developed for you.</p> <p>[[ FIRST ANNOUNCED TALK ]]</p> <p>KEYNOTE: Seizing the Castle: A Medieval Battle Technique Workshop<br/>Presented by Chris Roberts • vCISO, Researcher, Hacker – HillBilly Hit Squad</p> <p>INTERFACE Seattle<br/>December 10th, 2020<br/>8:30am – 4:30pm</p> "}, {"chapter": "Melbourne", "repo": "www-chapter-melbourne", "name": "Melbourne Chapter (Virtual) Meetup - 11th Dec 2020", "date": "2020-12-11", "time": "10:00", "link": "https://www.meetup.com/Application-Security-OWASP-Melbourne/events/274982280/", "timezone": "Australia/Melbourne", "description": "<p>Block out your calendar on Friday 11th December at 10am for two exciting talks by two incredible speakers from across the pond to wrap out our meetups for the year.</p> <p>The talks will dive into how to grow your own Security Champion, and the past, present and future of AppSec as a whole.</p> <p>@_tonijames is a security consultant, software engineer, conference organiser, snowboarder and mountain biker. She is currently a Security Advisor for SafeStack.</p> <p>@vanderaj is a seasoned web app security specialist and enterprise security architect, currently working as the Executive Director for the OWASP Foundation.</p> <p>The Schedule ( Melbourne Time )<br/>-------------------------------------------<br/>09:40 hrs - Virtual doors open; come hang out in our Discord.<br/>10:00 hrs - Welcome, and introductions.<br/>10:05 hrs - Grow your own Security Champion byToni James<br/>10:35 hrs - Q&amp;A with Toni James<br/>10:40 hrs - Break &amp; Transition<br/>10:45 hrs - AppSec in the 2020's by Andrew van der Stock<br/>11:30 hrs - Q&amp;A with Andrew van der Stock<br/>11:35 hrs - End formal presentations, social time on Discord.</p> <p>Presentations<br/>-------------------------------------------<br/>Grow your own Security Champion<br/>-------------------------------------------<br/>Growing your security champion is a lot like growing a plant. It takes a great environment and a bit of care to make your team flourish. Toni will take you through some tips and tricks to grow your security garden, one champion at a time.</p> <p>Toni James ( @_tonijames )<br/>Bio:<br/>Toni is a security consultant, software engineer, conference organiser, committee member, speaker, and diversity and inclusion advocate.</p> <p>She's an avid snowboarder and mountain biker living with her human and fur family in the Korowai mountains. You can find her running the Christchurch Hacker Conference, attending Christchurch ISIG or Canterbury Tech meetups, or chatting with the Hacker Book Club crew.</p> <p>AppSec in the 2020's - the past, the current, and the future<br/>-------------------------------------------<br/>Andrew will talk about his experience over the last 20 years, and how the industry has changed, what's the current challenges, and what he hopes will be achieved by the time he retires in 2037.</p> <p>Andrew van der Stock ( @vanderaj )<br/>Bio:<br/>Andrew is a seasoned web application security specialist and enterprise security architect. He is the Executive Director at OWASP, taking the Foundation through organizational change and taking our mission to the next level. Andrew has worked in the IT industry for over 25 years. Andrew has researched and developed the web application security and architecture fields since 1998. He is a Lifetime member of OWASP, former Director, and co-leads the OWASP Application Security Verification Standard and OWASP Top 10 projects. An Australian ex-pat of Melbourne and Sydney, he currently lives in the USA with his family.</p> <p>Other Information<br/>------------------------<br/>OWASP Melbourne Chapter’s Discord<br/>Server Invite: <a href=\"https://discord.gg/uAWze2B\" class=\"linkified\">https://discord.gg/uAWze2B</a></p> <p>Melbourne Chapter YouTube Channel<br/><a href=\"https://www.youtube.com/channel/UCDwRks28thuvwICPM5VgmSQ\" class=\"embedded\">https://www.youtube.com/channel/UCDwRks28thuvwICPM5VgmSQ</a></p> <p>AppSec Day Conference YouTube Channel<br/><a href=\"https://www.youtube.com/channel/UCSaEzCX3PAxtdHdMnD60xIw\" class=\"embedded\">https://www.youtube.com/channel/UCSaEzCX3PAxtdHdMnD60xIw</a></p> <p>What is OWASP?<br/>The Open Web Application Security Project® (OWASP) is a nonprofit foundation that works to improve the security of software. Through community-led open source software projects, hundreds of local chapters worldwide, tens of thousands of members, and leading educational and training conferences, the OWASP Foundation is the source for developers and technologists to secure the web.</p> <p>Find out more?<br/>More about the Chapter: <a href=\"https://owasp.org/www-chapter-melbourne/\" class=\"linkified\">https://owasp.org/www-chapter-melbourne/</a></p> <p>These events are made possible by our OWASP Foundation members, and sponsors. If you like what we do, please sign up for a Foundation membership at <a href=\"https://owasp.org/membership/\" class=\"linkified\">https://owasp.org/membership/</a></p> <p>Other Information:<br/>Just a reminder, to abide by our Code of Conduct <a href=\"https://owasp.org/www-policy/operational/code-of-conduct\" class=\"linkified\">https://owasp.org/www-policy/operational/code-of-conduct</a>.</p> "}, {"chapter": "Bay Area", "repo": "www-chapter-bay-area", "name": "A Crash Course on Multiparty Computation", "date": "2020-12-11", "time": "11:00", "link": "https://www.meetup.com/Bay-Area-OWASP/events/274971224/", "timezone": "US/Pacific", "description": "<p>Multiparty Computation, or MPC for short, is a set of techniques that enable multiple parties to jointly compute a function on private data while leaking only its output. MPC has been studied for several decades, which has led to many different protocols with multiple security-performance trade-offs, as well as a large knowledge base on the theoretical limits of this technology.</p> <p>It is natural to expect something as powerful and general as MPC to be overly complicated and hard to grasp. However, it turns out that many of the core ideas used in MPC are not really that complex, and one can get a fairly solid understanding of the field by learning these concepts. The goal of this talk is to introduce the audience to what MPC is, present some basic terminology, and discuss some essential results and constructions that serve as the basis for many other practically-oriented protocols. In a bit more detail, the talk will start by introducing some essential concepts in MPC like honest and dishonest majority or passive and active security, then we will discuss what is known to be achievable and what is known to be impossible, and proceed to present some basic constructions based on additive and Shamir secret-sharing.</p> <p>---<br/>Presenter: Daniel Escudero (<a href=\"https://deescuderoo.github.io\" class=\"linkified\">https://deescuderoo.github.io</a>)</p> <p>I'm a last year PhD student at Aarhus University, Denmark, working under the supervision of Ivan Damgård. My background is in Mathematics, and my current interests are the different interactions between these and Cryptography, specially when it comes to performing computation on 'hidden' data. I am also interested in the applicability of these techniques to different real-world challenges. I also enjoy knowledge dissemination, and I am a strong believer of the existing value in making seemingly complex idea simple.</p> <p>---<br/>Co-hosted with Cryptography Meetup: <a href=\"https://www.meetup.com/Cryptography-Meetup\" class=\"linkified\">https://www.meetup.com/Cryptography-Meetup</a></p> <p>The goal of the Cryptography Meetup is to make cryptography more approachable for programmers.</p> <p>If you’re a programmer looking to explore, understand and build systems that use cryptographic algorithms, come learn with us. If you’re a cryptographer come share your knowledge with implementers.</p> <p>We start all our discussions &amp; presentations from the basics, without assuming any prior knowledge of complex mathematics or cryptographic primitives.</p> "}, {"chapter": "Orange County", "repo": "www-chapter-orange-county", "name": "Virtual Meeting: The Latest Web Application Threats Discovered and Revealed", "date": "2020-12-15", "time": "17:45", "link": "https://www.meetup.com/OWASP-OC/events/275046305/", "timezone": "US/Pacific", "description": "<p>Speaker: David Lindner, CISO, at Contrast Security</p> <p>Topic: The Latest Web Application Threats Discovered and Revealed</p> <p>Abstract:<br/>Open Web AI Security Project may be the future of application security Want to learn what the \"watch list\" of application vulnerabilities needs to be today? What's attacking known vulnerabilities on open-source code? Are you able to tie vulnerability and attack data to help prioritize your risk? Why do some applications have certain vulnerabilities and others don't? Join David Lindner, CISO, at Contrast Security as he reviews the latest in AppSec vulnerability and attack trends spelled out in the Contrast Labs Bimonthly and Yearly AppSec Intelligence Reports . In this talk, David will explain:</p> <p>- Vulnerabilities that are found in a subset of applications but absent in others</p> <p>- The numbers of attacks an application received on average</p> <p>- Prevalence of vulnerabilities versus the likelihood that they will be exploited</p> <p>- Meantime to Resolution (MTTR) in protected assets</p> <p>- A \"watch list\" of vulnerabilities that require special scrutiny</p> <p>Speaker Bio:<br/>David is an experienced Application Security Professional with over 18 years of experience in the computer security industry. During this time, David has worked within multiple disciplines in the security field, from application development, network architecture design and support, IT security and consulting, security training, and application security. Over the past 10 years, David has specialized in all things related to mobile applications and securing them. David has supported many different clients including financial, government, automobile, healthcare, and retail. In his spare time, David is seen on the golf course or honing his mobile testing skills by participating in numerous bug bounties.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/dlindner/\" class=\"linkified\">https://www.linkedin.com/in/dlindner/</a></p> <p>Twitter: @golfhackerdave</p> <p>Schedule:<br/>5:45pm: Introduction, Presentation &amp; Q&amp;A<br/>At end of meeting: Raffle (two $50 gift certificates sponsored by Contrast Security)</p> <p>Unlike our usual in-person meetings, this event is BYOB. Our meeting sponsor, Contrast Security, will provide $25 Uber Eats e-gift cards for attendees. A link to register for the Uber Eats e-gift cards will be provided during the meeting.</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP Meetup", "date": "2020-12-10", "time": "19:00", "link": "https://www.meetup.com/OWASP-STL/events/268671070/", "timezone": "US/Central", "description": ""}, {"chapter": "Suffolk", "repo": "www-chapter-suffolk", "name": "[ONLINE]OWASP Suffolk Chapter Meeting", "date": "2020-12-10", "time": "19:00", "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/274793436/", "timezone": "Europe/London", "description": "<p>AGENDA:<br/>* OWASP Suffolk Introduction, Welcome and News - WTC<br/>Welcome and an update on OWASP Projects &amp; Events from the OWASP Suffolk Chapter Leader.<br/>* Security Champions: What are the benefits to an organization - Robbie Tyrie</p> <p>About the speakers:<br/>Robbie Tyrie has 22 years experience in IT. He is worked on Y2K support. He is Anti-terrorism security expert, who worked with various global security agencies on projects such as G8, CHOGM, Olympics, Commonwealth Games.<br/>He also worked on migration credit cards from RBS platform to Tesco Bank, stool up Current Accounts a Tesco Bank, He managed procurement system at the NHS. He managed DevSec ops team at JP Morgan. He Implemented SSDLC at Clydesdale Bank &amp; Virgin Money and<br/>DB security and SSDLC at Aegon.</p> <p>Except his worked in security, he also worked as developer, systems analyst, solutions architect, infrastructure lead (Windows), DevSec Ops manager, Senior security consultant, IT Security Manager</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and get a ticket to be admitted to the event by building security - your name will be checked against the guest list.<br/>Register to attend this event at OWASP Suffolk Chapter - Meetup - RSVP to attend</p> "}, {"chapter": "Cambridge", "repo": "www-chapter-cambridge", "name": "ARU CSNRG, OWASP Cambs & BCS Cybercrime SG \"The Shadowserver Foundation\" Webinar", "date": "2020-12-15", "time": "18:00", "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/274821801/", "timezone": "Europe/London", "description": "<p>ARU CSNRG, OWASP Cambridge &amp; BCS Cybercrime Forensics \" The Shadowserver Foundation, who we are, what we do and why we love doing it!”\" Webinar</p> <p>Tuesday 15th December 18:00 – 19:30 – Online</p> <p>Hosted by the Cyber Security &amp; Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter &amp; BCS Cybercrime Forensics SG.</p> <p>Background</p> <p>OWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.</p> <p>The Cyber Security and Networking (CSN) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP &amp; the UK Cyber Security Forum amongst others. The primary aims of CSNRG are to help the UK and partner nations to tackle cybercrime, be more resilient to cyber attacks and educate its users for a more secure cyberspace and operational business environment.</p> <p>The BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.</p> <p>Speaker Biographies &amp; Abstracts</p> <p>Stewart Garrick (Law Enforcement Liaison and Operations Manager), Shadowserver Foundation. \"The Shadowserver Foundation, who we are, what we do and why we love doing it!”</p> <p>Bio: Stewart Garrick (Law Enforcement Liaison and Operations Manager)</p> <p>Shadowserver member for 5 years. Previously 30 years in UK Law Enforcement (culminating as a Senior Investigating Officer in the National Crime Agency). As career detective he worked primarily on major crime units engaged on both proactive and reactive investigations, including many high profile cybercrime cases as the senior investigator - such as the Gameover Zeus and Dridex botnet takedowns. More recently he works in LE supporting roles for the NPO, The Shadowserver Foundation. He is currently actively engaged in multiple ongoing international investigations. He understands the operational challenges and differing evidentiary restrictions and capabilities across LE worldwide. His focus is always to help LE achieve their Intelligence and evidential needs in ways they can use. Qualifications: MSc in Countering Organised Crime and Terrorism at UCL and Certified Information Systems Security Professional (CISSP).</p> <p>Abstract : “The Shadowserver Foundation, who we are, what we do and why we love doing it!”</p> <p>This presentation will give an overview of this not for profit Foundation, which has become a key component in the international fight to protect Internet users.</p> <p>The talk with give an overview of our data, how we collect it, who is entitled to it, with a look at how we use our knowledge on occasions to help Law Enforcement internationally in their fight against distant and hard to reach criminals.</p> <p>Maybe you can help too?</p> <p>NB: No investigations will be hurt in the course of this presentation!</p> <p>Provisional Agenda</p> <p>18:00 - Webinar waiting lobby opens<br/>18:15 - Presentation followed by Questions and Answers<br/>19:30 - Closing, with virtual networking</p> <p>Registration</p> <p>To register for this free event, please register online:</p> <p><a href=\"https://attendee.gotowebinar.com/register/7511229433928467981\" class=\"linkified\">https://attendee.gotowebinar.com/register/7511229433928467981</a></p> "}, {"chapter": "Hungary", "repo": "www-chapter-hungary", "name": "SAST yourcode (in CLI, webapp and VSCode) w/ grep ... Semgrep [en,yt,zoom]⌨️🌳👀", "date": "2020-12-10", "time": "20:00", "link": "https://www.meetup.com/OWASP-HU/events/274942323/", "timezone": "Europe/Budapest", "description": "<p>This virtual meetup will be live on Youtube and also an option to participate interactively in the talk over Zoom will be available.<br/>***The real YT link and Zoom room will be published later.***<br/>Beer and kitchen self-serviced. :)</p> <p>### About</p> <p>Bence and probably Yoann himself will discuss a program analysis tool they’re developing called Semgrep. It's a multilingual semantic tool for writing security and correctness queries on source code (for TS, TS/React, Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle, for Linux kernel refactoring, and later developed Semgrep while at Facebook. He’s now full time with us at r2c.</p> <p>Semgrep is a free open-source program analysis toolkit that finds bugs. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.</p> <p>For example, find subprocess calls with shell=True in Python using the query:<br/>subprocess.open(..., shell=True)<br/>This will even find snippets like:<br/>import subprocess as s<br/>s.open(f'rm {args}', shell=True)</p> <p>Or find hardcoded credentials using the query:<br/>boto3.client(..., aws_secret_access_key=”...”, aws_access_key_id=”...” )</p> <p>Duration: 45' talk/workshop + QA + chatting<br/>Language: EN</p> <p>###Moderated by</p> <p>Péter Nyilasy on behalf of OWASP HU</p> <p>### Speakers</p> <p>Bence Nagy is a software engineer at r2c, working on Semgrep, an open-source syntax-aware code search tool. At r2c, his responsibilities tend towards building various interfaces atop the core semgrep CLI. These include CI integrations, editor extensions, and the semgrep.live web app. He previously led a developer experience team at Kiwi.com, the Czech Republic’s top startup at the time of its acquisition in 2019. You should totally ask him for video game recommendations after the talk.</p> <p>Yoann Padioleau is a software engineer at r2c, and the main author of Semgrep, an open-source syntax-aware code search tool. Previously, Yoann started the AppSec, Test Engineering, and Program Analysis teams at Facebook, where he created many tools for software developers, including an ancestor of Semgrep for PHP. Before that, he was doing research in academia with a focus on developer tools. He co-created Coccinelle in 2008 with Julia Lawall, which is also an ancestor of Semgrep for C. Yoann received his PhD in Computer Science at INRIA Rennes in France. He currently lives in Italy, and loves to code and do research on stuff which makes it easier to code stuff.</p> <p>Source code: <a href=\"https://github.com/returntocorp/semgrep\" class=\"linkified\">https://github.com/returntocorp/semgrep</a><br/>Test in your browser: <a href=\"https://semgrep.live/\" class=\"linkified\">https://semgrep.live/</a></p> <p>Backup link [to be published a bit later]:<br/><a href=\"https://youtu.be/XOX\" class=\"embedded\">https://youtu.be/XOX</a></p> "}, {"chapter": "London", "repo": "www-chapter-london", "name": "[ONLINE] OWASP London Chapter Meeting ", "date": "2020-12-10", "time": "18:30", "link": "https://www.meetup.com/OWASP-London/events/274901611/", "timezone": "Europe/London", "description": "<p>The next OWASP London Chapter Meeting will be online. We will be live-streaming on the OWASP London YouTube Channel: <a href=\"https://www.youtube.com/OWASPLondon\" class=\"embedded\">https://www.youtube.com/OWASPLondon</a><br/>- please [SUBSCRIBE] to our YouTube Channel to be notified when we are Live/new videos are published.</p> <p>Event Agenda:</p> <p>18:30 Introduction, OWASP News &amp; Updates - Sam Stepanyan, Sherif Mansour &amp; Andra Lezza</p> <p>18:45 Talk 1 : \"OpenSource Intelligence (OSINT) - Getting Started\" - Siobhan Kelleher</p> <p>19:30 Q &amp; A</p> <p>19:45 Talk 2 : \"Detect complex code patterns using semantic grep\" - Grayson Hardaway</p> <p>20:30 Q &amp; A</p> <p>20:45 Closing remarks</p> <p>Talk abstracts:</p> <p>\"OpenSource Intelligence (OSINT) - Getting Started\":<br/>As security professionals we use OpenSource Intelligence (OSINT) in one way or another almost every day of our lives. This talk will focus on<br/>using OSINT to find information about people. This can be a useful skill<br/>when trying to track a malicious user from email address to home<br/>address. It is also a very important topic to discuss in user awareness<br/>training to help prevent social engineering attacks like spear phishing.<br/>Additionally, there are opportunities where you can use your analytical<br/>skills to give back leveraging OSINT.</p> <p>\"Detect complex code patterns using semantic grep\" :<br/>Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.</p> <p>SPEAKERS:</p> <p>Siobhan Kelleher<br/>Siobhan Kelleher is a Senior Security Analyst at in the<br/>education sector. She has been in IT for over 8 years and worked in both<br/>government and corporate environments before joining higher ed. Prior to her career in Information Security she worked in Business to Business<br/>sales where OSINT and Social Engineering skills were vital to creating<br/>sales leads and closing deals. She carried this knowledge with her into<br/>Information Security and it helps her better educate end users on their<br/>vulnerability to social engineering attacks. It also comes in handy when<br/>building out her holiday card list.</p> <p>Grayson Hardaway<br/>Grayson Hardaway is a security researcher at r2c, a startup working on static analysis tools purpose-built for the modern workflow. At r2c, Grayson authors static analysis tailored for finding security vulnerabilities in open source code. Previously, Grayson worked for the US Department of Defense fuzzing and exploiting obscure protocols. When not submitting patches, Grayson is hefting a heavy pack uphill, crafting guitar solos, or learning something new: currently woodworking.</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and to be admitted to the event. This is an online event and the URL to connect will be communicated to the attendees via the Meetup/EventBrite system</p> "}, {"chapter": "Norway", "repo": "www-chapter-norway", "name": "Chat with Emil Vaagland about running FINN.no's private bug bounty program", "date": "2020-12-10", "time": "19:00", "link": "https://www.meetup.com/OWASP-Norway/events/274255519/", "timezone": "Europe/Oslo", "description": "<p>Curious about how it is to run a bug bounty program? Join our chat with Emil Vaagland to get all your questions answered. He has been running FINN.no's private bug bounty program for well over a year now, and he will share all his experiences with you in a conversation with Ståle Pettersen.</p> <p>The format of this event will be an informal conversation, so questions from the audience are very welcome!</p> "}, {"chapter": "Somerset", "repo": "www-chapter-somerset", "name": "Exploring OWASP ZAP", "date": "2020-12-18", "time": "19:00", "link": "https://www.meetup.com/OWASP-Somerset-Chapter/events/273592981/", "timezone": "US/Eastern", "description": "<p>If you are not familiar with the OWASP ZAP project this is a great chance to get an introduction to a powerful, free web app scanner. If you are familiar please join and help answer any questions that attendees may have or just enjoy the opportunity to participate in the OWASP Somerset community!</p> <p>We will look at using the ZAP scanner to find vulnerabilities in web apps. This is the first part of a series on app scanning that will go from the basics to when, how, and why you may want to work with engineering teams to automate security tooling in the DevSecOps pipeline.</p> "}, {"chapter": "Peshawar", "repo": "www-chapter-peshawar", "name": "OWASP Peshawar Chapter December Meetup", "date": "2020-12-12", "time": "15:30", "link": "https://www.meetup.com/owasp-peshawar-meetup-group/events/274744976/", "timezone": "Asia/Karachi", "description": "<p>AGENDA<br/>15h00 - 15h30: OWASP Peshawar Chapter Welcome Note<br/>15h30 - 16h00: Session 1: Stating With OWASP ZAP<br/>16h00 - 18h30: Session 2: An Introduction to OWASP Testing Guide-4</p> "}]