[{"chapter": "Guayaquil", "repo": "www-chapter-guayaquil", "name": "Reunión de Planificación OWASP - GYE", "date": "2021-02-25", "time": "19:00", "link": "https://www.meetup.com/OWASP-Guayaquil-Chapter/events/276335955/", "timezone": "America/Guayaquil", "description": "<p>Reunión de Planificación Anual de Entrenamientos y Charlas - OWASP GYE</p> "}, {"chapter": "Ghana", "repo": "www-chapter-ghana", "name": "How to turn your cybersecurity hobby into career- An Introduction to Bugbounties", "date": "2021-03-15", "time": "16:00", "link": "https://www.meetup.com/OWASP-Ghana-Chapter/events/276327753/", "timezone": "Africa/Accra", "description": "<p>The event is organized by OWASP Foundation.</p> <p>How to turn your cybersecurity hobby into a career - An Introduction to Bugbounties</p> <p>The most common question I get asked. Is: “How do I get started in bug bounties” So In this presentation, I'm going to guide you and share my personal experiences on how you can get started in hunting for security bugs. We are going to dig into what tools and skills you need, what to expect, and how to avoid hunters burnout. All while trying to iron out misconceptions and avoiding common pitfalls. So join me in this inspirational presentation on how you can too turn your passion for cybersecurity into a profitable career or side business.</p> <p>Stoke can be found on Twitter: <a href=\"https://twitter.com/stokfredrik\" class=\"linkified\">https://twitter.com/stokfredrik</a></p> <p>Original even page:<br/><a href=\"https://www.eventbrite.com/e/how-to-turn-your-cybersecurity-hobby-into-a-career-an-intro-to-bugbounties-tickets-137621959987?aff=OWASPghana\" class=\"linkified\">https://www.eventbrite.com/e/how-to-turn-your-cybersecurity-hobby-into-a-career-an-intro-to-bugbounties-tickets-137621959987?aff=OWASPghana</a></p> <p>Event Sponsor, Invicti:<br/><a href=\"https://www.invicti.com/products/?utm_medium=events&amp;utm_source=tradeshow&amp;utm_campaign=i-owaspevents&amp;utm_content=210209-websitevisit-virtualevent&amp;utm_term=brand\" class=\"linkified\">https://www.invicti.com/products/?utm_medium=events&amp;utm_source=tradeshow&amp;utm_campaign=i-owaspevents&amp;utm_content=210209-websitevisit-virtualevent&amp;utm_term=brand</a></p> "}, {"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "Scale Your Security by Embracing Secure Defaults & Eliminating Bug Classes", "date": "2021-03-11", "time": "19:30", "link": "https://www.meetup.com/SGSecurityMG/events/276096528/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "Deconstructing & Deterring Solarwinds Attack: Golden SAML Attack Technique", "date": "2021-02-24", "time": "19:30", "link": "https://www.meetup.com/SGSecurityMG/events/276259206/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Jakarta", "repo": "www-chapter-jakarta", "name": "Don't feed the hippos (shut up and listen)", "date": "2021-02-27", "time": "15:00", "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/276243820/", "timezone": "Asia/Jakarta", "description": "<p>Topic :</p> <p>Don't feed the hippos (shut up and listen)</p> <p>This is about how to engage with developers as AppSec specialists / about inter-team communications. The presentation is based on a TEDex talk of Ernesto Sirolli where he talks about his experiences as aid-work volunteer in the 70s and what he learned from it.</p> <p>Where he commented on a failure as \"at least we fed the hippos\".</p> <p>Abstract:</p> <p>The security community is trying to solve insecurity caused by bugs and flaws in software for many years now, but with what success?<br/>We almost never look at successes and failures experiences in other areas, but we could really learn from them. This talk is inspired by Ernesto Sirolli’s TED talk “Want to help someone? Shut up and listen!” about failures in aid programs around the world. Listening to Ernesto Sirolli, you cannot miss the similarity with the security community trying to tell developers how to write secure code. This talk points out common failures of the security community when communicating with developers, trying to solve their problems without understanding what their problems really are.<br/>Using the hippo-analogy for resource wasted and security failures. During the talks, those ‘(in-)secure hippos’ are identified, advice on how to avoid them are provided, by anecdotes and best practices from the perience of the past 15 years in the security field of information / application security.</p> <p>Speaker:</p> <p>Martin Knobloch, Global AppSec Strategist at Micro Focus, is a long-time information security leader with more than 15 years of experience in the field. With a background in software development and architecture, his focus is on software security. Martin is actively involved in OWASP where he is a frequent contributor to various projects and initiatives, as well as a member of the Board of Directors. During his career, Martin has been a recognized teacher, guest lecturer at various universities and invited speaker and trainer at local and international software development, testing and security conferences throughout the world.</p> <p>join with us :<br/>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/93227935281?pwd=THlxcWJJOEo5QnViRW1jSmpHNEgvZz09\" class=\"linkified\">https://zoom.us/j/93227935281?pwd=THlxcWJJOEo5QnViRW1jSmpHNEgvZz09</a></p> <p>Meeting ID: 932 2793 5281<br/>Passcode: owaspjkt21</p> <p>or live stream on YouTube<br/><a href=\"https://m.youtube.com/watch?v=wRKQRTJYggI\" class=\"linkified\">https://m.youtube.com/watch?v=wRKQRTJYggI</a></p> "}, {"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "User Mode API Hooks and Bypasses", "date": "2021-03-25", "time": "20:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/276419652/", "timezone": "Europe/Copenhagen", "description": "<p>Note: THIS IS AN ONLINE EVENT! Link to stream will be released here prior to the event.</p> <p>THE TALK<br/>Security products attempt to monitor process behavior by hooking Win32 APIs in user-mode. However, as the user-mode component of APIs are loaded and owned by the current process, the process itself can inspect, overwrite or simply just not use them and use its own implementation of the API functionality, to avoid messing with the hooks altogether. This talk will give an introduction to Win32 APIs, modules, API hooks and different bypass techniques.</p> <p>THE SPEAKERS<br/>1st speaker:<br/>Magnus Stubman, Security Advisor at Improsec and former security consultant at F-Secure and Zacco.<br/><a href=\"https://www.linkedin.com/in/magnusstubman/\" class=\"linkified\">https://www.linkedin.com/in/magnusstubman/</a></p> <p>2nd speaker:<br/>To be announced.</p> <p>WHO CAN PARTICIPATE?<br/>The event is open for everyone - but it is highly technical.</p> <p>Stay tuned - more to come!</p> <p>Photo: Blake Connally, Unsplash.com</p> "}, {"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "Workshop: Elastic SIEM (4 hr)", "date": "2021-02-27", "time": "12:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/276244555/", "timezone": "Europe/Copenhagen", "description": "<p>This time around OWASP Copenhagen will host a free 4hr workshop on Elastic SIEM courtesy of David Thejl-Clayton - SOC leader of JN Data.</p> <p>The workshop is designed to get you started using it and provide you with hands-on experience with that along with MISP and TheHive, two accompaning tools which, just as Elastic, are free to use.</p> <p>Everything will be held virtually. We will provide each student with their own virtual environment. Due to practical reasons we have limited seats to this so sign up before it's too late!</p> <p>We will include a high-level description of the workshop later.</p> "}, {"chapter": "South Florida", "repo": "www-chapter-south-florida", "name": "OWASP South Florida - Fireside Chat with Zane Lackey", "date": "2021-02-24", "time": "18:00", "link": "https://www.meetup.com/South-Florida-OWASP-Chapter/events/276115983/", "timezone": "US/Eastern", "description": "<p>IMPORTANT NOTE: Due to ongoing COVID-19 public health concerns, we will be hosting this meeting online. The meeting’s URL will become visible on the meetup page after you RSVP.</p> <p>Hi all! We are very excited to announce a special fireside chat with Zane Lackey. Don't miss this event!</p> <p>***Talk***<br/>Fireside chat with Zane Lackey</p> <p>Zane Lackey is the Co-Founder of Signal Sciences (acquired by Fastly) and the Author of Building a Modern Security Program (O’Reilly Media). He serves on multiple advisory boards and is an investor in modern cybersecurity and DevOps companies. Prior to co-founding Signal Sciences, Zane lead a security team at the forefront of the DevOps/Cloud shift as CISO of Etsy.</p> "}, {"chapter": "Dallas", "repo": "www-chapter-dallas", "name": "OWASP Dallas March Meeting", "date": "2021-03-23", "time": "12:00", "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/276136637/", "timezone": "US/Central", "description": "<p>Title:</p> <p>Penetration Test at Scale: A Data-focused Approach</p> <p>Description:</p> <p>Managing a global application penetration testing program across the Enterprise poses operational challenges. Extracting and leverage meaningful data can minimize those challenges. We’ll look at some key components to consider for a successful program.</p> <p>Bio:</p> <p>Phillip Pham is an experienced cybersecurity professional with more than a decade of experience​ working in Big Four Consulting​, healthcare, financial​, and online services​ industries. Phillip has led offensive security programs and large-scale pen test engagements​. He is an Offensive Security Certified Professional (OSCP)​ and a SANS AppSec Fighter contributor​ (LinkedIn open-redirect disclosure​; DOM-based XSS in the wild).</p> "}, {"chapter": "Hartford", "repo": "www-chapter-hartford", "name": "OWASP CT @ Virtual Cybersecurity Summit 2/25-2/26", "date": "2021-02-24", "time": "09:00", "link": "https://www.meetup.com/CT-Cyber-Security-Meetup-OWASP-Hartford/events/276524161/", "timezone": "US/Eastern", "description": "<p>Hi OWASP CT:</p> <p>We'll be running a virtual booth to talk OWASP for those attending the summit as well as for our members. More details to follow.</p> <p>As the result of our attendance, our members get:<br/>Complimentary Registration:<br/>• 12+ CPE Credits with full attendance<br/>• Keynote presentations<br/>• CIO/CISO Panel Discussion<br/>• Cybersecurity expert presentations<br/>• Virtual exhibits from solution providers with chat capability</p> <p>Complimentary Registration: <a href=\"https://www.dataconnectors.com/events/2021/february/boston/?aff=OWASP\" class=\"linkified\">https://www.dataconnectors.com/events/2021/february/boston/?aff=OWASP</a></p> "}, {"chapter": "Jacksonville", "repo": "www-chapter-jacksonville", "name": "OWASP Monthly Online meeting ", "date": "2021-03-08", "time": "19:00", "link": "https://www.meetup.com/OWASP-Jacksonville-Chapter/events/276173087/", "timezone": "US/Eastern", "description": "<p>The OWASP Foundation came online on December 1st, 2001 it was established as a not-for-profit charitable organization in the United States on April 21, 2004, to ensure the ongoing availability and support for our work at OWASP. OWASP is an international organization and the OWASP Foundation supports OWASP efforts around the world. OWASP is an open community dedicated to enabling organizations to conceive, develop, acquire, operate, and maintain applications that can be trusted. All of the OWASP tools, documents, forums, and chapters are free and open to anyone interested in improving application security. We advocate approaching application security as a people, process, and technology problem because the most effective approaches to application security include improvements in all of these areas. We can be found at www.owasp.org.</p> "}, {"chapter": "Kansas City", "repo": "www-chapter-kansas-city", "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting", "date": "2021-03-22", "time": "18:00", "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccfbdc/", "timezone": "US/Central", "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "}, {"chapter": "Nashville", "repo": "www-chapter-nashville", "name": "OWASP Threat and Safeguard Matrix (TaSM)", "date": "2021-03-02", "time": "19:00", "link": "https://www.meetup.com/OWASP-Nashville-Chapter/events/276453229/", "timezone": "US/Central", "description": "<p>The Threat and Safeguard Matrix or (TaSM)(<a href=\"https://owasp.org/www-project-threat-and-safeguard-matrix/\" class=\"linkified\">https://owasp.org/www-project-threat-and-safeguard-matrix/</a>) is an action oriented view to safeguard and enable the business created by Ross Young. Simply put if Cyber is in the business of Revenue Protection, then we need to have a defense in depth plan to combat the biggest threats to our companies. This matrix allows a company to overlay their major threats with the NIST Cyber Security Functions (Identify, Protect, Detect, Respond, &amp; Recover) to build a robust security plan. Organizations which perform this activity will gain a better understanding of how to protect their company as they fill in safeguards which mitigate important threats. Remember the devil is in the details, hence why we chose a TaSManian Devil as the project logo.</p> <p>Ross Young is the CISO of Caterpillar Financial, a lecturer at Johns Hopkins University, and a SANS instructor. Prior to this role, he was a divisional CISO at Capital One. His expertise ranges from attacking financial services for the federal government to defending organizations by automating defenses in DevSecOps pipelines. He is actively involved in all things cloud, container, and Kubernetes security. Ross holds master's and bachelor's degrees from Johns Hopkins University, Idaho State University, and Utah State University. Ross's interest in pirates and ninjas have inspired him to stealthily enable and safeguard the business without the paperwork.</p> "}, {"chapter": "Orange County", "repo": "www-chapter-orange-county", "name": "Virtual Meeting: Building Secure React Applications & Job Hunting during Covid19", "date": "2021-02-25", "time": "17:30", "link": "https://www.meetup.com/OWASP-OC/events/276449987/", "timezone": "US/Pacific", "description": "<p>Speaker: Ron Perris, Secure Code Trainer</p> <p>Topic: Building Secure React Applications</p> <p>Abstract:<br/>We will look at a modern React application and demonstrate a couple vulnerabilities and how to fix them. We will also discuss techniques for automatically detecting these issues during development. If you are working in a company with React applications or just JavaScript in general - this is the talk for you.</p> <p>Speaker Bio:<br/>Ron Perris is a former Software Engineer on the npm, Inc. security team, the world's largest registry for software packages. He has been working in software security since 2005. Ron's past contributions to OWASP include founding OWASP AppSec California, leading the Orange County Chapter, edits to key OWASP Cheatsheets and the OWASP Application Security Verification Standard. Ron currently trains developers globally on secure coding techniques through virtual training and online courses. Ask him questions on twitter @ronperris</p> <p>Twitter: @ronperris</p> <p>---------------</p> <p>Speaker: Lori Barfield, Founder of RaiseMe</p> <p>Topic: Job Hunting during Covid-19</p> <p>Abstract:<br/>Many technology professionals who thought they had stable jobs suddenly found themselves furloughed as a result of COVID-19. This talk is for those people as well as for people who are considering taking a long term hiatus for personal reasons. In this talk they will find advice on how to stay relevant during their time off and then return to their professional careers with marketable skills and a new perspective. Special emphasis is on security careers, whether the attendees are already in a security-related roles or want to re-career into them.</p> <p>In this COVID-19 era, we need to build a new perspective for the new normal. Careers are radically changing due to the pandemic and we need to adapt. Some industries and companies are thriving; others are on the decline. The most important advice we can give is that you should have a plan for your hiatus that leaves you at the base step of a new career once you are ready to return to work.</p> <p>Speaker Bio:<br/>Lori joined her first Internet startup as a senior system administrator. When that company went public, she was hooked, and helping smaller firms prevail against well established rivals has been her passion ever since. She is currently a consulting C*O and a chair at the SCaLE and ShellCon conferences in Southern California. In 2017 she developed the unique RaiseMe career consulting effort at ShellCon.</p> <p>Lori is also a mother of five. With the kids, the dog, and a horse, she is grateful for a full and happy home. And the occasional escape to the woods with her husband.</p> <p>Twitter: @itdirector<br/>LinkedIn: <a href=\"https://www.linkedin.com/in/vpglobalops/\" class=\"linkified\">https://www.linkedin.com/in/vpglobalops/</a></p> <p>Schedule:<br/>5:30 pm: Introduction<br/>5:35 pm: Secure React Applications<br/>6:20 pm: Job Hunting during Covid-19<br/>7:00~pm: Raffle</p> <p>Synopsys has donated two gift cards to be raffled off at the end of the meeting. A raffle entry form will be published during the meeting.</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2021-03-25", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqyccfbhc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "API security and the API Top 10", "date": "2021-02-25", "time": "12:00", "link": "https://www.meetup.com/owasptriangle/events/lckdnqyccdbhc/", "timezone": "US/Eastern", "description": "<p>Joe Schottman joins us to talk API Security and the API Security Top 10.</p> "}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "February 2021 Chapter Meeting", "date": "2021-02-25", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/276175006/", "timezone": "US/Mountain", "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA</a>) to suggest any additional topics.</p> <p>---------------------------------------------<br/>Agenda:<br/>12 - 12:50pm<br/>- Agenda:<br/>Open Forum: Automated tooling in the Dev Pipeline or SDLC…<br/>- DAST<br/>- SAST<br/>- SCA (software component analysis)<br/>- What's working for you? Which type of scan are you prioritizing?</p> <p>12:50 - 1pm<br/>- Open Forum, Admin Items, Upcoming Events<br/>- Announce speaker for coming meetup<br/>---------------------------------------------</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC February 2021 Chapter Meeting<br/>Time: Feb 25, 2021 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/96727240889?pwd=ZG9hUDdrdzhmSzhVUjRJejB6ajZZZz09\" class=\"linkified\">https://zoom.us/j/96727240889?pwd=ZG9hUDdrdzhmSzhVUjRJejB6ajZZZz09</a></p> <p>Meeting ID: 967 2724 0889<br/>Passcode: 172478<br/>One tap mobile<br/>+13462487799,,96727240889# US (Houston)<br/>+16699006833,,96727240889# US (San Jose)</p> <p>Dial by your location<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 312 626 6799 US (Chicago)<br/>+1 929 436 2866 US (New York)<br/>+1 301 715 8592 US (Washington DC)<br/>Meeting ID: 967 2724 0889<br/>Find your local number: <a href=\"https://zoom.us/u/adqd3k6bUC\" class=\"linkified\">https://zoom.us/u/adqd3k6bUC</a></p> "}, {"chapter": "Bangalore", "repo": "www-chapter-bangalore", "name": "Moving to a different Meetup Group", "date": "2021-02-28", "time": "19:00", "link": "https://www.meetup.com/OWASP-Bangalore-Chapter/events/276065123/", "timezone": "Asia/Calcutta", "description": "<p>Hi Team,</p> <p>We are moving to a different meet-up group by 28th <a href=\"https://www.meetup.com/bangalore-owasp-meetup-group\" class=\"linkified\">https://www.meetup.com/bangalore-owasp-meetup-group</a></p> "}, {"chapter": "London", "repo": "www-chapter-london", "name": "OWASP London [ONLINE] Chapter Meeting", "date": "2021-03-04", "time": "18:30", "link": "https://www.meetup.com/OWASP-London/events/276528857/", "timezone": "Europe/London", "description": "<p>The next OWASP London Chapter Meeting will be online. We will be Live-Streaming on the OWASP London YouTube Channel: <a href=\"https://www.youtube.com/OWASPLondon\" class=\"embedded\">https://www.youtube.com/OWASPLondon</a></p> <p>- please [SUBSCRIBE] to our YouTube Channel to be notified when we are Live/new videos are published.</p> <p>You can ask questions using YouTube Q&amp;A tool and <a href=\"https://sli.do/OWASP\" class=\"linkified\">https://sli.do/OWASP</a></p> <p>AGENDA:</p> <p>- Introduction, OWASP News &amp; Updates - Sam Stepanyan, Sherif Mansour &amp; Andra Lezza</p> <p>- Talk 1 : \"Teaching the OWASP Top 10 to Beginning Developers\" - Olivia Liddell</p> <p>- - Talk 1 Q &amp; A</p> <p>- Talk 2 : \"Finding Your Next Bug: GraphQL Hacking\" - Katie Paxton-Fear</p> <p>- - Talk 2 Q &amp; A</p> <p>TALK ABSTRACTS</p> <p>\"Teaching the OWASP Top 10 to Beginning Developers\" - Olivia Liddell</p> <p>For beginning developers who are starting to learn the basics of coding, learning about application security can often feel daunting and overwhelming. To make this process easier, Olivia has created a workbook that beginning developers can use to supplement their study of the OWASP Top 10. Olivia will discuss best practices for teaching security concepts to beginners. She will also cover the approaches that she took in developing her workbook as well as the results of the workbook’s pilot test and some ideas for future development.</p> <p>\"Finding Your Next Bug: GraphQL Hacking\" - Katie Paxton-Fear</p> <p>GraphQL is becoming the next big API technology for developers, but with new technology comes new risk, and for us that means bug bounties! In this talk you will learn everything GraphQL, from how it works to what kind of bugs are common.</p> <p>SPEAKERS:</p> <p>OLIVIA LIDDELL (@oliravi)</p> <p>Olivia Liddell is a Technical Curriculum Developer at Amazon Web Services (AWS), where she creates training courses for AWS Cloud fundamentals. Previously, Olivia worked as a middle school teacher in Chicago Public Schools and as an educational technology consultant to support various colleges and universities. She frequently speaks at conferences on topics such as mentoring, team building, and social engineering.</p> <p>KATIE PAXTON-FEAR (@InsiderPhD)</p> <p>Katie is a Lecturer in Cyber Security at Manchester Metropolitan University, however, in her free time, she's a bug bounty hunter and an educational YouTuber. She started out hacking in June 2019 during a HackerOne mentorship program and now hopes to be a mentor to others, creating educational cyber security videos on YouTube. In her videos, she attempts to bridge the gap between \"I know what bug bounties are\" and \"bug bounty hunter\" giving advice specifically tailored to bug hunting. She's now produced over 50 videos on bug bounty hunting for an audience of over 25,000 YouTube subscribers. Aimed at a beginner audience these go from finding your first bug, to how to use specific tools, to how to find specific bug classes.<br/>Katie has discovered and responsibly reported security vulnerabilities to several large organisations such as Verizon Media and the US Department of Defense</p> "}, {"chapter": "Norway", "repo": "www-chapter-norway", "name": "Google's Differential Privacy Library – Mirac Vuslat Basaran (Google)", "date": "2021-03-17", "time": "19:00", "link": "https://www.meetup.com/OWASP-Norway/events/276469937/", "timezone": "Europe/Oslo", "description": "<p>Differential privacy helps organizations derive insights from data while simultaneously ensuring that those results do not allow any individual's data to be distinguished or re-identified. Sound interesting?<br/>Come hear Mirac Vuslat Basaran (Google) talk about Google's Differential Privacy Library!</p> <p>We will start with a brief introduction to differential privacy and why it might be useful for you. Then, we will go through what kind of tools and functionalities Google's Differential Privacy Library supports such as secure noise implementations, different aggregations, end-to-end systems that require only minimal knowledge of differential privacy, etc.<br/>Finally, we'll talk about future plans for the library.</p> <p>We'll finish with a short Q&amp;A.</p> <p>Mirac is a Software Engineer in the area of anonymization and differential privacy at Google. Before joining Google, he studied Computer Engineering (and Economics) at Bilkent University. Currently, he helps build and open source infrastructure for product teams to anonymize their data. He also consults product teams on anonymization and differential privacy.</p> <p>URL to Google's Differential Privacy Library:<br/><a href=\"https://github.com/google/differential-privacy\" class=\"linkified\">https://github.com/google/differential-privacy</a></p> "}, {"chapter": "Nashua", "repo": "www-chapter-nashua", "name": "Chapter Meeting - March 2021", "date": "2021-03-08", "time": "18:00", "link": "https://www.meetup.com/OWASP-Nashua-Chapter/events/276497683/", "timezone": "US/Eastern", "description": "<p>Hello Nashua Members!</p> <p>For this upcoming virtual meeting, I'll be talking about what OWASP Foundation is doing this year and what we're hoping to achieve. Traditionally OWASP runs several conferences a year, but with the pandemic, we've switched to virtual events with mixed success.</p> <p>We also have some housekeeping items to do. As you may know, I was elected to the OWASP Global Board of Directors and am serving as the Secretary for 2021. In addition, I also volunteer as the Nashua Chapter Leader, and I am on the 2021 Training Planning Committee, and I am on the Compliance Committee, and I am on the Trademark Board Committee, and I am on the Policy Review Committee.</p> <p>That's a lot of volunteering and I need some help.</p> <p>Chapters are now required to have at least two leaders, so I need at least one more of you to step up as a chapter leader for Nashua (we can have a max of five I believe). The role entails setting up meetings and finding speakers for them. Pretty easy stuff! As a Chapter Leader, you'll get discounts on OWASP events. If I can't get one more person to volunteer as a Chapter Leader, then OWASP will shut down our chapter.</p> <p>Next, for OWASP global events, we are always looking for reviewers of submissions. We get people who want to give talks and trainings at our events and as a reviewer, you would be asked to read their proposal and score it. It takes roughly 10 minutes per submission. In return, you get a discount on the event. Drop me a line if you're interested in doing this in the future and I'll add you to the list.</p> <p>I look forward to seeing all of you, and especially those of you that have recently joined.</p> <p>You can reach out to me directly with any questions: bil.corry@owasp.org</p> <p>Best regards,</p> <p>- Bil</p> "}, {"chapter": "Karachi", "repo": "www-chapter-karachi", "name": "OWASP Mobile App Sec", "date": "2021-02-27", "time": "19:00", "link": "https://www.meetup.com/OWASP-Karachi-Chapter/events/276516990/", "timezone": "Asia/Karachi", "description": "<p>As mobile apps are becoming popular these days, we would love to bring one session on Mobile App Sec. Make sure you add it to your calendar.</p> <p>Details would be updated as and when event date approaches.</p> "}, {"chapter": "Croatia", "repo": "www-chapter-croatia", "name": "Chapter Croatia Virtual Meetup - SecureBank project and SolarWinds compromise", "date": "2021-02-25", "time": "19:00", "link": "https://www.meetup.com/OWASP-Croatia-Meetup-Group/events/276266278/", "timezone": "Europe/Zagreb", "description": "<p>Hello Everyone,</p> <p>For this quarter's OWASP Croatia meetup, we have 2 topics that will be delivered virtually (Over Google Meet):</p> <p>* Milan Gabor, Gregor Spagnolo: Putting OWASP Maribor on the map with SecureBank<br/>* Vanja Svajcer: SolarWinds compromise - lessons learned<br/>* Chill and Chat - Stay a while and chat with others from OWASP Croatia</p> <p>See you!</p> <p>Talk abstracts and bio's follow:</p> <p>----------<br/>Milan Gabor, Gregor Spagnolo: Putting OWASP Maribor on the map with SecureBank</p> <p>COVID-19 is not always a bad thing. During this period, we managed to revive Slovenian part of OWASP and even applied and got accepted our first OWASP project. SecureBank is deliberately broken bank with all of OWASP TOP 10 mistakes. Written in .Net Core and with full access to the source code. How did we do it, what stood in our way and how it can help you will be main topic of our presentation.</p> <p>Bios:<br/>Milan Gabor is OWASP freak with long history of breaking all kind of applications, systems and people. He enjoys playing with all sort of security related topics and dreams about paragliding.</p> <p>Gregor Spagnolo is a g33k who loves to break all kinds of stuff. He is a passionate developer but even more passionate breaker. He has extensive knowledge in secure application development and lifecycle.</p> <p>----------</p> <p>Vanja Svajcer: SolarWinds compromise - lessons learned</p> <p>Abstract:<br/>Supply chain attacks have a reputation for being difficult to execute for both attackers and defenders. They are typically attributed to top level actor groups and are reserved for attacking only the highest profile targets.</p> <p>SolarWinds compromise at the end of 2020 displayed full potential of supply chain attacks, with the complex attack chain starting with the compromised SolarWinds Orion build process, including malicious source code injection, implanted backdoor, C2 DGA based communication protocol and secondary payload implementation.</p> <p>In this session we will look at the details of the compromise and describe attackers's TTPs keeping in mind they have not been discovered for more than half a year after the initial compromise. We will conclude with a list of items red and blue team members could have learned from it and propose steps that can be implemented to prevent and detect similar attacks.</p> <p>Bio:<br/>Vanja Svajcer works as a Threat researcher for Cisco Talos Threat Intelligence organisation.</p> <p>Vanja enjoys tinkering with automated analysis systems, reversing binaries and Android malware. He thinks time spent scraping telemetry data for signs of new attacks is well worth the effort.</p> <p>In his free time, he is trying to improve on his piano and guitar playing skills and often plays basketball, which at his age is not a recommended activity.</p> "}]