[{"chapter": "Las Vegas", "repo": "www-chapter-las-vegas", "name": "Secure Coding CTF Tournament", "date": "2020-10-22", "time": "16:00", "link": "https://www.meetup.com/OWASP-Las-Vegas-Chapter/events/273749267/", "timezone": "US/Pacific", "description": "<p>Secure Coding CTF Tournament</p> <p>Date: Thursday, October 22, 2020</p> <p>Time: 4:00pm - 6:00pm (Pacific Time)</p> <p>REGISTRATION IS REQUIRED: <a href=\"https://discover.securecodewarrior.com/OWASPLasVegas-tournament.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPLasVegas-tournament.html</a></p> <p>Description:<br/>CTF with Secure Code Warrior<br/>Twitter - @SecCodeWarrior<br/>LinkedIn – <a href=\"https://www.linkedin.com/company/secure-code-warrior\" class=\"linkified\">https://www.linkedin.com/company/secure-code-warrior</a><br/>Facebook – <a href=\"https://www.facebook.com/securecodewarrior/\" class=\"linkified\">https://www.facebook.com/securecodewarrior/</a></p> <p>Secure Coding CTF Tournament<br/>Capture the Flag for Developers/Pentesters</p> <p>Improve your secure coding skills by joining our live Secure Code Warrior tournament. The tournament allows you to compete against the other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability.</p> <p>All challenges are based on the OWASP Top 10, and players can choose to compete in a range of software languages including Java EE, Java Spring, C# MVC, C# WebForms, Go, Ruby on Rails, Python Django &amp; Flask, Scala Play, Node.JS, React, and both iOS and Android development languages.</p> <p>Throughout the tournament, players earn points and watch as they climb to the top of the leaderboard. Prizes will be awarded to the top finishers! First place will receive a hoodie, and lots of bragging rights!</p> "}, {"chapter": "Uruguay", "repo": "www-chapter-uruguay", "name": "Requerimientos de seguridad y cómo probarlos [OWASP (A/MA)SVS y (W/M)STG ]", "date": "2020-11-05", "time": "19:00", "link": "https://www.meetup.com/OWASP-Uruguay-Chapter/events/273937682/", "timezone": "America/Montevideo", "description": "<p>En esta Meetup virtual les contaremos sobre dos proyectos de OWASP que nos permitirán definir niveles de seguridad para nuestras aplicaciones, así como requerimientos a cumplir, tareas a realizar durante el desarrollo de una aplicación y como podemos probar el cumplimiento de dichos requerimientos.</p> <p>OWASP ASVS / MASVS: el Estándar de Verificación de Seguridad de Aplicaciones y el Estándar de Verificación de Seguridad de Aplicaciones Móviles (MASVS) de OWASP son, como su nombre lo indica, estándares para la seguridad de aplicaciones web y móviles, respectivamente.</p> <p>Pueden ser utilizado por arquitectos, desarrolladores y testers de software que buscan desarrollar aplicaciones seguras, pero también puede ser utilizado por los expertos en seguridad para comprobar el nivel de seguridad, para garantizar la integridad y la coherencia de los resultados de las pruebas, dependiendo de si participaron en el proceso de desarrollo. Además, puede ser utilizado por una empresa para establecer un nivel de seguridad y las tareas a realizar por la empresa que le desarrolla sus aplicaciones.</p> <p>OWASP WSTG / MSTG: la Guía de Pruebas de Seguridad Web (WSTG) y la Guía de Pruebas de Seguridad Móvil (MSTG) de OWASP son manuales completos de pruebas de seguridad en aplicaciones web y móviles. Estos proyectos proporcionan a los desarrolladores, testers y expertos en seguridad casos de prueba detallados para el análisis tanto estático como dinámico, algunas herramientas recomendadas y podría ayudarnos a realizar ingeniería inversa y a manipular una aplicación móvil.</p> <p>Les contaremos cómo utilizar ambos proyectos para mejorar la seguridad en sus proyectos web y móviles.</p> "}, {"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "A pentester's guide to Kubernetes Security", "date": "2020-11-11", "time": "19:30", "link": "https://www.meetup.com/SGSecurityMG/events/273202471/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Jakarta", "repo": "www-chapter-jakarta", "name": "Coded World - My Cheatsheet", "date": "2020-10-28", "time": "10:30", "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/274059946/", "timezone": "Asia/Jakarta", "description": "<p>Software yang tidak aman telah mengancam infrastruktur keuangan, kesehatan, pertahanan, energi, dan infrastruktur penting lainnya. Dengan semakin kompleks dan terhubungnya infrastruktur digital kita, kesulitan mencapai keamanan aplikasi meningkat secara eksponensial. Open Web Application Security Project (OWASP) yang merupakan komunitas terbuka yang didedikasikan untuk memungkinkan organisasi mengembangkan, membeli, dan memelihara aplikasi yang dapat dipercaya. Di OWASP sendiri, anda akan menemukan free and open…<br/>• Tool dan standar keamanan aplikasi<br/>• Buku tentang uji keamanan aplikasi, pengembangan kode aman, dan review kode keamanan<br/>• Kendali keamanan dan pustaka standar<br/>• Cabang lokal di seluruh dunia<br/>• Riset terkini<br/>• Konferensi lengkap di seluruh dunia<br/>• Mailing list<br/>• Dan banyak lagi … di www.owasp.org</p> <p>Kali ini OWASP feat. Junior Lazuardi<br/>(Principal Consultant, ITSEC Asia)<br/>akan membahas :</p> <p>Coded World - My Cheatsheet</p> <p>Abstrack:<br/>Software, algorithms, and specifically crafted services are eating the world, let's take a byte! In this session, I'll share my notes on interesting cyber and economic programmes (particularly in Indonesia), and my tips to keep up with it.</p> <p>PS: Your mileage may vary, yet you should not walk alone.<br/>---<br/>Short bio :</p> <p>Junior Lazuardi is currently working with ITSEC Asia to solve problems faced by corporates in dealing with Cyber Attack and Fraud. Previously, he had IT audit, project and software assurance experiences in Indonesia Stock Exchange and its members (while also learning how people trade securities, and security, for economic reasons). Friends from OWASP Indonesia introduced cyber security into his software/system engineering career, and volunteering for ISACA Indonesia improved his skillset in program development and \"networking\". He tunes in regularly for contents on cyber risk quantification, digital economy, and the fascinating TV series \"Chasing Ocean Giants\".</p> <p>Waktu dan Tempat :<br/>28th October 10:30 - 11:00 WIB</p> <p>Catatan :<br/>- Peserta online menggunakan aplikasi Zoom di komputer / laptop / tablet / smartphone<br/>- Acara ini free for everyone<br/>- Password untuk join meeting akan dikirim kan kepeserta setelah register</p> <p>Venue :<br/>Online by zoom</p> <p>Support our Conference<br/>OWASP AppSec Indonesia 2020</p> "}, {"chapter": "Bhopal", "repo": "www-chapter-bhopal", "name": "OWASP BHOPAL MEETUP - OCTOBER ", "date": "2020-10-25", "time": "16:00", "link": "https://www.meetup.com/OWASP-Bhopal-Chapter/events/273957827/", "timezone": "Asia/Calcutta", "description": "<p>As Owasp Bhopal Community we have come up with Oct-2020 Monthly meet for the Community.</p> <p>There are two sessions proposed for this virtual OWASP meetup-</p> <p>1. API Testing By Vedant Jain (1600-1700 IST)</p> <p>2. Dom based XXS by Divyanshu Diwakar (1700-1800)</p> <p>Post the meetup we will have a Q&amp;A session regarding talks. Also, we are going to have an open discussion on making this OWASP chapter Bigger &amp; Better</p> <p>It will be a fully virtual meetup and the details Regarding The virtual platform will be communicated on the day of the meetup.</p> "}, {"chapter": "Santa Barbara", "repo": "www-chapter-santa-barbara", "name": "Live Hacking an API with InsiderPhD/Katie", "date": "2020-10-30", "time": "18:00", "link": "https://www.meetup.com/Santa-Barbara-OWASP-Chapter/events/273896117/", "timezone": "US/Pacific", "description": "<p>NOTE: You need to RSVP in order to get the link the day of the event.</p> <p>After a little break we're resuming our ~monthly OWASP Santa Barbara events and as usual we're keeping these rather technical. In this case we'll have Katie Paxton-Fear (@InsiderPhD) giving a live and interactive presentation on API hacking.</p> <p>### Event Agenda (PST timezone) ###<br/>06.00 pm -- Event Kickoff &amp; Announcements, by Walter Martín Villalba, OWASP SB Leader / <a href=\"https://twitter.com/act1vand0\" class=\"linkified\">https://twitter.com/act1vand0</a><br/>06.15 pm -- Presentation: Live Hacking an API, by Katie Paxton-Fear / <a href=\"https://twitter.com/InsiderPhD\" class=\"linkified\">https://twitter.com/InsiderPhD</a><br/>07.15 pm -- Closing Remarks</p> <p>Abstract:</p> <p>APIs are everywhere, especially with the rise of mobile and IOT devices and they are my FAVOURITE things to hack. Why? Because they are full of security flaws! From your online banking to your IOT fridge and your government agency, are full of actually quite simple bugs. Now I'm a Bug Bounty hunter, I love a good- er bad API, with impactful bugs.</p> <p>In this demo I'll take you through how to hack an API and show you real security flaws in organisations, some of which I've found personally, in products you've heard of! We'll cover IDORs/BOLAs, information disclosure, account takeovers, injection + more! Showing how even the simplest of software issues, a missing if statement, can snowball into a major security breach. This is an interactive session and I'll be asking the audience to help give me ideas on how to approach the API!</p> <p>-- Stream: TBD.<br/>-- Chat: #chapter-santa-barbara channel on <a href=\"https://owasp.slack.com/\" class=\"linkified\">https://owasp.slack.com/</a>. If you don't have an account, create one at <a href=\"https://owasp-slack.herokuapp.com/\" class=\"linkified\">https://owasp-slack.herokuapp.com/</a>.</p> <p>Martín &amp; the OWASP SB Team.</p> <p>PS: if you've been enjoying our frequent events since the relaunch in late 2018, please take a minute to rate our group on meetup.com.</p> "}, {"chapter": "Austin", "repo": "www-chapter-austin", "name": "October 2020 Chapter Meeting", "date": "2020-10-27", "time": "11:55", "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/273845168/", "timezone": "US/Central", "description": "<p>Title:<br/>Mobile Security in a Remote World</p> <p>Attacks on the endpoint are no longer limited to traditional endpoints like laptops and workstations; mobile devices have been ranked the #1 hardest enterprise asset to defend. Compounded by bring-your-own device policies, enterprises are struggling to protect themselves against a growing variety of mobile threats. In this session, we will dive into the challenges with securing mobile in the enterprise security space and the evolution of mobile device security. Join us to learn about why attackers are shifting to target mobile, validated by investigations from the Cybereason Nocturnus team, and how the enterprise security industry is moving to address them.</p> <p>Speaker:<br/>Allie Mellen has spent the past decade in engineering, development, and technical consulting roles at multiple venture-backed startups, as well as research roles at MIT and Boston University. Her passion is combining technology and entrepreneurship, having run her own successful iOS development company out of college and been an investment partner at a venture fund investing in student-run startups. She has worked with multiple nonprofits to teach engineering to students and minorities, including the Global App Initiative and WISP, and has mentored business students at Hult Business School. She received her B.S. degree in Computer Engineering, and has been recognized worldwide for her security research at conferences like Black Hat USA, DEFCON, HOPE, and others. She is now a security strategist in the Office of the CSO at Cybereason, where she is a frequent speaker at security conferences globally teaching about security and pushing the boundaries of the industry.</p> "}, {"chapter": "Hartford", "repo": "www-chapter-hartford", "name": "OWASP @ BSides CT (Virtual)", "date": "2020-11-13", "time": "09:00", "link": "https://www.meetup.com/CT-Cyber-Security-Meetup-OWASP-Hartford/events/273798670/", "timezone": "US/Eastern", "description": "<p>Schedule TBD</p> <p>Workshops:<br/>11/13 : Sign up for the Red Hat Ansible Workshop here.<br/>11/14 : Sign up for the Lock Picking workshop here.</p> <p>Registration: $5-$20<br/><a href=\"https://www.eventbrite.com/e/bsides-ct-2020-tickets-124263959849\" class=\"linkified\">https://www.eventbrite.com/e/bsides-ct-2020-tickets-124263959849</a></p> <p>Security BSides is a community-driven framework used to build events for and by information security community members, events where individuals have opportunities to both present and participate in an intimate atmosphere that encourages collaboration. It is an intense experience designed to expand the spectrum of conversation beyond the traditional confines of space and time with discussions, demos, and participant interaction. It’s where conversations on the next big thing are happening</p> "}, {"chapter": "Minneapolis St Paul", "repo": "www-chapter-minneapolis-st-paul", "name": "October meeting: Securing Infrastructure as Code", "date": "2020-10-29", "time": "19:00", "link": "https://www.meetup.com/OWASP-MSP-Meetup/events/273422662/", "timezone": "US/Central", "description": "<p>Join us for a lively discussion of Infrastructure as Code (IaC), the hot<br/>new way to configure the Cloud. We'll cover:</p> <p>* Best practices<br/>* Testing and Validation for IaC<br/>* Remediation<br/>* Fitting IaC into the App Sec PIpeline<br/>* Immutable infrastructure<br/>* Is it Security Architecture or Secure Coding?</p> <p>So get your head out of the Cloud for a couple of hours and get ready<br/>for some down-to-earth information exchange.</p> <p>Due to COVID-19 restrictions, this will be an online event.</p> "}, {"chapter": "Nashville", "repo": "www-chapter-nashville", "name": "OWASP Nashville October Meetup: Defending Multicloud Infrastructure", "date": "2020-10-27", "time": "18:29", "link": "https://www.meetup.com/OWASP-Nashville-Chapter/events/273520924/", "timezone": "US/Central", "description": "<p>Join Senior Application Security Engineer at Asurion and Instructor for the SANS Institute Brandon Evans at OWASP Nashville's next online Meetup. Brandon will discuss how to defend infrastructure and applications running in Amazon Web Services (AWS), Microsoft Azure, and the Google Cloud Platform (GCP).</p> <p>Brandon is the lead author of SANS SEC510: Multicloud Security Assessment and Defense. For more information, visit: SANS.org/SEC510</p> "}, {"chapter": "Orange County", "repo": "www-chapter-orange-county", "name": "Virtual Meeting: Practical DevSecOps", "date": "2020-10-29", "time": "17:45", "link": "https://www.meetup.com/OWASP-OC/events/273938316/", "timezone": "US/Pacific", "description": "<p>Speaker: Jeff Williams, Co-Founder and CTO at Contrast</p> <p>Topic: Practical DevSecOps</p> <p>Abstract:<br/>The traditional “outside in” scanning, pentesting, and firewalling approach slows down delivery pipelines and creates massive security backlog. We need a new approach to security that accelerates the delivery of value to customers. In this talk, Jeff will present a proven approach to both shifting left into development *and* extending right into operations. We’ll discuss the “three ways” of security and talk about the elements of a healthy appsec lifestyle. We’ll discuss a practical way to break down the threat model and get the most important security work flowing effectively, how to establish tight security feedback loops and communication channels, and how to create a culture of security experimentation and learning.</p> <p>Speaker Bio:<br/>Jeff brings more than 20 years of security leadership experience as co-founder and Chief Technology Officer of Contrast Security. He recently authored the DZone DevSecOps, IAST, and RASP refcards and speaks frequently at conferences including JavaOne (Java Rockstar), BlackHat, QCon, RSA, OWASP, Velocity, and PivotalOne. Jeff is also a founder and major contributor to OWASP, where he served as Global Chairman for 9 years, and created the OWASP Top 10, OWASP Enterprise Security API, OWASP Application Security Verification Standard, XSS Prevention Cheat Sheet, and many more popular open source projects. Jeff has a BA from Virginia, an MA from George Mason, and a JD from Georgetown.</p> <p>LinkedIn: <a href=\"https://www.linkedin.com/in/planetlevel/\" class=\"linkified\">https://www.linkedin.com/in/planetlevel/</a></p> <p>Twitter: planetlevel</p> <p>NOTE: Due to the continuing health concerns relating to the spread of the coronavirus disease (COVID-19), we will be meeting virtually until further notice.</p> <p>A raffle will be conducted at the end of the meeting for gift cards provided by Contrast Security. Instructions for entering the raffle will be provided during the meeting.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2020-10-29", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqybcnbmc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP Meetup - CTF", "date": "2020-11-06", "time": "19:00", "link": "https://www.meetup.com/OWASP-STL/events/268671065/", "timezone": "US/Central", "description": "<p>Capture the Flag (CTF) is a computer security competition. CTF contests are usually designed to serve as an educational exercise to give participants experience in securing a machine, as well as conducting and reacting to the sort of attacks found in the real world. Reverse-engineering, network sniffing, protocol analysis, system administration, programming, and cryptanalysis.</p> <p>* This will be an open CTF which means this is open book. You may use any tool or internet accessible resource: Burpsuite, IDE, Metasploit, etc.</p> <p>* Work in single or 2 person teams</p> <p>* Be the person/team with the most challenges completed to win (time will determine a tie)</p> "}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "October Virtual Chapter Meeting", "date": "2020-10-29", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/273669025/", "timezone": "US/Mountain", "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA</a>) to suggest any additional topics.</p> <p>Agenda:<br/>12 - 12:45pm<br/>- Discussion (TBD)</p> <p>12:45 - 1pm<br/>Open Forum, Admin Items, Choose next Guest Speaker</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC/Wasatch AppSec - October Chapter Meeting<br/>Time: Oct 29, 2020 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/98770637269?pwd=ekFnVHA3aW03TXkwbFFxKzQ3RUlZdz09\" class=\"linkified\">https://zoom.us/j/98770637269?pwd=ekFnVHA3aW03TXkwbFFxKzQ3RUlZdz09</a></p> <p>Meeting ID: 987 7063 7269<br/>Passcode: 020827<br/>One tap mobile<br/>+16699006833,,98770637269# US (San Jose)<br/>+12532158782,,98770637269# US (Tacoma)</p> <p>Dial by your location<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 929 436 2866 US (New York)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>Meeting ID: 987 7063 7269<br/>Find your local number: <a href=\"https://zoom.us/u/aUsjImmBw\" class=\"linkified\">https://zoom.us/u/aUsjImmBw</a></p> "}, {"chapter": "Israel", "repo": "www-chapter-israel", "name": "Virtual AppSec IL 2020 Conference (Track A & B)", "date": "2020-10-28", "time": "09:00", "link": "https://www.meetup.com/OWASP-Israel/events/273224114/", "timezone": "Asia/Jerusalem", "description": "<p>Hi Everybody! Agenda is now online for the conference!!!</p> <p><a href=\"https://appsecil.org/Agenda\" class=\"linkified\">https://appsecil.org/Agenda</a></p> <p>Please register here, we will publish the sessions urls in the sessions details in sched.<br/>We are going to have 2 conference tracks with lots of great session!!!</p> <p>AppSec IL site : <a href=\"https://appsecil.org\" class=\"linkified\">https://appsecil.org</a></p> <p>Looking forward to seeing you all!</p> "}, {"chapter": "Israel", "repo": "www-chapter-israel", "name": "Virtual AppSec IL 2020 Training Day (Track 1 & 2)", "date": "2020-10-27", "time": "09:00", "link": "https://www.meetup.com/OWASP-Israel/events/273501887/", "timezone": "Asia/Jerusalem", "description": "<p>Hi Everybody!<br/>Agenda is now online for training!!!<br/><a href=\"https://appsecil.org/Training\" class=\"linkified\">https://appsecil.org/Training</a><br/>please register here<br/>we will publish the sessions urls in the sessions details in sched</p> <p>Wow we are going to have 2 training tracks with lots of great session!!!</p> <p>AppSec IL site : <a href=\"https://appsecil.org\" class=\"linkified\">https://appsecil.org</a><br/>Looking forward to seeing you all!</p> "}, {"chapter": "Suffolk", "repo": "www-chapter-suffolk", "name": "[ONLINE]OWASP Suffolk Chapter Community Building Exercise", "date": "2020-10-22", "time": "19:00", "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/274024154/", "timezone": "Europe/London", "description": "<p>AGENDA:<br/>* Networking<br/>* Discussion on direction where chapter should go<br/>* Networking<br/>* Open discussion<br/>* Virtual Beer</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and get a ticket to be admitted to the event by building security - your name will be checked against the guest list.<br/>Register to attend this event at OWASP Suffolk Chapter - Meetup - RSVP to attend</p> "}, {"chapter": "Bristol Uk", "repo": "www-chapter-bristol-uk", "name": "Secure Code Warrior Tournament", "date": "2020-10-27", "time": "18:00", "link": "https://www.meetup.com/OWASP-Bristol/events/268319035/", "timezone": "Europe/London", "description": "<p>Opening meeting - Zoom details:<br/>Topic: OWASP Bristol - Secure Code Warrior Tournament<br/>Time: Oct 27, 2020 06:00 PM London</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/99583981560?pwd=MkN0Q2NpTDF5eW5wK0ZUajNKS0pPUT09\" class=\"linkified\">https://zoom.us/j/99583981560?pwd=MkN0Q2NpTDF5eW5wK0ZUajNKS0pPUT09</a></p> <p>Meeting ID: 995 8398 1560<br/>Passcode: 542873<br/>One tap mobile<br/>+12532158782,,99583981560# US (Tacoma)<br/>+13017158592,,99583981560# US (Germantown)</p> <p>Dial by your location<br/>+1 253 215 8782 US (Tacoma)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 995 8398 1560<br/>Find your local number: <a href=\"https://zoom.us/u/apHTPsgrT\" class=\"linkified\">https://zoom.us/u/apHTPsgrT</a></p> "}, {"chapter": "London", "repo": "www-chapter-london", "name": "OWASP London / OWASP UK Secure Coding Tournament (CTF)", "date": "2020-10-27", "time": "18:00", "link": "https://www.meetup.com/OWASP-London/events/273941192/", "timezone": "Europe/London", "description": "<p>To join the tournament please REGISTER HERE:<br/><a href=\"https://discover.securecodewarrior.com/OWASPUKtnmRegistrationLON.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPUKtnmRegistrationLON.html</a></p> <p>ARE YOU THE SECUREST OF THEM ALL?</p> <p>Improve your secure coding skills and compete against the other OWASP chapters by joining the UK Wide OWASP Secure Coding Tournament!</p> <p>The OWASP team will be kicking off with an opening ceremony at 6pm on Tuesday 27th October 2020. At the end of the tournament, there will be a closing ceremony at 6pm on Tuesday 3rd November.</p> <p>The tournament allows you to compete against the other participants in a series of vulnerable code challenges that ask you to identify a problem, locate insecure code, and fix a vulnerability. All challenges are based on the OWASP Top 10, and players can choose to compete in a range of software languages including Java EE, Java Spring, C# MVC, C# WebForms, Go, Ruby on Rails, Python Django &amp; Flask, Scala Play, Node.JS, React, and both iOS and Android development languages.</p> <p>Throughout the tournament, players earn points and watch as they climb to the top of the leaderboard. Individual winners (top three) will win awesome Secure Code Warrior hoodies, and 4th-10th place will all win a t-shirt!</p> <p>The tournament is run virtually throughout the whole week so you can join through your laptop from the most convenient location and time. We normally recommend an hour or two to complete all of the challenges.</p> <p>How to Join the Tournament</p> <p>- Simply complete the form and we will send information with the next steps and your training token to join:</p> <p><a href=\"https://discover.securecodewarrior.com/OWASPUKtnmRegistrationLON.html\" class=\"linkified\">https://discover.securecodewarrior.com/OWASPUKtnmRegistrationLON.html</a></p> <p>^Please register using the above URL NOW - once you have registered and create log in, you will have access to the platform and will be able to PRACTICE.</p> <p>- Please note that we will also send a separate Zoom Meeting invite later, so you could ask any questions and get expert if you get stuck or experience a technical issue with the SCW platform.</p> <p>- You can find tournament step-by-step guide here: SCW Tournament Guide : <a href=\"https://www.youtube.com/watch?v=0bPFS1tyNbM\" class=\"embedded\">https://www.youtube.com/watch?v=0bPFS1tyNbM</a></p> <p>- Winners will be announced once the tournament has finished during a live-streamed closing ceremony at 6pm on Tuesday 3rd November. The winners will also be announced by email.</p> <p>- This is a UK OWASP tournament only. Prizes are only available to those part of OWASP UK chapters. OWASP Code of conduct applies -<br/>please treat everyone with respect and dignity</p> "}, {"chapter": "Somerset", "repo": "www-chapter-somerset", "name": "Exploring OWASP ZAP", "date": "2020-10-30", "time": "19:00", "link": "https://www.meetup.com/OWASP-Somerset-Chapter/events/273592981/", "timezone": "US/Eastern", "description": "<p>If you are not familiar with the OWASP ZAP project this is a great chance to get an introduction to a powerful, free web app scanner. If you are familiar please join and help answer any questions that attendees may have or just enjoy the opportunity to participate in the OWASP Somerset community!</p> <p>We will look at using the ZAP scanner to find vulnerabilities in web apps. This is the first part of a series on app scanning that will go from the basics to when, how, and why you may want to work with engineering teams to automate security tooling in the DevSecOps pipeline.</p> "}, {"chapter": "Croatia", "repo": "www-chapter-croatia", "name": "Chapter Croatia Virtual Meetup - DefectDojo & Semgrep", "date": "2020-10-30", "time": "18:00", "link": "https://www.meetup.com/OWASP-Croatia-Meetup-Group/events/273875502/", "timezone": "Europe/Zagreb", "description": "<p>Schedule:<br/>18:00 - 18:15 - Chapter Croatia Public Service Announcements<br/>18:15 - 19:00-&gt; Dubravko Sever - DefectDojo, vidljivost ranjivosti na jednom mjestu<br/>19:15 - 20:00 -&gt; Grayson Hardaway- Enforcing Code &amp; Security Standards with Semgrep<br/>20:00 -&gt; Virtual drinks and chitchat</p> <p>Abstracts:</p> <p>Dubravko Sever - DefectDojo, vidljivost ranjivosti na jednom mjestu<br/>Razvoj sigurnih aplikacija oduvijek je bio izazov, posebice pri agilnom pristupu. Teško je pratiti da li nove komponente i ovisnosti otvaraju nove prilike malicioznim osobama. Stoga kontinuirano automatizirano skeniranje koda i integracije aplikacije je nešto bez čega aplikacija ne može u produkciju. Skeniranje se vrši s više međusobno nepovezanih alata. Međutim tu je DefectDojo da olakša život i integrira Vulnerability Management u razvoj aplikacija i životni ciklus.</p> <p>Bio:<br/>Dubravko Sever: Nakon dugog niza godina u Sveučilišnom računskom centru SRCE, danas zaposlen kao sigurnjak u Deutsche Telekom, Pan-net, gdje se bavi sigurnošću Clouda (in/of) kao i sigurnošću orkestrirane okoline mikroservisa.</p> <p>Grayson Hardaway: Enforcing Code &amp; Security Standards with Semgrep<br/>We’ll discuss a program analysis tool we’re developing called Semgrep. It's a multilingual semantic tool for writing security and correctness queries on source code (for Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle, for Linux kernel refactoring, and later developed Semgrep while at Facebook. He’s now full time with us at r2c.</p> <p>Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.</p> <p>For example, find subprocess calls with shell=True in Python using the query:<br/>subprocess.open(..., shell=True)<br/>This will even find snippets like:<br/>import subprocess as s<br/>s.open(f'rm {args}', shell=True)</p> <p>Or find hardcoded credentials using the query:<br/>boto3.client(..., aws_secret_access_key=”...”, aws_access_key_id=”...” )</p> <p>Source code: <a href=\"https://github.com/returntocorp/semgrep\" class=\"linkified\">https://github.com/returntocorp/semgrep</a><br/>Test in your browser: <a href=\"https://semgrep.live/\" class=\"linkified\">https://semgrep.live/</a></p> <p>Bio:<br/>Grayson Hardaway is a security researcher at r2c, a startup working on static analysis tools purpose-built for the modern workflow. At r2c, Grayson authors static analysis tailored for finding security vulnerabilities in open source code. Previously, Grayson worked for the US Department of Defense fuzzing and exploiting obscure protocols. When not submitting patches, Grayson is hefting a heavy pack uphill, crafting guitar solos, or learning something new: currently woodworking.</p> "}]