[{"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "Finding the needle in a needle stack - NexGen Analytics in CyberSec Using ML+AI", "date": "2020-10-21", "time": "19:30", "link": "https://www.meetup.com/SGSecurityMG/events/273202440/", "timezone": "Asia/Singapore", "description": ""}, {"chapter": "Oklahoma City", "repo": "www-chapter-oklahoma-city", "name": "Information Warfare Summit", "date": "2020-10-07", "time": "09:00", "link": "https://www.meetup.com/Oklahoma-City-Chapter-Meetup/events/273513025/", "timezone": "US/Central", "description": "<p>Oklahoma's longest running cyber security conference is back! Attendance at the virtual conference is free! Join us on October 7th for the big event! Join us at: <a href=\"https://iwsokc.org\" class=\"linkified\">https://iwsokc.org</a></p> "}, {"chapter": "Sydney", "repo": "www-chapter-sydney", "name": "Sydney OWASP Night - How to become a security specialist", "date": "2020-10-21", "time": "18:00", "link": "https://www.meetup.com/OWASP-Sydney-Chapter/events/273424954/", "timezone": "Australia/Sydney", "description": "<p>The Sydney OWASP Chapter is BACK and revamped for 2020 with a fresh set of goals and leaders to bring you local cybersecurity events!</p> <p>We are focused on promoting equality within the workforce, education for new cybersecurity talents, and fostering a supportive community. To achieve these goals, we hold events throughout the year to bring regarded speakers, networking opportunities, and an annual CTF (with a cash prize!).</p> <p>Join us on Wednesday 21st October at 6PM for our first event featuring special guest speakers Ricki Burke and Lukasz Gogolkiewicz as they discuss some of the challenges of getting into the security job market and overcoming them to land your first role in the field.</p> <p>Ricki is heavily involved in the infosec community and is one of Australia’s leading cyber security recruiters. He is the founder of CyberSec People, where him and his team support organisations in hiring skilled infosec professionals.</p> <p>Lukasz is a highly proficient security professional who heads up Corporate Security at SEEK. He has worked with some of the world largest banks and financial organisations, has worked with federal, state and local governments, presented at and organised a number security conferences, and helps mentor the next generation of security professionals.</p> <p>Whether you're a student seeking some insight behind the scenes of working in cybersecurity or an experienced industry leader looking to meet new people, OWASP Chapter meetups are open to all and free to attend so we encourage everyone to come along!</p> <p>Read more about us on our website: <a href=\"https://owasp.org/www-chapter-sydney/\" class=\"linkified\">https://owasp.org/www-chapter-sydney/</a></p> "}, {"chapter": "Dallas", "repo": "www-chapter-dallas", "name": "OWASP Dallas October Meeting", "date": "2020-10-06", "time": "12:00", "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/273415740/", "timezone": "US/Central", "description": "<p>Title:</p> <p>Inside the Mind of a Threat Actor: Beyond Pentesting</p> <p>Description:</p> <p>Red team is a commonly misunderstood offensive security discipline. Red team has been used as a general term for all areas of offensive security just as blue team for defensive security. True red teaming goes Beyond Pentesting and into more adversarial emulation. While there are overlapping skills, there are differences that will be discussed as Phillip shares his experience of going from a pentester to a red teamer. In this talk, you will learn about the different areas that make up red team operations, common tools, and the path to becoming a red teamer. In this presentation, you will learn about resources helpful for a path into red teaming.</p> <p>Bio:</p> <p>Phillip Wylie is a Lead Curriculum Developer at Point3 Federal, Adjunct Instructor at Dallas College (formerly Richland College), and The Pwn School Project founder. Phillip has 23 years of experience with the last 8.5 years spent as a pentester. Phillip has a passion for mentoring and education. His passion motivated him to start teaching and founding The Pwn School Project. The Pwn School Project is a monthly educational meetup focusing on ethical hacking. Phillip teaches Ethical Hacking and Web Application Pentesting at Dallas College in Dallas, TX. Phillip holds the following certifications; CISSP, NSA-IAM, OSCP, GWAPT.</p> "}, {"chapter": "Minneapolis St Paul", "repo": "www-chapter-minneapolis-st-paul", "name": "October meeting: Securing Infrastructure as Code", "date": "2020-10-29", "time": "19:00", "link": "https://www.meetup.com/OWASP-MSP-Meetup/events/273422662/", "timezone": "US/Central", "description": "<p>Join us for a lively discussion of Infrastructure as Code (IaC), the hot<br/>new way to configure the Cloud. We'll cover:</p> <p>* Best practices<br/>* Testing and Validation for IaC<br/>* Remediation<br/>* Fitting IaC into the App Sec PIpeline<br/>* Immutable infrastructure<br/>* Is it Security Architecture or Secure Coding?</p> <p>So get your head out of the Cloud for a couple of hours and get ready<br/>for some down-to-earth information exchange.</p> <p>Due to COVID-19 restrictions, this will be an online event.</p> "}, {"chapter": "Nashville", "repo": "www-chapter-nashville", "name": "OWASP Nashville October Meetup: Defending Multicloud Infrastructure", "date": "2020-10-27", "time": "18:29", "link": "https://www.meetup.com/OWASP-Nashville-Chapter/events/273520924/", "timezone": "US/Central", "description": "<p>Join Senior Application Security Engineer at Asurion and Instructor for the SANS Institute Brandon Evans at OWASP Nashville's next online Meetup. Brandon will discuss how to defend infrastructure and applications running in Amazon Web Services (AWS), Microsoft Azure, and the Google Cloud Platform (GCP).</p> <p>Brandon is the lead author of SANS SEC510: Multicloud Security Assessment and Defense. For more information, visit: SANS.org/SEC510</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2020-10-29", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqybcnbmc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Sacramento", "repo": "www-chapter-sacramento", "name": "OWASP Sacramento - October (Remote Only - Google Hangouts)", "date": "2020-10-16", "time": "19:00", "link": "https://www.meetup.com/OWASP-Sacramento-Chapter/events/273517872/", "timezone": "US/Pacific", "description": "<p>Please note that this meetup is remote only!! Meetup won’t let us remove the location!!</p> <p>Happy Halloween, Chapter!</p> <p>Here is what we are going to cover this month.</p> <p>Hope everyone is healthy and safe!</p> <p>This month, continuing our abundance of caution, we are going to hold our meetup remotely on Google Hangouts. Please try to join from a computer.</p> <p><a href=\"https://meet.google.com/xzu-iiiq-mmx\" class=\"linkified\">https://meet.google.com/xzu-iiiq-mmx</a></p> <p>Agenda:<br/>- Community Topics<br/>- Main Topic: Identification, credit card, and cash authentication<br/>- Q&amp;A</p> <p>For more information about OWASP, please visit our Wiki at <a href=\"https://owasp.org/www-chapter-sacramento/\" class=\"linkified\">https://owasp.org/www-chapter-sacramento/</a></p> "}, {"chapter": "Saint Louis", "repo": "www-chapter-saint-louis", "name": "OWASP Meetup - CTF", "date": "2020-10-08", "time": "19:00", "link": "https://www.meetup.com/OWASP-STL/events/268671065/", "timezone": "US/Central", "description": ""}, {"chapter": "San Antonio", "repo": "www-chapter-san-antonio", "name": "OWASP San Antonio - Remote - October 2, 2020 @ 11:30am", "date": "2020-10-02", "time": "11:30", "link": "https://www.meetup.com/OWASP-San-Antonio/events/273444939/", "timezone": "US/Central", "description": "<p>Join us for the October 2020 OWASP San Antonio meeting, as we discuss how Software Security is evolving inside and outside the CI/CD pipeline!</p> <p>In accordance with COVID-19 guidelines, this meeting will be remote.</p> <p>Title:<br/>AppSec Fast and Slow: Your DevSecOps CI/CD Pipeline Isn’t an SSA Program</p> <p>Abstract:<br/>With all the focus on DevSecOps and integrating security into Continuous Integration/Continuous Delivery (CI/CD) pipelines, some teams may be lured into thinking that the entirety of a Software Security Assurance (SSA) program can be baked into these pipelines. While integrating security into CI/CD offers many benefits, it is critical to understand that a full SSA program encompasses a variety of activities – many of which are incompatible with run time restrictions and other constraints imposed by these pipelines. This webinar looks at the breadth of activities involved in a mature SSA program and steps through the aspects of a program that can be realistically included in a pipeline, as well as those that cannot. It also reviews how these activities and related tooling have evolved over time as the application security discipline has matured and as development teams started to focus on cloud-native development techniques and technologies.</p> <p>Speaker:<br/>Dan Cornell,</p> <p>Bio:<br/>A globally recognized application security expert, Dan Cornell holds over 15 years of experience architecting, developing and securing web-based software systems. As Chief Technology Officer and Principal at Denim Group, Ltd., he leads the technology team to help Fortune 500 companies and government organizations integrate security throughout the development process.</p> <p>Location:<br/><a href=\"https://denimgroup.zoom.us/j/96926371520\" class=\"linkified\">https://denimgroup.zoom.us/j/96926371520</a></p> "}, {"chapter": "Israel", "repo": "www-chapter-israel", "name": "Virtual AppSec IL 2020 Conference", "date": "2020-10-28", "time": "09:00", "link": "https://www.meetup.com/OWASP-Israel/events/273224114/", "timezone": "Asia/Jerusalem", "description": "<p>Hi Everybody!</p> <p>I am happy to announce that the annual OWASP AppSec Israel Conference is now in motion!<br/>In the spirit of Covid-19 It is going to be a two days virtual event this year with great content and training workshops, on Tuesday-Wednesday, October 27-28 2020.</p> <p>AppSec IL site : <a href=\"https://appsecil.org\" class=\"linkified\">https://appsecil.org</a></p> <p>after lots of thinking we will use this event as the method for registration!<br/>Soon we will share the agenda</p> <p>As you all know, OWASP’s AppSec Israel is the largest conference in Israel and the region for application security, and regularly draws hundreds of participants.<br/>Last event over 800 people attended – don’t miss it this year!<br/>The Virtual Conference will include multiple lecture tracks, un-conference sessions, chat rooms,and meeting rooms.</p> <p>We also want to continue the tradition that was started last year, to have another full day of Security Training just before the conference day. We are reaching out to you, AppSec community to help and support us for making it happen, we are looking for trainers and sponsors.</p> <p>The Training event will be conducted by professional security trainers, selected by OWASP, and free to attend, just preregister to the event.</p> <p>Looking forward to seeing you all!</p> "}, {"chapter": "Israel", "repo": "www-chapter-israel", "name": "Virtual AppSec IL 2020 Training Day", "date": "2020-10-27", "time": "09:00", "link": "https://www.meetup.com/OWASP-Israel/events/273501887/", "timezone": "Asia/Jerusalem", "description": "<p>Hi Everybody!</p> <p>I am happy to announce that the annual OWASP AppSec Israel Conference is now in motion!<br/>In the spirit of Covid-19 It is going to be a two days virtual event this year with great content and training workshops, on Tuesday-Wednesday, October 27-28 2020.</p> <p>AppSec IL site : <a href=\"https://appsecil.org\" class=\"linkified\">https://appsecil.org</a></p> <p>After lots of thinking we will use this event as the method for registration!<br/>Soon we will share the agenda for the training</p> <p>As you all know, OWASP’s AppSec Israel is the largest conference in Israel and the region for application security, and regularly draws hundreds of participants.<br/>Last event over 800 people attended – don’t miss it this year!<br/>The Virtual Conference will include multiple lecture tracks, un-conference sessions, chat rooms,and meeting rooms.</p> <p>We also want to continue the tradition that was started last year, to have another full day of Security Training just before the conference day. We are reaching out to you, AppSec community to help and support us for making it happen, we are looking for trainers and sponsors.</p> <p>The Training event will be conducted by professional security trainers, selected by OWASP, and free to attend, just preregister to the event.</p> <p>Looking forward to seeing you all!</p> "}, {"chapter": "Suffolk", "repo": "www-chapter-suffolk", "name": "[ONLINE]OWASP London/Suffolk Joint  Chapter Meeting", "date": "2020-10-07", "time": "19:00", "link": "https://www.meetup.com/OWASP-Suffolk-Chapter/events/273437250/", "timezone": "Europe/London", "description": "<p>AGENDA:<br/>* Warmly greetings by hosts</p> <p>* The Cloud Migration Playbook - Part 1: A Simple Primer To Complexity\" - Jason Sewell<br/>In this talk, we will go over an introductory overview on the common areas of AWS an organization should start to focus on as they prepare to migrate to the cloud, including both offensive techniques and defensive mitigation.</p> <p>* Short break / networking</p> <p>* What you need to know, but you are afraid to ask - Pentester panel</p> <p>Panelists:</p> <p>* Jason Sewell<br/>Jason has over 15 years of experience as a web application and systems developer, in addition to over ten years in DevOps and systems architecture related roles. Jason began his journey into information security through necessity as he built skills and knowledge through his roles in leading internal initiatives for securing application and cloud infrastructure. After years of blue team and developer/devops roles, his interests centre around offensive security and wanting to help organizations actively find problems rather than just follow best practices and hope for the best.</p> <p>* Cayce Mahon<br/>Has over nine years of experience in Information Security. Originally graduating with an AFA in fine art , she took a unique path of education in regards to her transition into information security. Through persistence and self-study, she was able to obtain a Security+ and OSCP certification on her own. While at OccamSec, she has led and has been a part of a variety of offensive engagements in the realms of cyber and physical security (security/penetration testing of applications, network/physical infrastructure and systems) as well as risk assessment (architecture/policy review, vulnerability assessment, and employee interviews). Finding crucial fault points in an organization’s infrastructure while also adapting to the ever changing demands of the clients she works with.</p> <p>* Ivano Bianco<br/>Italian, with a fake Russian accent. Started using computers at the tender age of 11, by the age of 14 he switched from the BASIC language to Assembly and started to circumvent copy protections for fun. Spent the next 20 years working in IT Operations, keeping systems secure and automating deployments before job titles like \"IT Security Engineer\" and \"DevOps Engineer\" were a thing.</p> <p>Had the opportunity to cover technical hands-on roles for a multitude of SME and multinational companies such as: - Société Générale - H3G - Ericsson - Global Payments – Puppet.</p> <p>Nowadays he prefers to focus on penetration testing, web application testing (because breaking things is always fun), threat hunting and security awareness training. He still likes to figure out why a server is down, but will not fix your computer.</p> <p>* Nicholas Donarski<br/>Has been a pioneer in the Information Security field for over 20 years. During this time, he’s worked with a diverse client list which includes multinational and global organizations, Federal, State and Local government, and enterprises of all sizes. He is recognized in the international community as a senior authority on PenTesting strategy, operations, tools and training. Over the years, he’s continued to expand his experience in security to include network security, mobile, web, and application security, compliance, high threat physical security and RedTeam Operations. Recently, he’s focused on the development of security architecture and development around machine learning and Artificial Narrow Intelligence (ANI).</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and get a ticket to be admitted to the event by building security - your name will be checked against the guest list.<br/>Register to attend this event at OWASP Suffolk Chapter - Meetup - RSVP to attend</p> "}, {"chapter": "Bristol Uk", "repo": "www-chapter-bristol-uk", "name": "Secure Code Warrior Tournament", "date": "2020-10-27", "time": "18:00", "link": "https://www.meetup.com/OWASP-Bristol/events/268319035/", "timezone": "Europe/London", "description": "<p>Opening meeting - Zoom details:<br/>Topic: OWASP Bristol - Secure Code Warrior Tournament<br/>Time: Oct 27, 2020 06:00 PM London</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/99583981560?pwd=MkN0Q2NpTDF5eW5wK0ZUajNKS0pPUT09\" class=\"linkified\">https://zoom.us/j/99583981560?pwd=MkN0Q2NpTDF5eW5wK0ZUajNKS0pPUT09</a></p> <p>Meeting ID: 995 8398 1560<br/>Passcode: 542873<br/>One tap mobile<br/>+12532158782,,99583981560# US (Tacoma)<br/>+13017158592,,99583981560# US (Germantown)</p> <p>Dial by your location<br/>+1 253 215 8782 US (Tacoma)<br/>+1 301 715 8592 US (Germantown)<br/>+1 312 626 6799 US (Chicago)<br/>+1 346 248 7799 US (Houston)<br/>+1 669 900 6833 US (San Jose)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 995 8398 1560<br/>Find your local number: <a href=\"https://zoom.us/u/apHTPsgrT\" class=\"linkified\">https://zoom.us/u/apHTPsgrT</a></p> "}, {"chapter": "London", "repo": "www-chapter-london", "name": "[ONLINE] OWASP London/Suffolk Joint Chapter Meeting", "date": "2020-10-07", "time": "19:00", "link": "https://www.meetup.com/OWASP-London/events/273624695/", "timezone": "Europe/London", "description": "<p>OWASP London and OWASP Suffolk Chapters present a joint event which will feature a cloud security talk and \"Meet The PenTesters\" panel</p> <p>AGENDA:</p> <p>* Warm greetings by hosts - Introduction / OWASP News &amp; Updates</p> <p>* \"The Cloud Migration Playbook - Part 1: A Simple Primer To Complexity\" -</p> <p>Jason Sewell<br/>In this talk, we will go over an introductory overview on the common areas of AWS an organization should start to focus on as they prepare to migrate to the cloud, including both offensive techniques and defensive mitigation.</p> <p>* Short break / virtual networking</p> <p>* What you need to know, but you are afraid to ask - Pentester panel</p> <p>Panelists:</p> <p>* Jason Sewell<br/>Jason has over 15 years of experience as a web application and systems developer, in addition to over ten years in DevOps and systems architecture related roles. Jason began his journey into information security through necessity as he built skills and knowledge through his roles in leading internal initiatives for securing application and cloud infrastructure. After years of blue team and developer/devops roles, his interests centre around offensive security and wanting to help organizations actively find problems rather than just follow best practices and hope for the best.</p> <p>* Cayce Mahon<br/>Has over nine years of experience in Information Security. Originally graduating with an AFA in fine art , she took a unique path of education in regards to her transition into information security. Through persistence and self-study, she was able to obtain a Security+ and OSCP certification on her own. While at OccamSec, she has led and has been a part of a variety of offensive engagements in the realms of cyber and physical security (security/penetration testing of applications, network/physical infrastructure and systems) as well as risk assessment (architecture/policy review, vulnerability assessment, and employee interviews). Finding crucial fault points in an organisation’s infrastructure while also adapting to the ever changing demands of the clients she works with.</p> <p>* Ivano Bianco<br/>Italian, with a fake Russian accent. Started using computers at the tender age of 11, by the age of 14 he switched from the BASIC language to Assembly and started to circumvent copy protections for fun. Spent the next 20 years working in IT Operations, keeping systems secure and automating deployments before job titles like \"IT Security Engineer\" and \"DevOps Engineer\" were a thing.</p> <p>Had the opportunity to cover technical hands-on roles for a multitude of SME and multinational companies such as: - Société Générale - H3G - Ericsson - Global Payments – Puppet.</p> <p>Nowadays he prefers to focus on penetration testing, web application testing (because breaking things is always fun), threat hunting and security awareness training. He still likes to figure out why a server is down, but will not fix your computer.</p> <p>* Nicholas Donarski<br/>Has been a pioneer in the Information Security field for over 20 years. During this time, he’s worked with a diverse client list which includes multinational and global organizations, Federal, State and Local government, and enterprises of all sizes. He is recognised in the international community as a senior authority on PenTesting strategy, operations, tools and training. Over the years, he’s continued to expand his experience in security to include network security, mobile, web, and application security, compliance, high threat physical security and RedTeam Operations. Recently, he’s focused on the development of security architecture and development around machine learning and Artificial Narrow Intelligence (ANI).</p> <p>TICKETS:<br/>This event is free to attend for both members and non-members of OWASP and is open to anyone interested in application security and cyber security. Please note that you MUST RSVP to book your place and to be admitted to the event. This is an online event and the URL to connect will be communicated to the attendees via the Meetup/EventBrite system</p> "}, {"chapter": "Norway", "repo": "www-chapter-norway", "name": "Enforcing Code & Security Standards with Semgrep", "date": "2020-10-13", "time": "19:00", "link": "https://www.meetup.com/OWASP-Norway/events/273505813/", "timezone": "Europe/Oslo", "description": "<p>Abstract:<br/>We’ll discuss a program analysis tool we’re developing called Semgrep. It's a multilingual semantic tool for writing security and correctness queries on source code (for Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle, for Linux kernel refactoring, and later developed Semgrep while at Facebook. He’s now full time with us at r2c.</p> <p>Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.</p> <p>For example, find subprocess calls with shell=True in Python using the query:<br/>subprocess.open(..., shell=True)<br/>This will even find snippets like:<br/>import subprocess as s<br/>s.open(f'rm {args}', shell=True)</p> <p>Or find hardcoded credentials using the query:<br/>boto3.client(..., aws_secret_access_key=”...”, aws_access_key_id=”...” )</p> <p>Source code: <a href=\"https://github.com/returntocorp/semgrep\" class=\"linkified\">https://github.com/returntocorp/semgrep</a><br/>Test in your browser: <a href=\"https://semgrep.dev/\" class=\"linkified\">https://semgrep.dev/</a></p> <p>Speaker bio:<br/>Bence Nagy is a software engineer at r2c, working on Semgrep, an open-source syntax-aware code search tool. At r2c, his responsibilities tend towards building various interfaces atop the core semgrep CLI. These include CI integrations, editor extensions, and the semgrep.live web app. He previously led a developer experience team at Kiwi.com, the Czech Republic’s top startup at the time of its acquisition in 2019. You should totally ask him for video game recommendations after the talk.</p> "}, {"chapter": "Switzerland", "repo": "www-chapter-switzerland", "name": "OWASP API Security Top 10", "date": "2020-10-07", "time": "18:00", "link": "https://www.meetup.com/OWASPSwitzerland/events/273088624/", "timezone": "Europe/Zurich", "description": "<p>In December 2019, OWASP published its first top 10 risk list for API security. With this step, OWASP confirms the increasing importance of API security for companies. The talk looks at the new risks and contrasts them with the top 10 risks for web applications. While security products can help to mitigate certain risks as an additional defense line, API developers have the ultimate responsibility for their code and must know the risks to avoid them.</p> <p>This will be an online live event (link will be added before the event).</p> <p>Speaker bio of Dr. Martin Burkhart:<br/>Martin Burkhart is head of product management for Airlock at Ergon Informatik AG. Prior to that, he has been working as a software engineer and as a security researcher, concerned with data anonymization and applied cryptography. He owns an MSc and a PhD in computer science from ETH Zurich.</p> "}, {"chapter": "Porto Alegre", "repo": "www-chapter-porto-alegre", "name": "OWASP Chapter POA - Encontro 004 [ONLINE]", "date": "2020-10-08", "time": "19:30", "link": "https://www.meetup.com/OWASP-Porto-Alegre-Chapter/events/273580660/", "timezone": "America/Sao_Paulo", "description": "<p>Buenas pessoal!</p> <p>Chegamos ao encontro 004 de 2020! Essa noite teremos uma edição especial com convidados de fora do Brasil, com uma primeira palestra em Português seguida por uma em Inglês. Não deixem de participar!</p> <p>08 de Outubro, quarta-feira, a partir das 19h30 (GMT-3) - Link disponível em breve</p> <p>19h30-20h30 (Palestra em Português)<br/>\"Threat Modeling Contínuo para Times de Desenvolvimento\"<br/>Izar Tarandach é um Arquiteto de Segurança Sênior em uma instituição financeira de ponta. Anteriormente foi Arquiteto Líder de Segurança de Produtos na Autodesk Inc., Arquiteto de Segurança para a Enterprise Hybrid Cloud na Dell EMC, Consultor de Segurança no Escritório de Segurança de Produtos da EMC, com passagens pela RSA, IBM e várias startups. Com mais anos do que gosta de admitir na indústria de segurança, ele foi um contribuinte central no esforço de treinamento da SAFECode e um fundador do IEEE Center for Security Design. Possui mestrado em Ciências da Computação com foco em Segurança da Boston University, e serviu como instrutor de Forense Digital na Boston University e Desenvolvimento Seguro na University of Oregon.</p> <p>20h30-21h30 (Palestra em Inglês)<br/>\"Enforcing Code &amp; Security Standards with Semgrep\"<br/>Luke O’Malley é o co-fundador da r2c, uma empresa que está profundamente melhorando a segurança e confiabilidade de software. Como Head de Produto ele trabalhou com lideranças mundiais de desenvolvimento para melhorar suas ferramentas de build e práticas de desenvolvimento. Anteriormente ele liderou os times de ferramentas de dev na Palantir, escreveu softwares para apoiar esforços de contra-terrorismo e pesquisou sistemas de propulsão para exploração espacial. Luke é um investidor-anjo na área de ferramentas de desenvolvimento e segurança. Ele é bacharelado em Engenharia Elétrica e Ciências da Computação no MIT. Seus outros interesses incluem apicultura, motociclismo de aventura e tipografia.</p> "}, {"chapter": "Victoria", "repo": "www-chapter-victoria", "name": "OWASP BC Day 2020", "date": "2020-10-03", "time": "10:00", "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/273000877/", "timezone": "Canada/Pacific", "description": "<p>DO NOT REGISTER HERE!!!<br/>Registration at: <a href=\"https://www.eventbrite.ca/e/owasp-bc-day-2020-tickets-119389965601\" class=\"linkified\">https://www.eventbrite.ca/e/owasp-bc-day-2020-tickets-119389965601</a></p> <p>OWASP Vancouver and Victoria chapters are pleased to present BC Day: an application security event focused on security awareness, training and new developments in the application security industry. This event will focus on highlighting security expertise in the local community and is the first of many collaborations between our community OWASP chapters.</p> <p>The event will take place on October 3rd from 10 am to 5 pm.</p> <p>This will be a mixed forum of presentations, adjacent workshops, hands on training and interactive sessions that will be held on several topics of interest.</p> <p>Please refer to our official page for full details on the event:<br/><a href=\"https://www.owaspbcday.org/\" class=\"linkified\">https://www.owaspbcday.org/</a></p> <p>Get your tickets at:<br/><a href=\"https://www.eventbrite.ca/e/owasp-bc-day-2020-tickets-119389965601\" class=\"linkified\">https://www.eventbrite.ca/e/owasp-bc-day-2020-tickets-119389965601</a></p> "}, {"chapter": "Somerset", "repo": "www-chapter-somerset", "name": "Exploring OWASP ZAP", "date": "2020-10-30", "time": "19:00", "link": "https://www.meetup.com/OWASP-Somerset-Chapter/events/273592981/", "timezone": "US/Eastern", "description": "<p>If you are not familiar with the OWASP ZAP project this is a great chance to get an introduction to a powerful, free web app scanner. If you are familiar please join and help answer any questions that attendees may have or just enjoy the opportunity to participate in the OWASP Somerset community!</p> <p>We will look at using the ZAP scanner to find vulnerabilities in web apps. This is the first part of a series on app scanning that will go from the basics to when, how, and why you may want to work with engineering teams to automate security tooling in the DevSecOps pipeline.</p> "}, {"chapter": "The Northcap Universtiy", "repo": "www-chapter-the-northcap-universtiy", "name": "OWASP GURUGRAM MEETUP OCTOBER", "date": "2020-10-02", "time": "14:00", "link": "https://www.meetup.com/OWASP-The-NorthCap-University-Meetup-Group/events/273586571/", "timezone": "Asia/Calcutta", "description": "<p>A bug bounty program is a deal offered by many websites, organizations, and software developers by which individuals can receive recognition and compensation for reporting bugs, especially those pertaining to security exploits and vulnerabilities.</p> <p>'“'It takes 20 years to build a reputation and a few minutes of cyber-incident to ruin it.'<br/>– Stephane Nappo</p> <p>Believing this OWASP NCU has organized a gurugram chapter meet for all cybersecurity enthusiasts.<br/><br/>Time: 2 p.m. onwards<br/><br/>Date: 2nd October 2020</p> <p>Speaker: Paras Arora(CyberSecurity analyst)</p> <p>Topic: Bug Bounties</p> <p>E-certificates will be provided to all!</p> <p>For further details contact:<br/>Tanu - +91 98100 77688</p> "}]