[{"chapter": "Charlotte", "repo": "www-chapter-charlotte", "name": "2021 Kickoff Meeting (Security in a post COVID World)", "date": "2021-01-21", "time": "19:00", "link": "https://www.meetup.com/owaspCLT/events/274975479/", "timezone": "US/Eastern", "description": "<p>Come join us for our First meeting of the year and a frank discussion of Covid and its affect on security this year.</p> "}, {"chapter": "Pittsburgh", "repo": "www-chapter-pittsburgh", "name": "OWASP Pittsburgh Chapter Q1 2021 MeetUp", "date": "2021-01-07", "time": "19:00", "link": "https://www.meetup.com/OWASP-Pittsburgh-Chapter/events/275217674/", "timezone": "US/Eastern", "description": "<p>OWASP Pittsburgh Chapter Q1 2021 MeetUp</p> <p>TLS Pinning </p> "}, {"chapter": "Dhaka", "repo": "www-chapter-dhaka", "name": "OWASP API Security Top 10", "date": "2021-01-22", "time": "19:00", "link": "https://www.meetup.com/OWASP-Dhaka-Chapter/events/275364270/", "timezone": "Asia/Dhaka", "description": "<p>In December 2019, OWASP published its first top 10 risk list for API security. With this step, OWASP confirms the increasing importance of API security for companies. The talk looks at the new risks and contrasts them with the top 10 risks for web applications. While security products can help to mitigate certain risks as an additional defense line, API developers have the ultimate responsibility for their code and must know the risks to avoid them.</p> <p>This will be an online live event (link will be added before the event).</p> <p>Speaker Biodata of Mr. Md Jahangir Alam:<br/>Md Jahangir Alam is the leader of the OWASP Dhaka Chapter. He is the Head of IT Security at Shimanto Bank Limited and Director of Marketing, ISACA Dhaka Chapter. He is a Certified Information System Auditor (CISA), ISO 27001 Lead Auditor, Certified Ethical Hacker (CEH), Certified Blockchain Professional (CBP), and Lean Six Sigma Black Belt (LSSBB). He is a CSE Graduate from a reputed private university in Bangladesh.</p> "}, {"chapter": "Cambridge", "repo": "www-chapter-cambridge", "name": "ARU CSNRG, OWASP Cambs & BCS Cybercrime SG \"Vehicle Dachcam Forensics\" Webinar", "date": "2021-01-07", "time": "18:15", "link": "https://www.meetup.com/OWASP-Cambridge-Meetup/events/275154240/", "timezone": "Europe/London", "description": "<p>ARU CSNRG, OWASP Cambridge &amp; BCS Cybercrime Forensics “Vehicle Dashcam Forensics” Webinar</p> <p>Thursday 7th January 18:15 – 19:45 – Online</p> <p>Hosted by the Cyber Security &amp; Networking Research Group, Anglia Ruskin University, OWASP (Open Web Application Security Project) Cambridge Chapter &amp; BCS Cybercrime Forensics SG.</p> <p>Background</p> <p>OWASP (Open Web Application Security Project is a 501(c)(3) not-for-profit worldwide charitable organization focused on improving the security of application software. Their mission is to make application security visible, so that people and organizations can make informed decisions about true application security risks.</p> <p>The Cyber Security and Networking (CSN) Research Group at Anglia Ruskin University has close working strategic relationships with industry, professional bodies, law enforcement, government agencies and academia in the delivery of operationally focused applied information and application security research. We have strong international links with professional organisations such as OWASP, BCS, ISC2, IISP &amp; the UK Cyber Security Forum amongst others.</p> <p>The BCS – Chartered Institute for IT - Cybercrime Forensics Special Interest Group (SG) promotes Cybercrime Forensics and the use of Cybercrime Forensics; of relevance to computing professionals, lawyers, law enforcement officers, academics and those interested in the use of Cybercrime Forensics and the need to address cybercrime for the benefit of those groups and of the wider public.<br/>Speaker Biographies &amp; Abstracts</p> <p>Dr Harjinder Singh Lallie, University of Warwick, \" Vehicle Dashcam Forensics”</p> <p>Bio: Dr Harjinder Singh Lallie, University of Warwick</p> <p>Dr. Harjinder Singh Lallie is an Associate Professor at the University of Warwick and a visiting lecturer/project supervisor at the University of Oxford. Harjinder holds a PhD in cyber security, an MPhil, an MSc., and a BSc. Harjinder has more than twenty years of teaching experience and currently leads the MSc Cyber Security and Management degree, teaches three modules on the programme degree at Warwick.</p> <p>Harjinder’s research focuses on the area of complex attack modelling and the use of AI in digital forensics. He has published numerous research papers in the world’s top cyber security journals and completes reviews for Elsevier’s Computers and Security and IEEE Transactions on Information Forensics and Security. Harjinder has held numerous conference committee memberships, he acts as an external examiner and has conducted a number of national and international institutional reviews.</p> <p>Abstract : “Vehicle Dashcam Forensics”</p> <p>A dashboard camera (“dashcam”) is an in-vehicle mountable camera which records video and audio footage of vehicle journeys. Dashcams create numerous artefacts of evidential value such as GPS data, temporal data, vehicular speed data, audio, video and photographic images. Dashcam usage has increased over the last few years with 9% of drivers using dashcams in 2015, 17% in 2017, and 27% in 2018 (Aviva, 2018). This number is expected to increase remarkably, particularly with some manufacturers planning to incorporate dashcam capability within new car design. Dashcam evidence is essential in road-traffic related incidents as well as to provide evidence of in-vehicle activity. Despite their importance, there is a paucity of research into dashcam forensics, and there are no known tools that enable dashcam forensics.</p> <p>This talk highlights the work that we are doing in supporting this field. The talk provides an overview of the evidential value of dashcam devices, methods of extracting the evidence, efforts to develop a useful dashcam evidence dataset, and then reports on three prototypes aimed at extracting dashcam evidence.</p> <p>Provisional Agenda</p> <p>18:15 - Webinar waiting lobby opens<br/>18:30 - Presentation followed by Questions and Answers<br/>19:45 - Closing, with virtual networking</p> "}, {"chapter": "Victoria", "repo": "www-chapter-victoria", "name": "January 2021 Virtual AppSec Meetup", "date": "2021-01-20", "time": "18:00", "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/275339332/", "timezone": "Canada/Pacific", "description": "<p>The OWASP Victoria chapter is pleased to present our first<br/>event since OWASP BC Day. Michael Cavallin will be delivering a talk on Zero Trust Design for Web Applications.</p> <p>The event will be held online on January 20th from 6:00pm – 7:30pm.</p> <p>It will feature Michael’s talk followed by a Q&amp;A and a draw for a prize (must be registered member). Join us for an evening of application security in the new year!</p> <p>Visit our OWASP Chapter to learn more about us at <a href=\"https://owasp.org/www-chapter-victoria/\" class=\"linkified\">https://owasp.org/www-chapter-victoria/</a></p> <p>Speaker: Michael Cavallin<br/>Presentation: Zero Trust Design for Web Applications (1.5 hr)<br/>Abstract: TBA<br/>Biography: TBA</p> "}]