[{"chapter": "Sao Paulo", "repo": "www-chapter-sao-paulo", "events": [{"name": "OWASP SP Meetup Virtual", "date": "2020-08-04", "time": "19:00", "link": "https://www.meetup.com/OWASP-Sao-Paulo-Chapter/events/272136329/", "timezone": "America/Sao_Paulo", "description": "<p>OWASP SP Meetup Virtual</p> <p>A OWASP SP tem o prazer de anunciar a realização do primeiro meetup virtual, no dia 04 de agosto de 2020!</p> <p>Nesse meetup vamos abordar assuntos relacionados a OSINT em redes sociais e Python para pentesting.</p> <p>*** INSCRIÇÕES ***</p> <p>O meetup é gratuito e para fazer a inscrição, você deverá confirmar a sua presença através do meetup.com.</p> <p>*** PROGRAMAÇÃO ***</p> <p>18h50 – Abertura<br/>19h00 – Palestra – Python para pentesting, construindo suas próprias ferramentas - Ubirajara Aguiar<br/>20h00 – Palestra – Análise de Redes Sociais com OSINT - Wagner Morais<br/>21h00 – Encerramento</p> <p>*** LINK PARA TRANSMISSÃO ***</p> <p>A palestra será transmitida pelo YouTube e o link será enviado para o email cadastrado e também será disponibilizado aqui na descrição do meetup, no dia 02 de agosto de 2020.</p> <p>*** SOBRE A OWASP SÃO PAULO ***</p> <p>A OWASP São Paulo é um dos 9 capítulos brasileiros entre os mais de 270 ativos em todo o mundo. O objetivo é disseminar a missão da fundação, tornando a segurança das aplicações visível para que as pessoas e as organizações possam tomar decisões conscientes sobre os verdadeiros riscos que correm.</p> <p>São realizados encontros periódicos para compartilhamento de conhecimentos, discussão de temas e aprendizado sobre segurança de software.</p> <p>Não percam!</p> <p>Equipe OWASP São Paulo.</p> "}]}, {"chapter": "Bhopal", "repo": "www-chapter-bhopal", "events": [{"name": "OWASP BHOPAL MEETUP - YARA RULES 101", "date": "2020-08-02", "time": "14:00", "link": "https://www.meetup.com/OWASP-Bhopal-Chapter/events/272148565/", "timezone": "Asia/Calcutta", "description": "<p>As Owasp Bhopal Community we have come up with Jan-2020 Monthly meet for the Community.</p> <p>There will be a one-hour session on the topic \"YARA RULES 101\" by Lakshya Dubey.</p> <p>It will be a fully virtual meetup and the details Regarding The virtual platform will be communicated shortly.</p> "}]}, {"chapter": "Nashua", "repo": "www-chapter-nashua", "events": [{"name": "Getting back into the Groove", "date": "2020-08-03", "time": "18:00", "link": "https://www.meetup.com/OWASP-Nashua-Chapter/events/272054629/", "timezone": "US/Eastern", "description": "<p>We've been on pause during the pandemic, but I thought I'd try running a virtual meetup and see how it goes. For this first one, it'll just be a meet and greet event, let us catch up from the last six months and see if there's interest in having virtual meetings. If so, we'll get something more substantial planned for September.</p> "}]}, {"chapter": "Bonita Springs", "repo": "www-chapter-bonita-springs", "events": [{"name": "OWASP Monthly Meeting", "date": "2020-08-04", "time": "18:00", "link": "https://www.meetup.com/OWASP-Bonita-Springs-Chapter/events/272220387/", "timezone": "US/Eastern", "description": "<p>This meeting will be held virtually only and will continue on our coverage of vulnerable web application issues and the OWASP Top 10. Given time, examples may be provided as well.</p> <p>We generally review security related happenings, share tips and tricks for configuring software and hardware, and chat about various topics such as security, privacy, exploitation, vulnerabilities, pen testing, web app security, CTFs, IoT security, mobile security and anything else members wish to discuss.</p> "}]}]