[{"chapter": "Ghana", "repo": "www-chapter-ghana", "name": "How to turn your cybersecurity hobby into career- An Introduction to Bugbounties", "date": "2021-03-15", "time": "16:00", "link": "https://www.meetup.com/OWASP-Ghana-Chapter/events/276327753/", "timezone": "Africa/Accra", "description": "<p>The event is organized by OWASP Foundation.</p> <p>How to turn your cybersecurity hobby into a career - An Introduction to Bugbounties</p> <p>The most common question I get asked. Is: “How do I get started in bug bounties” So In this presentation, I'm going to guide you and share my personal experiences on how you can get started in hunting for security bugs. We are going to dig into what tools and skills you need, what to expect, and how to avoid hunters burnout. All while trying to iron out misconceptions and avoiding common pitfalls. So join me in this inspirational presentation on how you can too turn your passion for cybersecurity into a profitable career or side business.</p> <p>Stoke can be found on Twitter: <a href=\"https://twitter.com/stokfredrik\" class=\"linkified\">https://twitter.com/stokfredrik</a></p> <p>Original event page:<br/><a href=\"https://www.eventbrite.com/e/how-to-turn-your-cybersecurity-hobby-into-a-career-an-intro-to-bugbounties-tickets-137621959987?aff=OWASPghana\" class=\"linkified\">https://www.eventbrite.com/e/how-to-turn-your-cybersecurity-hobby-into-a-career-an-intro-to-bugbounties-tickets-137621959987?aff=OWASPghana</a></p> <p>Event Sponsor, Invicti:<br/><a href=\"https://www.invicti.com/products/?utm_medium=events&amp;utm_source=tradeshow&amp;utm_campaign=i-owaspevents&amp;utm_content=210209-websitevisit-virtualevent&amp;utm_term=brand\" class=\"linkified\">https://www.invicti.com/products/?utm_medium=events&amp;utm_source=tradeshow&amp;utm_campaign=i-owaspevents&amp;utm_content=210209-websitevisit-virtualevent&amp;utm_term=brand</a></p> "}, {"chapter": "Singapore", "repo": "www-chapter-singapore", "name": "Scale Your Security by Embracing Secure Defaults & Eliminating Bug Classes", "date": "2021-03-11", "time": "19:30", "link": "https://www.meetup.com/singapore-owasp-meetup-group/events/276096584/", "timezone": "Asia/Singapore", "description": "<p>We’re in the middle of a significant shift in how security teams operate and prioritize their limited budget and person-time.</p> <p>Historically, as an industry, we’ve focused on building tools to identify vulnerabilities. While we’ve built impressive tools, these approaches have failed to address the challenges of modern engineering teams.<br/>Specifically, these tools often are too slow, require a prohibitive amount of security engineer time and domain expertise to tune, overwhelm users with false positives, and most importantly, do not ultimately raise a company’s security bar.</p> <p>But there’s another way.</p> <p>Rather than investing in finding more bugs, some modern security teams are instead focusing on providing developers with frameworks and services with secure defaults (“guard rails”) so that developers can build features quickly and securely. When done correctly, combining secure defaults and lightweight checks that enforce invariants (properties that must always hold), organizations can solve *classes* of vulnerabilities by construction, preventing bug whack-a-mole.</p> <p>In this talk, we’ll present a practical step-by-step methodology for:</p> <p>Choosing what to focus your AppSec resources on<br/>- How to combine secure defaults + lightweight invariant enforcement to eradicate entire vulnerability classes<br/>- How to integrate continuous code scanning into your CI/CD processes in a way that’s fast, high signal, and low friction for developers<br/>- How to use an open source, lightweight security linting tool to find bugs and anti-patterns specific to your company</p> <p>Speaker<br/>Grayson Hardaway is a security researcher at r2c, a startup working on static analysis tools purpose-built for the modern workflow. At r2c, Grayson authors static analysis tailored for finding security vulnerabilities in open source code. Previously, Grayson worked for the US Department of Defense fuzzing and exploiting obscure protocols. When not submitting patches, Grayson is hefting a heavy pack uphill, crafting guitar solos, or learning something new: currently woodworking.</p> "}, {"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "DISCOUNT PHISH BURN BETTER and  USER MODE API HOOKS AND BYPASSES", "date": "2021-03-25", "time": "20:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/276419652/", "timezone": "Europe/Copenhagen", "description": "<p>Note: THIS IS AN ONLINE EVENT! Link to stream will be released here prior to the event.</p> <p>THE SPEAKER</p> <p>Magnus Stubman, Security Advisor at Improsec and former security consultant at F-Secure and Zacco.<br/><a href=\"https://www.linkedin.com/in/magnusstubman/\" class=\"linkified\">https://www.linkedin.com/in/magnusstubman/</a></p> <p>Magnus started his career as a software developer and later turned his attention to Cyber Security, specifically attack and penetration testing, both digital and physical. Today Magnus specialize in Red Teaming.</p> <p>Magnus will do something we haven't facilited in OWASP CPH before - He will do a double-presentation - to take you on a technical security ride.. Keep reading to learn more...</p> <p>THE TALKS</p> <p>TALK 1 : DISCOUNT PHISH BURN BETTER</p> <p>- Did my e-mail provider detect my malicious intent?</p> <p>- Was there an e-mail gateway that saw my malware?</p> <p>- Did it land in the junk/spam folder?</p> <p>- Has the victim even seen it or read it yet?</p> <p>- Did he/she click the link or did it seem suspicious?</p> <p>- Did the malware download properly?</p> <p>- Was it analysed in a sandbox?</p> <p>- Did the Anti-Virus detect it? What about EDR?</p> <p>- Maybe the SOC is torturing my malware in a lab environment right now?</p> <p>- Maybe it executed fine, but just stopped working due to a bug?</p> <p>- Was the outbound C2 traffic blocked or even worse, detected?</p> <p>Have you ever asked yourself one of the above questions, or just wonder how life is as an attacker seeking to conduct a successful (spear) phishing campaign? \"Discount Phish Burn Better\" is a talk about how an attacker can improve his odds of successfully phishing a victim by reducing the cost of payload/malware development.</p> <p>TALK 2 : USER MODE API HOOKS AND BYPASSES</p> <p>- Can I upload my tools to the compromised workstation without being detected or do I have to stay in-memory?</p> <p>- Will the EDR detect if I use process injection to migrate to e.g. explorer.exe?</p> <p>- Can I dump LSASS and steal NTLM hashes?</p> <p>- Can I backdoor an application, e.g. Citrix Receiver to escalate privileges when another user logs in?</p> <p> <br/>On-host security products such as Anti-Virus (AV) and Endpoint Detection and Response (EDR) products aim to have sufficient surveillance of the host to ensure that attackers can't operate without being detected. One of the techniques such products use is known as Win32 API hooking in user mode. However, as the user-mode component of APIs are loaded and owned by the current process, the process itself can inspect, overwrite or simply just not use them and use its own implementation of the API functionality, to avoid messing with the hooks altogether. This talk will give an introduction to Win32 APIs, modules, API hooks and different bypass techniques that may be essential to avoiding detection.</p> <p>WHO CAN PARTICIPATE?<br/>The event is open for everyone - but it is highly technical.</p> <p>Photo: Blake Connally, Unsplash.com</p> "}, {"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "Workshop: Elastic SIEM (4 hr) (NEW DATE WILL BE FINAL 1ST WEEK OF MARCH)", "date": "2021-03-20", "time": "12:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/276244555/", "timezone": "Europe/Copenhagen", "description": "<p>NEW DATE WILL BE FINALLY DECIDED IN THE WEEK FIRST WEEK OF MARCH</p> <p>This time around OWASP Copenhagen will host a free 4hr workshop on Elastic SIEM courtesy of David Thejl-Clayton - SOC leader of JN Data.</p> <p>The workshop is designed to get you started using it and provide you with hands-on experience with that along with MISP and TheHive, two accompaning tools which, just as Elastic, are free to use.</p> <p>Everything will be held virtually. We will provide each student with their own virtual environment. Due to practical reasons we have limited seats to this so sign up before it's too late!</p> <p>We will include a high-level description of the workshop later.</p> "}, {"chapter": "Northern Virginia", "repo": "www-chapter-northern-virginia", "name": "Limiting Supply Chain Risk with Dependency-Track ", "date": "2021-03-18", "time": "18:30", "link": "https://www.meetup.com/OWASP-Northern-Virginia-Chapter/events/276682068/", "timezone": "US/Eastern", "description": "<p>Abstract:<br/>Dependency-Track is an intelligent Component Analysis platform that allows organizations to identify and reduce risk in the software supply chain. Dependency-Track takes a unique and highly beneficial approach by leveraging the capabilities of Software Bill of Materials (SBOM). This approach provides capabilities that traditional Software Composition Analysis (SCA) solutions cannot achieve.</p> <p>Discover the benefits of leveraging CycloneDX Software Bill of Materials along with OWASP Dependency-Track to identyify risk across a wider range of use cases.</p> <p>About Steve Springett:<br/>Steve educates teams on the strategy and specifics of developing secure software.</p> <p>He practices security at every stage of the development lifecycle by leading sessions on threat modeling, secure architecture and design, static/dynamic/component analysis, offensive research, and defensive programming techniques.</p> <p>Steve's passionate about helping organizations identify and reduce risk from the use of third-party and open source components. He is an open source advocate and leads the OWASP Dependency-Track project, OWASP Software Component Verification Standard (SCVS) project, CycloneDX software bill of material standard, and participates in several related projects and working groups.</p> "}, {"chapter": "Austin", "repo": "www-chapter-austin", "name": "OWASP Austin Chapter Monthly Meeting - March 2021", "date": "2021-03-30", "time": "11:45", "link": "https://www.meetup.com/OWASP-Austin-Chapter/events/276781839/", "timezone": "US/Central", "description": "<p>Chapter information and a presentation --</p> <p>Successful Customer Engagements using the OWASP Mobile Application Security Verification Standard</p> <p>Abstract:</p> <p>The team will be discussing Mobile Application Penetration Testing from the perspectives of original scoping and testing using OWASP’s Mobile Application Security Verification Standard including the various tools and resources available on both Android and IOS. We will be discussing not just the OWASP standard, but also give advice on lessons learned through our engagements highlighting several key issues and obstacles to consider for ensuring a successful experience for both the customer and your team.</p> <p>Speakers:</p> <p>-Mark Spears, Solis Security - Sr. Security Consultant &amp; Red Team Lead<br/>-Sam Danna, Solis Security - Security Consultant<br/>-Jon Adderholt, Solis Security - Security Consultant<br/>-Angela Lane, Solis Security – Project Manager</p> <p>Bio:<br/>Mark, Sam, and Jon comprise the Offensive Security Operations (aka Red Team) at Solis Security performing all sorts of engagements including Network, Web Application (+Mobile, APIs, and etc), Spearphishing, Wifi, Hardware Hacking, and more.</p> "}, {"chapter": "Cleveland", "repo": "www-chapter-cleveland", "name": "OWASP Cleveland Chapter - March Meeting", "date": "2021-03-26", "time": "18:30", "link": "https://www.meetup.com/owasp-cleveland-group/events/276777304/", "timezone": "US/Eastern", "description": "<p>Join the OWASP Cleveland Chapter for our March 2021 meeting where we will review the t-shirt design contest, expand on the OWASP Top 10, Zed Attack Proxy ZAP, Honeypots, and more.</p> "}, {"chapter": "Columbus", "repo": "www-chapter-columbus", "name": "Lessons learned from recent Supply Chain attacks", "date": "2021-03-25", "time": "12:00", "link": "https://www.meetup.com/Columbus-OWASP/events/276714213/", "timezone": "US/Eastern", "description": "<p>Hi everyone! We will start out with news and notes (virtually) and then talk about the Software Supply Chain.</p> <p>Description: Overview of lessons learned and key takeaways from recent Supply Chain attacks. Key takeaways:<br/>- Multiple vulnerabilities in target infrastructures can lead to build pipeline compromise<br/>- Potentially detailed internal working knowledge can be leveraged<br/>- Care was taken to avoid potential warnings and build failures<br/>- Unintended functionality deployed as part of signed update<br/>- Similar common weaknesses in typical information security blocking and tackling at victim sites were exploited to avoid detection<br/>- In all, there is no preventative or detective control domain within the Cyber Security realm that is unaffected by overall failures or weaknesses as part of an attack of this nature, from legal frameworks to advanced threat detection.</p> <p>Bio:<br/>Michael Fabian<br/>- Principal Consultant in Atlanta, GA<br/>- BS – Political Science<br/>- MS – information Systems – Information Security<br/>- MS – Systems Engineering<br/>Prior to Synopsys<br/>- 20 Years professional experience<br/>- 11 years in non-IT Systems Security<br/>- Experience from end user analysis to vendor product design<br/>- Industry Participation – From Medical Devices to Weapon Systems<br/>- Smart Grid Working Group (SGIP)<br/>- IEC/ISA TC65 – IEC 62443</p> "}, {"chapter": "Dallas", "repo": "www-chapter-dallas", "name": "OWASP Dallas March Meeting", "date": "2021-03-23", "time": "12:00", "link": "https://www.meetup.com/Dallas-The-Open-Web-Application-Security-Project-Meetup/events/276136637/", "timezone": "US/Central", "description": "<p>Title:</p> <p>Penetration Test at Scale: A Data-focused Approach</p> <p>Description:</p> <p>Managing a global application penetration testing program across the Enterprise poses operational challenges. Extracting and leverage meaningful data can minimize those challenges. We’ll look at some key components to consider for a successful program.</p> <p>Bio:</p> <p>Phillip Pham is an experienced cybersecurity professional with more than a decade of experience​ working in Big Four Consulting​, healthcare, financial​, and online services​ industries. Phillip has led offensive security programs and large-scale pen test engagements​. He is an Offensive Security Certified Professional (OSCP)​ and a SANS AppSec Fighter contributor​ (LinkedIn open-redirect disclosure​; DOM-based XSS in the wild).</p> "}, {"chapter": "Kansas City", "repo": "www-chapter-kansas-city", "name": "Open Web App Security Project - Kansas City Chapter Monthly Meeting", "date": "2021-03-22", "time": "18:00", "link": "https://www.meetup.com/OWASP-Kansas-City/events/mpsfjryccfbdc/", "timezone": "US/Central", "description": "<p>Meetings of the Kansas City chapter of the Open Web Application Security Project are held at 6:00pm on the fourth MONDAY of each month, usually at the Kauffman Foundation Conference Center at 4801 Rockhill Rd, Kansas City, MO. Attendance is open to everyone - membership is not required (though we invite you to join the global OWASP organization and list our chapter as your home chapter)! RSVPs are not required - we don't track membership - but it's definitely helpful for planning!</p> <p>Watch this space for more specific meeting details closer to the meeting date!</p> "}, {"chapter": "New York City", "repo": "www-chapter-new-york-city", "name": "Do certain types of developers or teams write more secure code? by Anita D'Amico", "date": "2021-04-08", "time": "19:00", "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/276109825/", "timezone": "US/Eastern", "description": "<p>Abstract: Why do some developers and development teams write more secure code than others? How do we account for the “human factors” that contribute to vulnerable software? This talk will describe several human factors—developer, team and environmental characteristics—that influence whether developers will inadvertently introduce security weaknesses into their code. I will present the results of research on how factors such as developer experience, disrupted attention, team size, team co-location, communication, work hours, and code rewrites affect software security. The research results are drawn from DoD-funded R&amp;D and academic research conducted on the software engineering practices used to develop both open-source and proprietary software.</p> <p>Speaker Bio: Anita D’Amico, PhD is CEO of Code Dx, Inc. which provides Application Security Orchestration and Correlation solutions to industry and government, and supports two OWASP projects, Code Pulse and Attack Surface Detector. Her roots are in experimental psychology and human factors, and she has built a career of leading technology development to enhance human performance. Her attention is now focused on enhancing the decisions and work processes of software developers and AppSec analysts to make code more secure. A 2016 Forbes article named Anita as one of “five cool women in security” who serve as role models for young women entering the field. More recently, Anita was named as one of “100 Fascinating Females Fighting Cybercrime” in the 2019 book “Women Know Cyber.”</p> "}, {"chapter": "New York City", "repo": "www-chapter-new-york-city", "name": "“Is blockchain really secure??” by Shrutirupa Banerjiee", "date": "2021-03-20", "time": "12:30", "link": "https://www.meetup.com/OWASP-New-York-City-Chapter/events/276820584/", "timezone": "US/Eastern", "description": "<p>Abstract:</p> <p>There is a lot of confusion related to blockchain and its security, and we can never ignore that. In this session, we will understand the basics of blockchain so that the security aspect of the same can be clarified. We will also go through some real-life attack scenarios.<br/>The only pre-requisite for the session is:<br/>The willingness to learn something interesting</p> <p>Bio:</p> <p>I am Shrutirupa Banerjiee (@freak_crypt). I have been in the field of security for over 2 and a half years. I am having experience in working on blockchain technologies and conducting security reviews for Web and mobile applications, and Ethereum based Smart Contracts in my previous role as an Information Security Consultant and research intern. Currently, I am independently researching on Ethereum Based Smart Contracts alongside working as a Web Application Security Analyst with the WAF Research team at Qualys. I am also the Pune Chapter Lead for the Infosecgirls community. I have also been a speaker at conferences such as Owasp Seasides 2019-2020, Bsides Singapore 2019, Rootconf 2019, Webinars, Cyberfrat, and Null Meets.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2021-03-25", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqyccfbhc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Salt Lake City", "repo": "www-chapter-salt-lake-city", "name": "March 2021 Chapter Meeting", "date": "2021-03-25", "time": "12:00", "link": "https://www.meetup.com/owasp-slc/events/276763741/", "timezone": "US/Mountain", "description": "<p>This month's meetup is VIRTUAL. Join Wasatch AppSec Slack (<a href=\"https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA\" class=\"linkified\">https://join.slack.com/t/wasatchappsec/shared_invite/zt-h8yyr334-Jz0aQD6CiXMzc5P3e_3JxA</a>) to suggest any additional topics.</p> <p>---------------------------------------------<br/>Agenda:<br/>12 - 12:50pm<br/>- Guest: Clint Gibler (@clintgibler), moderator of tldr;sec, will be joining us to talk about SemGrep</p> <p>Title: Semgrep: lightweight static analysis built for modern development</p> <p>Abstract: How we write software has changed, and many security tools have failed to keep up.</p> <p>This talk will introduce Semgrep, an open source, lightweight static analysis tool that’s fast (scans in minutes, not hours or days), easy to integrate into any CI system, and provides high signal results. Semgrep provides feedback wherever you want it - as GitHub PR comments, via Slack messages, or even in your IDE.</p> <p>We’ll provide an overview of how Semgrep works, how to roll it out to all of your repos in just a few minutes, and even how to write custom Semgrep rules unique to your company, without having to learn a painful DSL.</p> <p>12:50 - 1pm<br/>- Open Forum, Admin Items, Upcoming Events<br/>- Determine topic for next month<br/>---------------------------------------------</p> <p>Leaders Zoom Account Two is inviting you to a scheduled Zoom meeting.</p> <p>Topic: OWASP SLC March 2021 Chapter Meeting<br/>Time: Mar 25, 2021 12:00 PM Mountain Time (US and Canada)</p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/95489098638?pwd=cGVuWGJ1L0RrQ2RVbXZTOEx2V2lkUT09\" class=\"linkified\">https://zoom.us/j/95489098638?pwd=cGVuWGJ1L0RrQ2RVbXZTOEx2V2lkUT09</a></p> <p>Meeting ID: 954 8909 8638<br/>Passcode: 396952<br/>One tap mobile<br/>+16699006833,,95489098638# US (San Jose)<br/>+12532158782,,95489098638# US (Tacoma)</p> <p>Dial by your location<br/>+1 669 900 6833 US (San Jose)<br/>+1 253 215 8782 US (Tacoma)<br/>+1 346 248 7799 US (Houston)<br/>+1 301 715 8592 US (Washington DC)<br/>+1 312 626 6799 US (Chicago)<br/>+1 929 436 2866 US (New York)<br/>Meeting ID: 954 8909 8638<br/>Find your local number: <a href=\"https://zoom.us/u/aun59cFDS\" class=\"linkified\">https://zoom.us/u/aun59cFDS</a></p> "}, {"chapter": "Bristol Uk", "repo": "www-chapter-bristol-uk", "name": "Virtual Discussion: Stopping injection vulnerabilities with is_literal()", "date": "2021-03-18", "time": "18:00", "link": "https://www.meetup.com/OWASP-Bristol/events/276564621/", "timezone": "Europe/London", "description": "<p>Programming languages would ideally stop us from making mistakes. The biggest mistakes lead to injection vulnerabilities, where safe strings (defined by the programmer), are mixed with unsafe values (e.g. from the user).</p> <p>The is_literal() check is an ongoing project by Craig Francis and Dan Ackroyd, building on Google’s Christoph Kern’s work, as a way to check if a variable (e.g. an SQL string) is safe, to make sure there are no mistakes.</p> <p>We will start the evening with a quick talk about the idea, and the justification for why this check needs to exist - also available at:</p> <p><a href=\"https://github.com/craigfrancis/php-is-literal-rfc/blob/main/justification.md\" class=\"linkified\">https://github.com/craigfrancis/php-is-literal-rfc/blob/main/justification.md</a></p> <p>Then we will discuss any issues you can find, as well as our plan on how to get this proposal added to the PHP language:</p> <p><a href=\"https://wiki.php.net/rfc/is_literal\" class=\"linkified\">https://wiki.php.net/rfc/is_literal</a></p> <p>Join Zoom Meeting<br/><a href=\"https://zoom.us/j/93248737850?pwd=ZkN4ZnhnR0pISkhoNlMreWcwV0t0Zz09\" class=\"linkified\">https://zoom.us/j/93248737850?pwd=ZkN4ZnhnR0pISkhoNlMreWcwV0t0Zz09</a></p> <p>Meeting ID: 932 4873 7850<br/>Passcode: 338085<br/>One tap mobile<br/>+442080806592,,93248737850# United Kingdom<br/>+443300885830,,93248737850# United Kingdom</p> <p>Dial by your location<br/>+44 208 080 6592 United Kingdom<br/>+44 330 088 5830 United Kingdom<br/>+44 131 460 1196 United Kingdom<br/>+44 203 481 5237 United Kingdom<br/>+44 203 481 5240 United Kingdom<br/>+44 203 901 7895 United Kingdom<br/>+44 208 080 6591 United Kingdom<br/>Meeting ID: 932 4873 7850<br/>Find your local number: <a href=\"https://zoom.us/u/acGnAxw02x\" class=\"linkified\">https://zoom.us/u/acGnAxw02x</a></p> "}, {"chapter": "Hungary", "repo": "www-chapter-hungary", "name": "Return of The Security Champions! Ep. 1/2 [en,jitsi,yt,ch]", "date": "2021-03-10", "time": "19:00", "link": "https://www.meetup.com/OWASP-HU/events/276725029/", "timezone": "Europe/Budapest", "description": "<p>Join on Jitsi without any registration in your browser or in the Jitsi mobile app (just copy the below link as the name of the event):<br/><a href=\"https://8x8.vc/ddeu/owasp.2om\" class=\"linkified\">https://8x8.vc/ddeu/owasp.2om</a><br/>Or join on Clubhouse:<br/><a href=\"https://www.joinclubhouse.com/event/PbJZd1WR\" class=\"linkified\">https://www.joinclubhouse.com/event/PbJZd1WR</a><br/>Live on YT:<br/><a href=\"https://youtu.be/LPNZCKpJySU\" class=\"embedded\">https://youtu.be/LPNZCKpJySU</a></p> <p>### About</p> <p>This meetup takes two episodes to discuss the theory and the practice of security champions. In the first one on MAR10 Marcos Valle [Glovo!] speaks about the theory and also shares his experiences learned on the front lines. Later in March Julia Ganol will tell her experiences as a real security champion. Alexander, Davide, Péter and Timur will reflect on the main speakers interactively.</p> <p>So we start with Marcos who explains the upcoming version 2.0 of the Security Champions Playbook project by bringing new ideas when going through the 6-steps approach for implementing the program. From myths and pitfalls to training and continuous engagement strategies.</p> <p>According to OWASP definition, Security Champions are \"active members of a team that may help to make decisions about when to engage the Security Team\". They act as a core element of the security assurance process within the product or service, and hold the role of the Single Point of Contact (SPOC) within the team.</p> <p>The Security Champions Playbook describes the main steps for fast establishment of a Security Champions program regardless of the company size and maturity of the existing security processes. It is currently organized in the following steps:<br/>1. Identify teams<br/>2. Define the role<br/>3. Nominate Champions<br/>4. Set up communication channels<br/>5. Build solid knowledge base<br/>6. Maintain interest</p> <p>### Speakers</p> <p>The main speaker of the day Marcos Valle is a security engineer at Glovo, a fast-paced unicorn in the delivery segment. At Glovo, he leads the Product Security vertical and the Security Champions program. He is also responsible for implementing the secure CI/CD pipeline, managing vulnerabilities and fostering a company-wide security-by-design culture. Previously, he worked for several years in the military, mostly as a penetration tester for governmental partners. He currently lives in sunny Barcelona and is always up for talking about security, coding or just having a chilled conversation over some tapas.</p> <p>### Moderated by</p> <p>Timur Khrotko and Péter Nyilasy on behalf of OWASP HU</p> <p>### Meat links</p> <p>\"Security Champions v2.0\", a 2017 talk by Alexander Antukh:<br/><a href=\"https://owasp.org/www-pdf-archive/OWASP_Bucharest_2017_Antukh.pdf\" class=\"linkified\">https://owasp.org/www-pdf-archive/OWASP_Bucharest_2017_Antukh.pdf</a></p> <p>Security Champions Playbook v1.1, a project:<br/><a href=\"https://github.com/c0rdis/security-champions-playbook\" class=\"linkified\">https://github.com/c0rdis/security-champions-playbook</a></p> <p>\"Software security at the organizational level\", an article by Péter Nyilasy:<br/><a href=\"https://medium.com/defdeveu/software-security-at-the-organizational-level-980174615443\" class=\"linkified\">https://medium.com/defdeveu/software-security-at-the-organizational-level-980174615443</a></p> <p>\"Organizational glue (OD approach to the champs dilemma)\" a Global AppSec 2020 talk by Péter Nyilasy w/ Timur Khrotko:<br/><a href=\"https://youtu.be/OsHNYG8uciM\" class=\"embedded\">https://youtu.be/OsHNYG8uciM</a></p> <p>### Credits<br/>Photo by Karsten Winegeart on Unsplash</p> "}, {"chapter": "Norway", "repo": "www-chapter-norway", "name": "Google's Differential Privacy Library – Mirac Vuslat Basaran (Google)", "date": "2021-03-17", "time": "19:00", "link": "https://www.meetup.com/OWASP-Norway/events/276469937/", "timezone": "Europe/Oslo", "description": "<p>Differential privacy helps organizations derive insights from data while simultaneously ensuring that those results do not allow any individual's data to be distinguished or re-identified. Sound interesting?<br/>Come hear Mirac Vuslat Basaran (Google) talk about Google's Differential Privacy Library!</p> <p>We will start with a brief introduction to differential privacy and why it might be useful for you. Then, we will go through what kind of tools and functionalities Google's Differential Privacy Library supports such as secure noise implementations, different aggregations, end-to-end systems that require only minimal knowledge of differential privacy, etc.<br/>Finally, we'll talk about future plans for the library.</p> <p>We'll finish with a short Q&amp;A.</p> <p>Mirac is a Software Engineer in the area of anonymization and differential privacy at Google. Before joining Google, he studied Computer Engineering (and Economics) at Bilkent University. Currently, he helps build and open source infrastructure for product teams to anonymize their data. He also consults product teams on anonymization and differential privacy.</p> <p>URL to Google's Differential Privacy Library:<br/><a href=\"https://github.com/google/differential-privacy\" class=\"linkified\">https://github.com/google/differential-privacy</a></p> "}, {"chapter": "Timisoara", "repo": "www-chapter-timisoara", "name": "OWASP Timisoara #18 - Security Automation, Code Patterns (Online)", "date": "2021-03-18", "time": "18:30", "link": "https://www.meetup.com/OWASP-Timisoara-Chapter/events/276604009/", "timezone": "Europe/Bucharest", "description": "<p>The next OWASP Timisoara Chapter Meeting will be online.</p> <p>&gt; Spring sessions - Theme: Security Automation &amp; Intelligence, Code Patters</p> <p>&gt; Schedule:<br/>Introduction, OWASP News &amp; Updates - Catalin Curelaru</p> <p>Surface Security - Security Intelligence Automation Platform - Teofil Cojocariu (Paddy Power Betfair)</p> <p>Detect complex code patterns using semantic grep - Bence Nagy (Semgrep)</p> <p>Time: 18:30 to 20:30</p> <p>&gt;&gt;Abstract - Surface Security:<br/>Our external attack surface is constantly growing, which gives external attackers the opportunity to continuously search for new attack vectors. In order to successfully respond to Security incidents we needed a centralized platform which aggregates all the data about our premises in a single place.</p> <p>Surface Security (Security Intelligence Automation Platform) is an internally built tool which assists our internal Security teams to gain a holistic view about our externally exposed assets. More than that, it facilitates faster incident response based on the information correlated by it. Surface started as a small project in which we tried to close the gaps identified in our security controls. The platform's core is built in Django which is a Python-based open-source framework which has a fast learning curve. Besides Django, we're using technologies like Ansible (automation), Dkron (fault-tolerant jobs), Elasticsearch (Security metrics storage) and Grafana (reporting). During the whole period it gained a lot of traction in our company determining people to contribute to its success by implementing and suggesting new features. We're currently utilizing it for reporting the Security gaps to other areas of key business areas and for Security controls like: monitoring our externally exposed assets, vulnerability management, security incidents, bug bounty reports and penetration testing.</p> <p>Bio:<br/>I'm focused on Application Security Engineering &amp; Penetration Testing combined with CAMS mindset (Culture, Automation, Measurement, Sharing - DevSecOps) and I reported security bugs to Google, Facebook, Uber, Bitdefender, ING Bank, Yahoo or other companies. One of the most interesting thing is that I built a platform \"Surface - Security Intelligence Automation Platform\" which is being used by more than 900 people in Paddy Power Betfair, Flutter and I was the Security SME for a Private Cloud based on OpenStack with environments as code.</p> <p>&gt;&gt;Abstract - Detect complex code patterns using semantic grep<br/>We’ll discuss a program analysis tool we’re developing called Semgrep. It's a multilingual semantic tool for writing security and correctness queries on source code (for Python, Java, Go, C, and JS) with a simple “grep-like” interface. The original author, Yoann Padioleau, worked on Semgrep’s predecessor, Coccinelle, for Linux kernel refactoring, and later developed Semgrep while at Facebook. He’s now full time with us at r2c. Semgrep is a free open-source program analysis toolkit that finds bugs using custom analysis we’ve written and OSS code checks. Semgrep is ideal for security researchers, product security engineers, and developers who want to find complex code patterns without extensive knowledge of ASTs or advanced program analysis concepts.<br/>For example, find subprocess calls with shell=True in Python using the query:<br/>subprocess.open(..., shell=True)<br/>This will even find snippets like:<br/>import subprocess as s<br/>s.open(f'rm {args}', shell=True)</p> <p>Bio:<br/>Bence Nagy is a software engineer at r2c, working on Semgrep, an open-source syntax-aware code search tool. At r2c, his responsibilities tend towards building various interfaces atop the core semgrep CLI. These include CI integrations, editor extensions, and the semgrep.dev web app. He previously led a developer experience team at Kiwi.com, the Czech Republic’s top startup at the time of its acquisition in 2019. You should totally ask him for video game recommendations after the talk.</p> "}, {"chapter": "Cork", "repo": "www-chapter-cork", "name": "OWASP Cork - Adversarial machine learning", "date": "2021-03-23", "time": "18:00", "link": "https://www.meetup.com/OWASP-Cork/events/276818788/", "timezone": "Europe/Dublin", "description": "<p>**** Meeting link will be added closer to the date and accessible to those who RSVP only ****</p> <p>Talk 1: Deep malware obfuscation<br/>Speaker: Saeid Rezaei - Machine learning researcher at University College Cork</p> <p>Deep learning has been widely utilized in many practical applications and achieved remarkable commercial success. It can be used in malware obfuscation engines which are used to secure digital rights management against hackers, and bypass anti-malware programs. In the real world scenarios, there are some constraints that should be considered during malware obfuscation. Using deep learning can help to select the best samples which are satisfying these constraints. In this presentation, we will show how can we use deep learning techniques to improve the performance of obfuscator engines against malware detection techniques.</p> <p>Talk 2: Adversarial machine learning (AML)<br/>Speakers: Dr. Sorcha Healy Principal Engineer, Lead Data Scientist at McAfee and Dr. Catherine Huang - Principal Engineer and Senior Staff Data Scientist at McAfee</p> <p>In this talk Sorcha and Catherine will review the general attack landscape against ML and ML security providers. Understanding the fundamentals behind what a machine learning model does and how it works in combination with the Mitre Adversarial Matrix can provide some sensible MLOps practices to protect the components of a ML system. We will review adversarial machine learning (AML) use cases and demonstrate McAfee’s applied research in AML in protecting our customers against this hostile landscape.</p> "}]