[{"chapter": "Ottawa", "repo": "www-chapter-ottawa", "name": "OWASP Ottawa: January 2021 Meetup", "date": "2021-01-20", "time": "19:00", "link": "https://www.meetup.com/OWASP-Ottawa/events/275540224/", "timezone": "Canada/Eastern", "description": "<p>Special Notice:</p> <p>Due to the COVID-19 (Coronavirus) pandemic our events will continue online on our YouTube channel.</p> <p>Subscribe to our YouTube channel, set a reminder and you’ll get a notification as soon as we go live!</p> <p>We will post information here and on all our other medias (email, twitter etc.) as we are closer to the date.</p> <p><a href=\"https://www.youtube.com/watch?v=6tiOc1OO2PI\" class=\"embedded\">https://www.youtube.com/watch?v=6tiOc1OO2PI</a></p> <p>7:00 EDT PM: Technical Talks</p> <p>1. Announcements</p> <p>2. The Elephant Room: Presentations on Those things we all deal with but nobody talks about.</p> <p>Abstract:<br/>This meetup we are fortunate to have Dr. Gordon Josephson, a local clinical psychologist, who will respond to the questions we received in our brief online survey on Workplace Stress and Mental Health in the IT and Security Fields.</p> <p>Bio:</p> <p>Dr. Gordon Josephson is registered as a psychologist with the College of Psychologists of Ontario and has been working in private practice since 2004. Dr. Josephson obtained a doctoral degree in Clinical Psychology from the University of Ottawa in 2004. Prior to this, he worked both internationally and in the Federal Government and as such he brings to his interactions with clients his experience and knowledge from working cross-culturally and in the culture of the Federal Government.</p> <p>Dr. Josephson provides psychotherapy and assessment services to adults experiencing a variety of challenges such as: anxiety, depression, stress, anger, relationship difficulties, career concerns and adjustment to major life changes (including injury and illness).</p> <p>Dr. Josephson has a longstanding interest in Health Psychology and in the role of Psychology in not only treating but preventing physical and mental health problems; particularly through assisting people to better understand and increase their motivation for emotional and physical self-care/fitness.</p> "}, {"chapter": "Jakarta", "repo": "www-chapter-jakarta", "name": "Strategic Usage of OWASP SAMM and OWASP DSOMM", "date": "2021-01-23", "time": "15:00", "link": "https://www.meetup.com/OWASP-Jakarta-Chapter/events/275425229/", "timezone": "Asia/Jakarta", "description": "<p>Strategic Usage of OWASP SAMM and OWASP DSOMM</p> <p>Description :<br/>From a startup to a multinational corporation the software development industry is currently dominated by agile frameworks and product teams and as part of it DevOps strategies.</p> <p>It has been observed that during implementation, security aspects can be missed. The OWASP Software Assurance Maturity Model and the OWASP DevSecOps Maturity Model, which are presented in the talk, show security measures which are applied when using DevOps strategies and how these can be prioritized. With the help of DevOps strategies security can also be enhanced. Under the guidance of the forward-looking DevSecOps Maturity Model, appropriate principles and measures can defend against attacks.</p> <p>In this session Timo will give an introduction and answers questions like when to use OWASP SAMM and when and how to use DSOMM.</p> <p>Bio:<br/>Timo has been in the IT industry for over twenty years. After being a system administrator and web developer in his early times, he became involved in OWASP. He now advises his clients on DevOps security, either hands on or as a trainer, with the focus on security test automation for software and infrastructure.<br/>more details :<br/><a href=\"https://pagel.pro/\" class=\"linkified\">https://pagel.pro/</a></p> "}, {"chapter": "Copenhagen", "repo": "www-chapter-copenhagen", "name": "Panel Debate, Post Pandemic Cybersecurity", "date": "2021-01-21", "time": "20:00", "link": "https://www.meetup.com/OWASP-Copenhagen-Chapter/events/275404398/", "timezone": "Europe/Copenhagen", "description": "<p>On January 21st you will have the opportunity to listen to and ask questions for not one, but three panelists about security in a post-pandemic world.</p> <p>As we move into this mid- and post-pandemic world with remote and in-office work blending, what must organizations consider, in order to sustain data and application security and privacy while still considering an efficient working- and user experience? How does remote work change the security stack mix? And what’s still missing?</p> <p>We will also be diving into how innovation in cyber became a must and how that can and will support companies and users on a daily basis.</p> <p>YOUR PANELISTS ARE</p> <p>Lone Juul Dransfeldt Christensen, Senior Security Architect at Bang &amp; Olufsen. Formely in NNIT, the Danish Police.<br/><a href=\"https://www.linkedin.com/in/ldransfeldt/\" class=\"linkified\">https://www.linkedin.com/in/ldransfeldt/</a></p> <p>Martin Clausen, Chief Security Architect, Head of Architecture, Research and Development at Saxo Bank. Former Head of Cyber Innovation Labs at Danske Bank.<br/><a href=\"https://www.linkedin.com/in/martin-clausen/\" class=\"linkified\">https://www.linkedin.com/in/martin-clausen/</a></p> <p>To build suspense, the name of the third and final panelist will be published in January.</p> <p>YOU CAN ASK QUESTIONS<br/>Is there a question you want to ask the panelists? Write a comment below with your question, or go to twitter, mention OWASPCPH together with you question, and we will collect them and prepare for the panelists!<br/><a href=\"https://twitter.com/owaspcph\" class=\"linkified\">https://twitter.com/owaspcph</a></p> <p>THIS IS AN ONLINE EVENT<br/>Before January 21st, you will receive an e-mail with a link for the event.</p> "}, {"chapter": "Charlotte", "repo": "www-chapter-charlotte", "name": "2021 Kickoff Meeting (Security in a post COVID World)", "date": "2021-01-21", "time": "19:00", "link": "https://www.meetup.com/owaspCLT/events/274975479/", "timezone": "US/Eastern", "description": "<p>Come join us for our First meeting of the year and a frank discussion of Covid and its affect on security this year.</p> "}, {"chapter": "Triangle Nc", "repo": "www-chapter-triangle-nc", "name": "Speaker TBA - Contact us if interested", "date": "2021-01-28", "time": "18:30", "link": "https://www.meetup.com/owasptriangle/events/lckdnqycccblc/", "timezone": "US/Eastern", "description": "<p>TBA</p> "}, {"chapter": "Sacramento", "repo": "www-chapter-sacramento", "name": "OWASP Sacramento Hangout (Google Meet)", "date": "2021-01-21", "time": "17:00", "link": "https://www.meetup.com/OWASP-Sacramento-Chapter/events/275554873/", "timezone": "US/Pacific", "description": "<p>Please note that this meetup is remote only!! Meetup won’t let us remove the location!!</p> <p>Happy New Years, Chapter!</p> <p>Hope everyone is healthy and safe!</p> <p>This month, continuing our abundance of caution, we are going to hold our meetup remotely on Google Hangouts. Please try to join from a computer.</p> <p>Agenda:<br/>- Community Topics<br/>- OWASP Membership and upcoming events<br/>- Main Topic: Threatspec - how to Threat Model code better.<br/>- Q&amp;A</p> <p>For more information about OWASP, please visit our Wiki at <a href=\"https://owasp.org/www-chapter-sacramento/\" class=\"linkified\">https://owasp.org/www-chapter-sacramento/</a></p> "}, {"chapter": "Dhaka", "repo": "www-chapter-dhaka", "name": "OWASP API Security Top 10", "date": "2021-01-22", "time": "19:00", "link": "https://www.meetup.com/OWASP-Dhaka-Chapter/events/275364270/", "timezone": "Asia/Dhaka", "description": "<p>In December 2019, OWASP published its first top 10 risk list for API security. With this step, OWASP confirms the increasing importance of API security for companies. The talk looks at the new risks and contrasts them with the top 10 risks for web applications. While security products can help to mitigate certain risks as an additional defense line, API developers have the ultimate responsibility for their code and must know the risks to avoid them.</p> <p>This will be an online live event (link will be added before the event).</p> <p>Speaker Biodata of Mr. Md Jahangir Alam:<br/>Md Jahangir Alam is the leader of the OWASP Dhaka Chapter. He is the Head of IT Security at Shimanto Bank Limited and Director of Marketing, ISACA Dhaka Chapter. He is a Certified Information System Auditor (CISA), ISO 27001 Lead Auditor, Certified Ethical Hacker (CEH), Certified Blockchain Professional (CBP), and Lean Six Sigma Black Belt (LSSBB). He is a CSE Graduate from a reputed private university in Bangladesh.</p> "}, {"chapter": "Nagpur", "repo": "www-chapter-nagpur", "name": "OWASP Nagpur Unofficial Meetup (Virtual)", "date": "2021-01-10", "time": "10:00", "link": "https://www.meetup.com/OWASP-Nagpur-Chapter/events/275577432/", "timezone": "Asia/Calcutta", "description": "<p>Agenda:</p> <p>1.Discuss Developments in AppSec/InfoSec<br/>2.Revision to the Chapter Handbook Rules<br/>3.Up-ing the Chapter Game<br/>4.Your Inputs<br/>5.Chitchat , Networking and Coffee</p> "}, {"chapter": "Victoria", "repo": "www-chapter-victoria", "name": "January 2021 Virtual AppSec Meetup", "date": "2021-01-20", "time": "18:00", "link": "https://www.meetup.com/OWASP-Victoria-Chapter/events/275339332/", "timezone": "Canada/Pacific", "description": "<p>The OWASP Victoria chapter is pleased to present our first<br/>event since OWASP BC Day. Michael Cavallin will be delivering a talk on Zero Trust Design for Web Applications.</p> <p>The event will be held online on January 20th from 6:00pm – 7:30pm.</p> <p>It will feature Michael’s talk followed by a Q&amp;A and a draw for a prize (must be registered member). Join us for an evening of application security in the new year!</p> <p>Visit our OWASP Chapter to learn more about us at <a href=\"https://owasp.org/www-chapter-victoria/\" class=\"linkified\">https://owasp.org/www-chapter-victoria/</a></p> <p>Speaker: Michael Cavallin<br/>Presentation: Zero Trust Design for Web Applications (1.5 hr)<br/>Abstract: TBA<br/>Biography: TBA</p> "}]